Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: '{{ctrl.newData.$$name}}' already exists
fr_fr: '{{ctrl.newData.$$name}}' existe déjà

source: '{{newData.$$name}}' already exists
fr_fr: '{{newData.$$name}}' existe déjà

source: (displayed in editor's property panel)
fr_fr: (affiché dans le panneau de propriétés de l'éditeur)

source: (used in your template and controller)
fr_fr: (utilisé dans le template et le controller)

source: 7.5 Migration notes
fr_fr: Informations de migration vers Bonita 7.5

source: <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> String variables (with or without time information)
fr_fr: Variables de type String au format <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> (avec ou sans information de fuseau horaire)

source: <b><em>Now</em> button</b> sets the selected date and time to the current date and time for the user. For the time, it is rounded up or down to the closest 5 min value.
fr_fr: <b>Le bouton <em>Maintenant</em></b> affiche dans le widget la date et l'heure courantes de l’utilisateur, arrondies aux 5 min les plus proches.

source: <b><em>Today</em> button</b> sets the selected date to the current date for the user. It doesn't change the selected time, except when the time is not set. In that case, it's rounded up or down to the closest 5 min value.
fr_fr: <b>Le bouton <em>Aujourd'hui</em></b> affiche dans le widget la date du jour de l’utilisateur. Si l'heure est déjà définie, elle est gardée telle quelle. Sinon, elle est arrondi à la dizaine de minutes la plus proche de l'heure actuelle.

source: <b>Note</b>: Custom-widget assets are only editable in widget editor. You can't modify them at page level to avoid side effects on other pages. So if you want to reorder custom-widget assets, please go to widget editor.
fr_fr: <b>Note</b> : Les assets des widgets personnalisés ne sont modifiables que dans l'éditeur de widget. Les modifier au niveau de la page pourrait induire des effets de bord sur d'autres pages. Donc pour réorganiser les assets des widgets personnalisés, ouvrez l'éditeur de widget.

source: <b>To update a form during production</b>, export the form from the UI Designer, import it into the relevant process in the portal, and then map it to the relevant task or process start event.
fr_fr: <b>Pour mettre à jour un formulaire en cours de production</b>, exportez le formulaire depuis le UI Designer, importez-le dans le processus approprié du portail, puis associez-le à la tâche ou à l'événement de démarrage du processus.

source: <b>To use a form in a process</b>, map it in the studio to the relevant process or human task. It will be automatically packaged in the .bar archive ready to deploy in the portal.
fr_fr: <b> Pour utiliser un formulaire dans un processus</b>, associez-le dans le studio au pool ou à une tâche humaine. Il sera automatiquement packagé dans l'archive .bar prête à être déployée dans le portail.

source: <b>To use a layout in a business application</b>, export it from the UI Designer, import it into the portal as a resource and map it as the layout of the relevant application.
fr_fr: <b>Pour utiliser un layout dans une application métier</b>, exportez-le depuis le UI Designer et importez-le dans le portail en tant que ressource. Enfin, déclarez-le en tant que layout dans l'application souhaitée.

source: <b>To use a page in a business application</b>, export it from the UI Designer, import it into Bonita Portal resources, and from the relevant application, add it to the list of pages and to a navigation menu.
fr_fr: <b>Pour utiliser une page dans une application métier</b>, exportez-la depuis le UI Designer et importez-la dans Bonita Portal en tant que ressource. Puis, à partir de l'application souhaitée, ajoutez-la à la liste des pages et si besoin, associez-lui un menu de navigation.

source: <b>UI Designer version</b>: {{ctrl.getUidVersion()}} - <b>Model version</b>: {{ctrl.getModelVersion()}}
fr_fr: <b>Version du UI Designer</b>: {{ctrl.getUidVersion()}} - <b>Modèle version</b>: {{ctrl.getModelVersion()}}

source: <b>With <em>Handle time zone</em> set to "no"</b>: User time zone is ignored and the value of the widget does not contain any time zone information (e.g., yyyy-MM-ddTHH:mm:ss).
fr_fr: <b>Lorsque <em>Gérer fuseaux horaires</em> est à "non"</b> : le fuseau horaire de l’utilisateur est ignoré et la <em>Valeur</em> du widget ne contient aucune information de fuseau horaire (par exemple, yyyy-MM-ddTHH:mm:ss).

source: <b>With <em>Handle time zone</em> set to "yes"</b>: the <em>Value</em> of the widget is in UTC (e.g., yyyy-MM-ddTHH:mm:ssZ).
fr_fr: <b>Lorsque <em>Gérer fuseaux horaires</em> est à "oui"</b> : la <em>Valeur</em> du widget est en UTC (par exemple, yyyy-MM-ddTHH:mm:ssZ).

source: <b>{{ctrl.artifact.name}}</b> successfully migrated.
fr_fr: <b>{{ctrl.artifact.name}}</b> migré avec succès.

source: <b>{{ctrl.artifact.name}}</b> was migrated from <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> to <b>{{ctrl.migrationReport.newArtifactVersion}}</b> with some warning.
fr_fr: <b>{{ctrl.artifact.name}}</b> a été migré de <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> à <b>{{ctrl.migrationReport.newArtifactVersion}}</b> avec des avertissements.

source: <b>{{ctrl.artifact}}</b> {{ctrl.type}} has been created in an older version of the UI Designer. It needs to be migrated to the current version to be used with the latest features. This migration is automatic. <br> Note that once migrated, the page cannot be brought back to its previous state, and cannot be used in a previous version of the UI Designer.
fr_fr: <b>{{ctrl.artifact}}</b> {{ctrl.type}} a été créé dans une ancienne version du UI Designer. Il doit être migré vers la version actuelle pour être utilisé avec les dernières fonctionnalités. Cette migration est automatique. <br> Notez qu'une fois migrée, la page ne peut pas être ramenée à son état précédent, et ne peut pas être utilisé dans une version précédente du UI Designer.

source: <code>Bordered</code><em>(Default: no)</em>: Display cells with border.
fr_fr: <code>Bordure</code><em>(par défaut : non)</em>: Afficher les bordures des cellules.

source: <code>Bordered</code><em>(Defaults: no)</em>: Display cells with border.
fr_fr: <code>Bordures</code><em>(par défaut : non)</em>: Afficher les bordures des cellules.

source: <code>Condensed</code><em>(Default: no)</em>: Display cells without spacing.
fr_fr: <code>Condensé</code><em>(par défaut : non)</em> : Supprimer les espaces dans les cellules.

source: <code>Condensed</code><em>(Defaults: no)</em>: Display cells without spacing.
fr_fr: <code>Condensé</code><em>(par défaut : non)</em> : Supprimer les espaces dans les cellules.

source: <code>Title</code>: can be calculated dynamically to display and <b>render html</b>.
fr_fr: <code>Titre</code> : peut être calculé dynamiquement pour afficher un <b>rendu html</b>.

source: <code>Zebra-striping</code><em>(Default: yes)</em>: Apply a Zebra style (this style set a different background color on even and odd lines).
fr_fr: <code>Rayures</code><em>(par défaut : oui)</em>: Appliquer un style "rayures" (couleur de fond différente entre lignes paires et impaires).

source: <code>Zebra-striping</code><em>(Defaults: yes)</em>: Apply a Zebra style (this style set a different background color on even and odd lines).
fr_fr: <code>Rayures</code><em>(par défaut : oui)</em>: Appliquer un style "rayures" (couleur de fond différente entre lignes paires et impaires).

source: <code>context</code> is an External API.
fr_fr: <code>context</code> est une API externe.

source: <code>cssClasses</code> <em>(Default: none)</em>: Add css classes on tab. This css class will be attached to <strong>tab-heading</strong> html element.
fr_fr: <code>Classes CSS</code> <em>(par défaut : aucune)</em> : Ajouter des classes CSS sur l'onglet. Ces classes CSS seront attachées à l'élément html <strong>tab-heading</strong> .

source: <code>disabled</code> <em>(Default: no)</em>: Whether tab is clickable and can be activated.
fr_fr: <code>Désactivé</code> <em>(par défaut : non)</em>: Définit si l'onglet est activé (cliquable) ou non.

source: <code>formInput</code> is a JSON object. <br>Its structure is defined by the contract inputs and the attributes are initialized with default values. It could be used to set initial values for form fields. <br>You can set the values in <code>formInput</code> either by editing the default values with constants (useful for test and debug) or with values from an object in an external source that has the same model (such as with a BDM external API). <br>You can also set the initial values of a form from some other source without using <code>formInput</code>. However, you will then have to edit <code>formOutput</code> manually.
fr_fr: <code>formInput</code> est un objet JSON. <br>Sa structure est définie par les inputs du contrat et ses attributs sont initialisés avec des valeurs par défaut. Il peut être utilisé pour définir les valeurs initiales des champs du formulaire. <br>Pour définir les valeurs de<code>formInput</code>, remplacez ces valeurs par défaut par des constantes (pour le test et debug) ou par les valeurs d'un objet ayant le même modèle, provenant d'une source externe (une external API de BDM, par exemple). <br>Vous pouvez également définir les valeurs initiales du formulaire à partir d'une autre source, sans utiliser <code>formInput</code>. Toutefois, vous devrez alors modifier manuellement la variable <code>formOutput</code>.

source: <code>formOutput</code> is a JavaScript expression returning an object. <br>Its structure matches the contract requirements and is filled with <code>formInput</code> by default. Its goal is to aggregate the fields from the form and to submit them to the task or process to fulfil the contract. On Submit, values entered or modified by the end-user and aggregated in the <code>formOutput</code> object (as defined by the <i>Data sent on click</i> property of the Submit button) are submitted to the process or task
fr_fr: <code>formOutput</code> est une expression JavaScript qui retourne un objet. <br>Sa structure correspond aux exigences du contrat et est pré-remplie par <code>formInput</code> par défaut. Son but est d'agréger les champs du formulaire et de les soumettre à la tâche ou au processus pour remplir le contrat. A la soumission du formulaire, les valeurs entrées ou modifiées par l'utilisateur sont agrégées dans l'objet <code>formOutput</code> (tel que défini par la propriété <i>Données envoyées au clic</i> du bouton Submit) et envoyées au processus ou à la tâche

source: <code>hidden</code> <em>(Default: no)</em>: Whether tab is hidden or not.
fr_fr: <code>Caché</code> <em>(par défaut : non)</em>: Définit si l'onglet est caché ou non.

source: <code>submit_errors_list</code> is a JavaScript expression formatting the response payload to html when a submit fails.
fr_fr: <code>submit_errors_list</code> est une expression JavaScript formatant le payload de la réponse en HTML lorsqu'une soumission échoue.

source: <code>taskId</code> is a URL Parameter. <br>It is the id of the current BPM task. You can use it as a BPM API parameter.
fr_fr: <code>taskId</code> est un paramètre d'URL. <br>C'est l'id de la tâche BPM courante. Vous pouvez l'utiliser comme paramètre d'API BPM.

source: <em><b>Example</b></em>: use the key <em>button.submit.name</em> on the <b>Label</b> property of a submit button. Use the key <em>date.format</em> on the <b>Date format</b> property and <em>date.placeholder</em> on the <b>Placeholder</b> property on a Date Picker widget. Then, change the <em>localization.json</em> asset to add the <em>button.submit.name</em>, <em>date.format</em> in English, <em>date.placeholder</em> translations.
fr_fr: <em><b>Exemple</b></em>: Utilisez la clé <em>nom.submit.bouton</em> pour la propriété <b>Libellé</b> d'un bouton Submit. Utilisez la clé <em>format.date</em> pour la propriété <b>Format de la date</b> et <em>placeholder.date</em> pour la propriété <b>Placeholder</b> du widget Date picker. Ensuite, mettez l'asset <em>localization.json</em> à jour avec les traductions de <em>nom.bouton.submit</em>, <em>format.date</em> en anglais, et <em>placeholder.date</em> dans la langue de traduction.

source: <em>Add to collection</em> or <em>Remove from collection</em> actions can be used to prepare the data before sending it to the server (e.g. if you have a process/task contract with an input that is multiple). No request will be sent to the server. The button will just update the <em>Collection</em> data which must be a variable of type array (<code>[]</code> in JSON).
fr_fr: Les actions <em>Ajouter à la collection</em> ou <em>Supprimer de la collection</em> peuvent être utilisées pour préparer les données avant de les envoyer au serveur (ex. si vous avez un contrat de processus/tâche avec un input multiple). Aucune demande ne sera envoyée au serveur. Le bouton mettra juste à jour les données de la <em>Collection</em> qui doivent être une variable de type tableau (<code>[]</code> en JSON).

source: <em>DATE (NOT RECOMMENDED)</em> (based on <code>java.util.Date</code>)
fr_fr: <em>DATE (NOT RECOMMENDED)</em> (basé sur <code>java.util.Date</code>)

source: <em>DATE ONLY</em> (based on <code>java.time.LocalDate</code>)
fr_fr: <em>DATE ONLY</em> (basé sur <code>java.time.LocalDate</code>)

source: <em>DATE-TIME (NO TIME ZONE)</em> (based on <code>java.time.LocalDateTime</code>): set the property <em>Handle time zone</em> to "No"
fr_fr: <em>DATE-TIME (NO TIME ZONE)</em> (basé sur <code>java.time.LocalDateTime</code>) : mettre la propriété <em>Gérer fuseau horaire</em> à "non"

source: <em>DATE-TIME (TIME ZONE)</em> (based on <code>java.time.OffsetDateTime</code>): set the property <em>Handle time zone</em> to "Yes"
fr_fr: <em>DATE-TIME (TIME ZONE)</em> (basé sur <code>java.time.OffsetDateTime</code>) : mettre la propriété <em>Gérer fuseau horaire</em> à "oui"

source: <em>Failed response value</em>: the variable will be set if the request is unsuccessful (code 4XX)
fr_fr: <em>Valeur de réponse en cas d'échec</em> : la variable sera définie si la demande est en échec (code 4XX)

source: <em>Note about the</em> Date Picker <em>and</em> Date Time Picker <em>widgets:</em> the <em>Placeholder</em> property translations must match the <em>Technical format</em> property values (order and number of letters). However, the <em>Placeholder</em> key should be different from the <em>Technical format</em> key to avoid translations mismatches.
fr_fr: <em>Note sur les widgets</em> Date <em>et</em> Date Time : la traduction de la propriété <em>Placeholder</em> doit être cohérente avec celle de la propriété <em>Format technique de la date</em> (ordre et nombre de lettres). Cependant, leurs clés de traduction doivent être différentes, pour éviter toute incohérence de traduction.

source: <em>Successful response value</em>: the variable will be set if the request is successful (code 2XX)
fr_fr: <em>Valeur de réponse en cas de succès</em> : la variable sera définie si la demande est à succès (code 2XX)

source: <i class="fa fa-warning"></i>&nbsp;By convention, the file has to be named <em>localization.json</em>
fr_fr: <i class="fa fa-warning"></i>&nbsp;Par convention, le fichier doit être nommé <em>localization.json</em>

source: <i>context.myDocument_ref</i> or <i>myVar.myDocument_ref</i>
fr_fr: <i>context.myDocument_ref</i> ou <i>myVar.myDocument_ref</i>

source: <p><span class="tip">Tip:</span> You can use new <i>Business data</i> type to get a business data object from Business Data Model</p> <p><span class="tip">Tip:</span> You can use data in the URL, by using the syntax <em ng-non-bindable>{{dataName}}</em></p> <p><span class="tip">Tip:</span> You can extend our REST API capabilities by creating <em>REST API extensions</em> in the Studio <i>Development</i> menu and use them here</p>
fr_fr: <p><span class="tip">Astuce :</span> Vous pouvez utiliser le nouveau type <i>Business data</i> pour obtenir un objet de données métier à partir du Modèle de Données Métier</p> <p><span class="tip">Astuce :</span> Vous pouvez utiliser des données dans l'URL, en utlisant la syntaxe <em ng-non-bindable>{{dataName}}</em></p> <p><span class="tip">Astuce :</span> Vous pouvez étendre nos capacités d'API REST en créant des <em>Extensions d'API REST</em> dans le menu Studio <i>Développement</i> et en les utilisant ici</p>

source: <span class="tip">Tip:</span> Array syntax: ["val1", "val2"], Object syntax: {"key": "value"}
fr_fr: <span class="tip"> Astuce :</span> Syntaxe d'un tableau : ["val1", "val2"] ; Syntaxe d'un objet : {"key": "valeur"}

source: <span class="tip">Tip:</span> Hit <span class="key">$</span> key to access data, use ctrl-space to trigger autocomplete.
fr_fr: <span class="tip">Astuce:</span> Utilisez la touche <span class="key">$</span> pour accéder aux variables, utilisez ctrl-espace pour déclencher la complétion automatique.

source: <span class="tip">Tip:</span> URL parameters are located after a <em>?</em> in the page URL.
fr_fr: <span class="tip"> Astuce :</span> Les paramètres d'URL se situent après un <em>?</em> dans l'URL de la page.

source: <span>Create a new variable</span>
fr_fr: <span>Créer une nouvelle variable</span>

source: <strong>$collection</strong>: the current collection
fr_fr: <strong>$collection</strong> : la collection courante

source: <strong>$index</strong>: the index of the current iteration of the collection (counting from zero)
fr_fr: <strong>$index</strong> : l'index de l'itération courante de la collection (démarrant à zéro)

source: <strong>$item</strong>: the element of the current iteration
fr_fr: <strong>$item</strong> : l'élément de l'itération courante

source: <strong>{{newData.businessObject.name}}</strong> doesn't exist in the Business Data Model currently deployed.
fr_fr: <strong>{{newData.businessObject.name}}</strong> n'existe pas dans le Modèle de Données Métier actuellement déployé.

source: A <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatted String variable yyyy-MM-ddTHH:mm:ss(Z)
fr_fr: Variable de type String au format <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> : yyyy-MM-ddTHH:mm:ss(Z)

source: A Bonita REST API URL
fr_fr: Une URL d'API REST de Bonita

source: A Business data variable is reloaded every time the filter value changes.
fr_fr: Une variable Business Data est rechargée chaque fois que la valeur du filtre change.

source: A JSON object
fr_fr: Un objet JSON

source: A TabsContainer is a container that has multiple panes, but shows only one pane at a time.
fr_fr: Un container TabsContainer est un container qui possède plusieurs panneaux, mais ne montre qu'un seul panneau à la fois.

source: A binding is dynamic, so every time data changes, all variables are re-evaluated and the UI is updated. In consequence:
fr_fr: Un binding est dynamique, donc dès qu'une donnée change, toutes les variables sont réévaluées et l'interface utilisateur est mise à jour. En conséquence :

source: A configuration wizard appears: create a Business Data variable by providing information on how to retrieve elements of this Business Object.
fr_fr: Un assistant de configuration s'affiche : créer une variable Business Data en fournissant des informations sur la façon de récupérer des éléments de cet objet métier.

source: A filter area is displayed, depending on your selection, you may have to enter one or several attribute values. You can use a variable to fill its value using interpolation syntax.
fr_fr: Une zone de filtre est affichée, selon votre sélection, vous devrez entrer une ou plusieurs valeurs d'attribut. Vous pouvez utiliser une variable pour remplir sa valeur en utilisant la syntaxe d'interpolation.

source: A local asset name must not contain special characters or spaces. An external asset name must be a standard URL.
fr_fr: Le nom d'un asset local ne doit contenir aucun caractère spécial ni espace. Le nom d'un asset externe doit être une URL standard.

source: A modal container cannot be located in another container. Recommendation: drop all modal containers at the bottom of the whiteboard.
fr_fr: Un container modal ne peut pas être placé dans un autre container. Recommandation : placer tous les containers modaux en bas du whiteboard.

source: A modal container doesn't work when it is embedded in another container.
fr_fr: Un container modal ne peut pas être placé dans un autre container modal.

source: A multiple set chart shows one or more set of data
fr_fr: Un graphique multiple affiche un ou plusieurs jeux de données

source: A property that requires a constant value is presented in the Properties panel as a radio button set, drop-down list, or number selector (for the Width property). Select the required value.
fr_fr: Une propriété qui requiert une valeur constante est présentée dans le panneau de Propriétés comme un ensemble de boutons radio, une liste déroulante ou un sélecteur de chiffres (pour la propriété Largeur). Sélectionnez la valeur souhaitée.

source: A property value is constant, dynamic, a bidirectional bond, or an interpolation.
fr_fr: Une valeur de propriété peut être constante, dynamique, une liaison bidirectionnelle ou une interpolation.

source: A server error occurred.
fr_fr: Une erreur serveur s'est produite.

source: A single entry will be created in the LocalStorage identified by the form URL.
fr_fr: Une seule entrée sera créée dans le LocalStorage identifié par l’URL du formulaire.

source: A variable initialized with a JavaScript expression is executed when the page is loaded. Then, when one of its dependencies changes, its value is updated. Dependencies are created using <code>$data.XXX</code>.
fr_fr: Une variable initialisée avec une expression JavaScript s'exécute au chargement de la page. Puis, lorsqu'une de ses dépendances change, sa valeur est mise à jour. Les dépendances sont créées à l'aide de <code>$data.XXX</code>.

source: A variable initialized with an External API is reloaded every time the URL value changes.
fr_fr: Une variable initialisée avec une API externe est rechargée à chaque fois que la valeur de l'URL change.

source: A variable that contains a JSON array (single set) or JSON array of arrays (multiple sets) where each array is a set. The data can be obtained by a BDM query, API call (default or extension), or JavaScript that retrieves and formats external data
fr_fr: Une variable qui contient un tableau JSON (graphique simple) ou un tableau de tableaux JSON (graphique multiple) où chaque tableau est un jeu de données. Ces données peuvent être obtenues par une requête BDM, un appel de l'API (par défaut ou extension d'API) ou une expression JavaScript qui récupère et met en forme des données externes

source: A {{ ::importReport.overwrittenType }} with the same Id as <strong>{{ ::importReport.name }}</strong> already exists.
fr_fr: Un/e {{ ::importReport.overwrittenType }} avec le même id nommé(e) <strong>{{ ::importReport.name }}</strong> existe déjà.

source: A {{ ::importReport.overwrittenType }} with the same identifier as <strong>{{ ::importReport.name }}</strong> already exists.
fr_fr: Un/e {{ ::importReport.overwrittenType }} avec le même identifiant nommé(e) <strong>{{ ::importReport.name }}</strong> existe déjà.

source: A {{type}} asset named <em>{{ name }}</em> is already added to assets.
fr_fr: Un asset de type {{type}} portant le nom <em>{{ name }}</em> a déjà été ajouté aux assets.

source: API URL
fr_fr: URL d'API

source: API request parameters
fr_fr: Paramètres de requête de l'API

source: Access to $form capabilities for form container
fr_fr: Accès aux fonctionnalités $form pour le form container

source: Active
fr_fr: Activés

source: Add
fr_fr: Ajouter
