Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: The following documentation applies if you need to handle the behavior on success yourself (e.g. if you build your own tasklist or any page with an iframe to display forms).
fr_fr: La documentation suivante s’applique si vous avez besoin gérer vous-même le comportement en cas de succès (par exemple si vous construisez votre propre liste de tâches, ou toute page contenant un iframe pour afficher des formulaires).

source: The hex codes for the sector colors for single set charts, or for the set colors for multiple set charts. If not specified, default colors are used
fr_fr: Les codes hexadécimaux des couleurs des secteurs pour les graphiques simples, ou des couleurs des jeux de données pour les graphiques multiples. Si ce champ n'est pas spécifié, des couleurs par défaut sont appliquées

source: The imported {{ ::importReport.type }} also contains new elements.
fr_fr: Le/la {{ ::importReport.type }} importé(e) contient également de nouveaux éléments.

source: The input/output of the widget (its <em>Value</em>) is an <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> formatted String variable.
fr_fr: L’entrée/sortie du widget (sa <em>Valeur</em>) est une variable String au format <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a>.

source: The legend shows the sector labels for single set charts, and the set labels for multiple set charts
fr_fr: La légende affiche les libellés des secteurs pour les graphiques simples et les libellés de chaque jeu de données pour les graphiques multiples

source: The link text which is static is translated using the <em>ui-translate</em> directive. The link text title held inside the <em>properties.title</em> variable is translated using the <em>uiTranslate</em> filter.
fr_fr: Le texte du lien qui est statique est traduit à l'aide de la directive <em>ui-translate</em>. Le titre du lien contenu dans la variable <em>properties.title</em> est traduit en utilisant le filtre <em>uiTranslate</em>.

source: The list contains page assets, the assets of the widgets used in this page and assets used by base framework.
fr_fr: La liste contient les assets de page, les assets des widgets utilisés dans la page et les assets qui viennent du framework Bonita.

source: The modal size can be selected in the container <em>Size</em> properties. Options available are small, medium or large, which will control the width of the modal.
fr_fr: Vous pouvez choisir la largeur de la fenêtre modale dans la propriété <em>Taille</em> du container. Les options disponibles sont petite, moyenne ou grande.

source: The modal style can be improved by using the <em>modal-body</em> specific class into the <em>CSS Classes</em> property field.
fr_fr: Vous pouvez modifier le style de la pop-in générée en utilisant la classe spécifique <em>modal-body</em> dans la propriété <em>Classes CSS</em>.

source: The name of the key to use as label. Can be empty
fr_fr: Le nom de la clé à utiliser comme label. Peut être vide

source: The name of the key to use as value. Leave it empty for whole object
fr_fr: Le nom de la clé à utiliser comme valeur. Laisser vide pour un object

source: The page has not been imported.
fr_fr: La page n'a pas été importée.

source: The portal and tasklist will redirect to the process list (<em>Start process</em> action) or refresh the task list (<em>Submit task</em> action).
fr_fr: Bonita Portal et la liste de tâches seront redirigés vers la liste des processus (pour l'action <em>Démarrer un processus</em>) ou rafraîchiront la liste de tâches (pour l'action <em>Soumettre une tâche</em>).

source: The property <em>Value to add</em> can either be a JavaScript Object or a String depending on the format expected for the collection you are building.
fr_fr: La propriété <em>Valeur à ajouter</em> peut être un objet JavaScript ou un String selon le format prévu pour la collection que vous créez.

source: The same "Tag" button displays a summary of all REST API calls made by the current artifact to the Bonita REST API."
fr_fr: Le même bouton « Etiquette» affiche un récapitulatif de tous les appels à l’API REST de Bonita faits par l'artefact

source: The scale labels for the x-axis for line and bar charts, ray labels for a radar chart, sector labels for single set charts
fr_fr: Les libellés de l'axe des abscisses pour les graphiques de type courbes et colonnes, des rayons pour un graphique de type radar et des secteurs pour les graphiques simples

source: The sort is backend when datasource is Bonita API. It is frontend, otherwise.
fr_fr: Le tri est réalisé sur le serveur lorsque la Source de données est l'API Bonita. Il est réalisé en front-end sinon.

source: The tab's properties allows you to customize default display and behaviour of tabs based on data and/or JS expressions.
fr_fr: Les propriétés d'onglet permettent de personnaliser l'affichage par défaut et le comportement des onglets en fonction de données et/ou d'expressions JavaScript.

source: The tooltip will be display as such, close to the property label.
fr_fr: L'info-bulle sera affiché comme tel, à proximité du libellé de la propriété.

source: The values of all properties are also used as translation keys. As a result, if you choose not to keep the default values, update the asset <em>localization.json</em> accordingly.
fr_fr: Les valeurs de toutes les propriétés sont également utilisées comme clés de traduction. Par conséquent, si vous choisissez de ne pas conserver les valeurs par défaut, mettez à jour l'asset <em>localization.json</em> en conséquence.

source: The whiteboard is organized in <b>rows</b> that you can move up and down, or delete.
fr_fr: Le whiteboard est organisé en <b>lignes</b> que vous pouvez déplacer vers le haut ou le bas, ou supprimer.

source: The widget HTML template is defined here.
fr_fr: Le template HTML du widget est défini ici.

source: The widget has not been imported.
fr_fr: Le widget n'a pas été importé.

source: The {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> will be overwritten.
fr_fr: Le/la {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> sera écrasé(e).

source: The {{ ::importReport.type }} to import contains elements with the same Id as some existing elements.
fr_fr: Le/la {{ ::importReport.type }} à importer contient des éléments portant le même id que certains éléments existants.

source: The {{ artifact.type }} cannot be deleted because it is used in:
fr_fr: Le (la) {{ artifact.type }} ne peut pas être supprimé(e) car il/elle est utilisée par:

source: The {{ artifactType }} has not been imported.
fr_fr: Le ou l' {{ artifactType }} n'a pas été importé(e).

source: Then, provide a comma-separated list for the columns keys indicating the attribute to display in each column.
fr_fr: Ensuite, fournir une liste séparée par des virgules pour les clés de colonnes indiquant l'attribut à afficher dans chaque colonne.

source: There is a set of <b>default widgets</b> for displaying information to and for gathering information from the end users. You can also create <b>custom widgets</b>.
fr_fr: Le UI Designer propose un ensemble de <b>widgets standards</b> pour afficher des informations et recueillir des informations de la part des utilisateurs. Vous pouvez également créer <b>des widgets personnalisés</b>.

source: This Business Object contains more than {{number}} levels of relations. {{numberAsText}} level and beyond will not appear.
fr_fr: Cet objet Métier contient plus de {{number}} niveaux de relations. Le niveau {{numberAsText}} et au-delà n'apparaîtra pas.

source: This description will be displayed as a tooltip in the palette
fr_fr: Cette description apparaît en info-bulle dans la palette

source: This example uses the JSON example provided if you select the type JSON.<br> It looks for the string ‘Linux’ in the array <code>environment</code> of JSON object <code>supportTicket</code>
fr_fr: Cet exemple utilise l'exemple fourni par le type JSON. <br>Il recherche la chaîne « Linux » dans le tableau <code>environnement</code> de l'objet JSON <code>supportTicket</code>

source: This feature is not available on Internet Explorer 11 nor Microsoft Edge for the moment.
fr_fr: Cette fonctionnalité n'est pas disponible sur Internet Explorer 11 ni Microsoft Edge pour le moment.

source: This filter uses the <a href="http://momentjs.com/">moment.js</a> library to transform the display of a relative time. For example, it transforms '01/01/2011' to '4 years ago'.
fr_fr: Ce filtre utilise la librairie <a href="http://momentjs.com/"> moment.js</a> pour transformer l'affichage d'une heure relative. Par exemple, il transforme '01/01/2011' en 'il y a 4 ans'.

source: This improvement is visible when creating the form from Bonita Studio. It will automatically create new variables in the UI Designer and bind them with the related widgets. For more information, read the <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=693&bos_redirect_product=bos&bos_redirect_major_version=7.9">dedicated documentation.</a>
fr_fr: Cette amélioration est visible lors de la création du formulaire à partir de Bonita Studio. Pour chaque input de contrat, une nouvelle variable est automatiquement créée dans le UI Designer. Elle est de plus liée au widget créé simultanément. Pour plus d'informations, consultez la documentation dédiée <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=693&bos_redirect_product=bos&bos_redirect_major_version=7.9">.</a>

source: This modal is based on ui-bootstrap implementation. It is possible to change the size or the style of the modal.
fr_fr: Ce container modal est basé sur l’implémentation de ui-bootstrap. Il est possible de changer la taille ou le style de la pop-in générée.

source: This name already exists
fr_fr: Ce nom existe déjà

source: This page allows you to view a standard widget, or edit a custom widget.
fr_fr: Cette page vous permet de visualiser un widget standard ou de modifier un widget personnalisé.

source: This page is empty.
fr_fr: Cette page est vide.

source: This panel displays the list of Business Objects that has been defined and deployed using Bonita Studio.
fr_fr: Ce panneau affiche la liste des objets métier qui ont été définis et déployés à l'aide de Bonita Studio.

source: This widget can be used to display/update business variable attributes defined in the Business Data Model (BDM) with the following types:
fr_fr: Ce widget peut être utilisé pour afficher/mettre à jour des attributs de variables métier définies dans la Base de Données Métier (BDM) en tant que :

source: This widget supports the following types for its <em>Value</em> property as input:
fr_fr: Ce widget supporte les types suivants en entrée pour sa propriété <em>Valeur</em> :

source: This will also update the content of the preview window
fr_fr: Cela mettra également à jour le contenu de la fenêtre d’aperçu

source: Time Placeholder
fr_fr: Placeholder de l'heure

source: Title
fr_fr: Titre

source: Title level
fr_fr: Niveau du titre

source: To Display the tab vertically and on the left of the content, you can read this <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">how to learn more about customization</a>
fr_fr: Pour afficher les onglets verticalement et à gauche du contenu, consultez ce <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">how to learn more about customization</a>

source: To add content, drag and drop components from the palette to the whiteboard above.
fr_fr: Pour ajouter du contenu, faites un glisser-déposer des composants de la palette sur le whiteboard.

source: To allow your user to download a document add a link widget with its url property bound to
fr_fr: Pour permettre à vos utilisateurs de télécharger un document, ajoutez un Link widget dont la propriété url est bindée à

source: To avoid them being overwritten, <i>rename</i> them before you import.
fr_fr: Pour éviter de les écraser, <i>renommez</i>- les avant d'importer à nouveau.

source: To close a modal window, put a button inside the modal that you wish to close and select the <em>Close modal</em> action.
fr_fr: Pour fermer une fenêtre modale, placez un bouton à l’intérieur du container modal que vous souhaitez fermer, puis sélectionnez l’action <em> Fermer une fenêtre modale</em> .

source: To control modal containers, the following methods are available in a button:
fr_fr: Pour contrôler un container modal, de nouvelles actions sont disponibles sur le bouton :

source: To control modal containers, the following methods are supported:
fr_fr: Pour contrôler un container modal, de nouvelles actions sont disponibles sur le bouton :

source: To display (and not update) a date and a time retrieved from the BDM API (or another API), you can either use this <em>Date time picker</em> widget with <em>Read-only</em> property set to "yes" or use a <em>Text</em>, <em>Title</em> or a <em>Table</em> widget and format the value using the provided <em>uiDate</em> <a href="javascript:void(0);" open-help="filters" editor-mode="page">filter</a>.
fr_fr: Pour afficher (non pas mettre à jour) une date et une heure récupérées de l’API du BDM (ou autre API), vous pouvez soit utiliser ce widget <em>DATE TIME</em> en activant la propriété <em>Lecture seule</em>, soit utiliser un widget <em>Texte</em>, <em>Titre</em> ou un widget <em>Table</em> en formatant la valeur grâce au <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtre</a> <em>uiDate</em> fourni.

source: To display (and not update) a date retrieved from the BDM API (or another API), you can either use this <em>Date picker</em> widget with <em>Read-only</em> property set to "yes" or use a <em>Text</em>, <em>Title</em> or a <em>Table</em> widget and format the value using the provided <em>uiDate</em> <a href="javascript:void(0);" open-help="filters" editor-mode="page">filter</a>.
fr_fr: Pour afficher (non pas mettre à jour) une date récupérée de l’API du BDM (ou autre API), vous pouvez soit utiliser ce widget <em>DATE</em> en activant la propriété <em>Lecture seule</em>, soit utiliser un widget <em>Texte</em>, <em>Titre</em> ou un widget <em>Table</em> en formatant la valeur grâce au <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtre</a> <em>uiDate</em> fourni.

source: To display the data, define the header properties with a comma-separated list of column headings, bind the content to an array of JavaScript objects.
fr_fr: Pour afficher les données, définissez les propriétés des en-têtes avec une liste d'en-têtes séparés par des virgules, puis liez le contenu à un array d'objets JavaScript.

source: To display the date in a widget property evaluated as an expression, use the <code>dateAgo</code> filter on the <code>updateDate</code> variable as follows: <code>updateDate | dateAgo</code>
fr_fr: Pour afficher la date dans une propriété de widget évaluée comme une expression, utilisez le filtre <code>dateAgo</code> sur la variable <code>updateDate</code> comme suit : <code>updateDate | dateAgo</code>

source: To edit a custom widget, use the <b>Edit</b> menu option close to the widget name in the properties panel.
fr_fr: Pour modifier un widget personnalisé, utilisez l'option de menu <b>Modifier</b> près du nom du widget, dans le panneau de propriétés.

source: To edit this standard widget, save it first as a new custom widget
fr_fr: Pour modifier ce widget standard, enregistrez-le d'abord en tant que nouveau widget personnalisé

source: To embed a pop-in into another pop-in at runtime, drop the first modal container at the bottom, drop the second modal container below the first one, and drop the button that opens the second pop-in within the first modal container.
fr_fr: Pour ouvrir une pop-in à partir d'une autre pop-in à l’exécution, placez le premier container modal en bas de votre contenu de page, puis le deuxième container modal sous le premier. Enfin, placez le bouton qui ouvre la deuxième pop-in dans le premier container modal.

source: To extend a page or form with custom AngularJS services (such as filters, constants, or factories), use the <code>bonitasoft.ui.extensions</code> module.
fr_fr: Pour ajouter des services personnalisés de AngularJS à une page ou à un formulaire (tels que des filtres, des constantes ou des "factories"), utilisez le module <code>bonitasoft.ui.extensions</code>.

source: To get the data from a selected row, bind selected row to a variable.
fr_fr: Pour récupérer les données d'une ligne sélectionnée, liez la ligne sélectionnée à une variable.

source: To improve the management of embedded objects with lazy references, create a variable using the | lazyRef filter for the object to retrieve. For more information, read the <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=692&bos_redirect_product=bos&bos_redirect_major_version=7.9">dedicated documentation.</a>
fr_fr: Pour vous faciliter la gestion des objets imbriqués avec une référence en mode lazy, utilisez le filtre | lazyRef dans la variable correspondant à l'objet à récupérer. Pour plus d'informations, consultez la <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=692&bos_redirect_product=bos&bos_redirect_major_version=7.9">documentation dédiée.</a>

source: To keep things working, if you migrate a page designed in a version older than 7.5.0 and containing custom widgets, <em>ui-bootstrap-tpls-0.13.0.min.js</em> will be added as an asset of your page automatically. You can remove it if you don't need it.
fr_fr: Pour continuer à faire fonctionner les artefacts existants, si vous migrez une page créée dans une version antérieure à 7.5.0 et contenant des widgets personnalisés, <em>ui-bootstrap-NPT-0.13.0.min.js</em> sera automatiquement ajouté comme un asset de la page. Vous pouvez le supprimer s'il est inutile.

source: To load a local image asset in a custom widget, you need to reference it in the template inside a <code>&lt;img&gt;</code> tag with a relative path as follows: <br><code ng-non-bindable>&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>
fr_fr: Pour charger un asset local de type image dans un widget personnalisé, vous devez le référencer dans le template à l'intérieur d'une balise <code>&lt; img &gt;</code>, avec un chemin d'accès relatif comme suit : <br><code ng-non-bindable>&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>

source: To load an image for any custom widget, add image assets at page level. Access it with <code>asset/img/[image name]</code>.
fr_fr: Pour charger une image pour n'importe quel widget personnalisé, ajoutez un asset det ype image au niveau de la page. Vous pouvez y accéder avec <code>asset/img/[image name]</code>.

source: To manage multiple version of dependencies, make sure only one version of an asset is active inside a page.
fr_fr: Pour gérer plusieurs versions de dépendances, assurez-vous que chaque asset n'a qu'une version active au sein d'une page.

source: To open a modal window it is enough to input a modal ID in the properties, to create a button, select <em>Open modal</em> in the Action property, and fill in the right modal ID. The button should be located outside of the modal container.
fr_fr: Pour ouvrir une pop-in : dans les propriétés du container modal, saisissez un ID. Puis créez un bouton. Dans ses propriétés, sélectionnez l'action <em>Ouvrir une fenêtre modale</em> puis saisissez l'ID du container modal à ouvrir. Le bouton doit être situé à l’extérieur du container modal à ouvrir.

source: To pre-fill with a template, bind an HTML formatted variable
fr_fr: Pour pré-remplir avec un template, binder une variable contenant du texte formaté en HTML

source: To retrieve a document instance, create an External API variable with value
fr_fr: Pour récupérer une instance de document, créez une variable de type API externe avec pour valeur

source: To save <strong>{{ ::importReport.overwrittenName }}</strong> with a different identifier, <i>rename</i> it before you import.
fr_fr: Pour enregistrer <strong>{{ ::importReport.overwrittenName }}</strong> avec un identifiant différent, <i>renommez</i>-le avant de l'importer.

source: To save <strong>{{ ::importReport.overwrittenName }}</strong> with a different identifier, open it and use <i>Save as</i> before you import.
fr_fr: Pour enregistrer <strong>{{ ::importReport.overwrittenName }}</strong> avec un identifiant différent, ouvrez-le et utilisez <i>Enregistrer sous</i>, puis importez.

source: To select a date and a time (e.g., to schedule a meeting), use the <em>Date time picker</em> widget instead.
fr_fr: Pour sélectionner une date et une heure (par exemple, pour planifier une réunion), utilisez plutôt le widget <em>DATE TIME</em>.

source: To select only a date (e.g., a date of birth), use the <em>Date picker</em> widget instead.
fr_fr: Pour sélectionner seulement une date (par exemple, une date de naissance), utilisez plutôt le widget <em>DATE</em>.

source: To support multi-languages for end-users, it includes a mechanism to translate the UI artifacts (pages, forms, layouts) created.
fr_fr: Pour supporter les langues variées des utilisateurs finaux, il inclut un mécanisme de traduction des artefacts composant les interfaces utilisateur (pages, formulaires, layouts).

source: To switch widget, use another browser: Google Chrome or Mozilla Firefox.
fr_fr: Pour remplacer ce widget, utilisez un autre navigateur: Google Chrome ou Mozilla Firefox.

source: To use AngularJS standard services, you must declare them in the main function arguments.
fr_fr: Pour utiliser les services AngularJS standards, vous devez les déclarer en tant qu'arguments de la fonction principale.

source: To use a localization asset, replace the default localization.json file with a file of the same format containing all the keys in the page and the translations into the target languages. The localization asset is at page level. The format of the file must be:
fr_fr: Pour utiliser un asset de localisation, remplacer le fichier localization.json avec un fichier du même format contenant toutes les clés de la page et les traductions dans les langues cibles. L'asset de localisation se trouve au niveau de la page. Le format du fichier doit être :

source: To use an image asset in the image widget, set the <code>Source type</code> property to <i>Asset</i>, and then enter the image name in the <code>Asset name</code> input field.
fr_fr: Pour utiliser un asset de type image dans le widget image, définissez la propriété <code>type de la Source</code> à <i>Asset</i> puis entrez le nom de l'image dans le champ <code>nom de l'asset</code>.

source: To use the collection data in the widgets of this container, there are contextual variables that you can bind to the widget properties:
fr_fr: Pour utiliser les données de la collection dans les widgets de ce container, liez les variables contextuelles suivantes aux propriétés des widgets :

source: To use the same asset in several pages, you can add it to a custom widget and use this custom widget in your application pages or forms. When you add a custom widget with assets to a page, those assets are automatically linked to the page.
fr_fr: Pour utiliser le même asset dans plusieurs pages, vous pouvez l'ajouter à un widget personnalisé et utiliser ce widget personnalisé dans vos pages d'application ou vos formulaire. Lorsque vous ajoutez un widget personnalisé contenant des assets, ceux-ci sont automatiquement associés à la page.
