Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: To view the code of a standard widget, use the <b>View</b> menu option close to the widget name in the properties panel. From there, to use the standard widget as a basis for a custom widget, click on <b>Save as</b>, find a name for the custom widget, and make it your own.
fr_fr: Pour voir le code d'un widget standard, utilisez l'option de menu <b>Voir le code ...</b> proche du nom du widget, dans le panneau de propriétés. De là, pour construire un widget personnalisé sur la base de ce code, cliquez sur <b>Enregistrer sous ...</b>, donnez un nom au widget personnalisé, et faites vos modifications.

source: Today
fr_fr: Aujourd’hui

source: Today & Now
fr_fr: Aujourd'hui & Maintenant

source: Today button label
fr_fr: Libellé du bouton Aujourd'hui

source: Toggle properties panel
fr_fr: Afficher / masquer le panneau de propriétés

source: Tooltip
fr_fr: Info-bulle

source: Top frame (_top)
fr_fr: Cadre supérieur (_top)

source: Translate the given text
fr_fr: Traduire le texte indiqué

source: Treat as
fr_fr: Traiter comme

source: Treat value as
fr_fr: Traiter la valeur comme

source: Trigger for an action in a page or form
fr_fr: Déclenchement d'une action dans une page ou un formulaire

source: Two use cases : <ul> <li><code>dateVariable|uiDate</code> applies a default <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">format</a>. For an ISO 8601 string with a time, the default format is <em>'medium'</em>. Otherwise, it is <em>'mediumDate'</em>.</li> <li><code>dateVariable|uiDate:format</code> if you need to be more specific in which format, it can be specified exactly the same way as with <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">angularJS date filter</a>.<br> E.g. <code>dateVariable|uiDate:'short'</code> or <code> dateVariable|uiDate:'dd/MM/yyyy'</code></li> </ul>
fr_fr: Deux cas d’utilisation : <ul><li><code>dateVariable|uiDate</code> applique un <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">format</a> par défaut. Pour une chaîne ISO 8601 avec une heure, le format par défaut est <em>'medium'</em>. Sinon, c’est <em>'mediumDate'</em>.</li> <li><code>dateVariable|uiDate:format</code> si vous avez besoin de préciser davantage le format, il peut être passé de la même manière qu'avec le <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">filtre date d'angularJS</a>.<br>Ex. <code>dateVariable|uiDate :'short'</code> ou <code>dateVariable|uiDate: 'dd/MM/yyyy'</code></li></ul>

source: URL parameter
fr_fr: Paramètre d'URL

source: URL parameter name
fr_fr: Nom du paramètre d'URL

source: URL parameters
fr_fr: Paramètres d'URL

source: URL to call
fr_fr: URL à appeler

source: URL used to perform the HTTP request when this button is clicked.
fr_fr: URL utilisée pour exécuter la requête HTTP au clic sur ce bouton.

source: Unable to access Business Data Model. Restart Bonita Studio and try again.
fr_fr: Impossible d'accéder au Modèle de Données Métier. Redémarrez Bonita Studio et réessayez.

source: Unable to connect to the Business Data Model. Restarting the Studio may solve this issue
fr_fr: Impossible de se connecter au Modèle de Données Métier. Redémarrer le studio peut résoudre ce problème

source: Unique ID of this modal
fr_fr: ID unique de cette fenêtre modale

source: Unique checkbox for an option. The user checks it or not
fr_fr: Case à cocher unique pour une option. L'utilisateur peut la cocher ou pas

source: Unmark as favorite
fr_fr: Retirer des favoris

source: Update asset
fr_fr: Modifier l'asset

source: Upgrade to a newer UI Designer version to import this {{type}}
fr_fr: Mettez à niveau vers une nouvelle version du UI Designer pour importer ce {{type}}

source: Usage
fr_fr: Utilisation

source: Use $collection to act on the collection of a repeated content
fr_fr: Utilisez $collection pour agir sur la collection d'un contenu répété

source: Use $item to remove the current item in a repeated collection
fr_fr: Utilisez $item pour supprimer l'élément courant dans une collection répétée

source: Use <a href="javascript:void(0);" open-help="filters" editor-mode="page">Filters</a> to format the data (e.g. <span ng-non-bindable>columnKey|uiDate</span>)
fr_fr: Utilisez des <a href="javascript:void(0);" open-help="filters" editor-mode="page"> Filtres</a> pour formater les données (ex. <span ng-non-bindable> columnKey|uiDate</span>)

source: Use <b>widgets</b> from the palette on the left to <b>display information to</b> and <b>gather information from</b> the end users.
fr_fr: Utilisez les <b>widgets</b> depuis la palette à gauche pour <b>afficher des informations</b> et <b>recueillir des informations de</b> l'utilisateur final.

source: Use <span ng-non-bindable>{{dataVariable}}</span> to access data, and <a href="javascript:void(0);" open-help="filters" editor-mode="page">filters</a> to format it (e.g. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)
fr_fr: Utilisez <span ng-non-bindable>{{dataVariable}}</span> pour accéder aux données et les <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtres</a> pour formater (par exemple <span ng-non-bindable>{{dateVariable|uiDate}}</span>)

source: Use a Business Object
fr_fr: Utiliser un Objet Métier

source: Use a bidirectional field to specify a read-write binding between the property value and a variable.
fr_fr: Utilisez un une liaison bidirectionnelle pour spécifier une liaison de lecture / écriture entre la valeur de la propriété et une variable.

source: Use a dynamic value field to specify a constant (the default) or an expression. Click the expression icon fx to switch from constant to expression. Click the constant icon X to switch from expression to constant. An expression can include a variable to make the property value dynamic, or can simply be the name of a variable. You can apply a filter to a variable value using a pipe. The binding to the variable is a read. If you want to write to the variable, use a bidirectional bond. Examples:
fr_fr: Utilisez une valeur dynamique pour spécifier une constante (par défaut) ou une expression. Cliquez sur l'icône expression fx pour passer de constante à expression. Cliquez sur l'icône constante X pour repasser d'expression à constante. Une expression peut inclure une variable pour rendre la valeur de la propriété dynamique, ou peut être simplement le nom d'une variable. Vous pouvez appliquer un filtre à une valeur de variable à l'aide d'un "pipe". Le lien avec la variable est de type lecture. Si vous souhaitez écrire dans la variable, utilisez un binding bidirectionnel. Exemples :

source: Use an interpolation field to enter text to display in the widget. The text can include variables that are interpreted using AngularJS interpolation. When the page is displayed, the variables are replaced by the interpolated values. Specify a variable as a simple expression enclosed in double braces, using the same format as for a dynamic value field. Example: I'm sorry, <em ng-non-bindable>{{ user.name | uppercase }}</em>. I'm afraid I can't do that.
fr_fr: Utilisez un champ de type interpolation pour saisir le texte à afficher dans le widget. Le texte peut inclure des variables qui sont interprétées à l'aide de l'interpolation AngularJS. Lorsque la page est affichée, les variables sont remplacées par les valeurs interpolées. Spécifiez la variable comme une simple expression entre doubles accolades, en utilisant le même format que pour une valeur dynamique. Exemple : Je suis désolé.e, <em ng-non-bindable> {{ user.name | uppercase }}</em>. J'ai bien peur de ne pas pouvoir faire cela.

source: Use basic html tags (if allowed), <span ng-non-bindable>{{dataVariable}}</span> to access data, and <a href="javascript:void(0);" open-help="filters" editor-mode="page">filters</a> to format it (e.g. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)
fr_fr: Utilisez des balises html basiques (si autorisé), <span ng-non-bindable>{{dataVariable}}</span> pour accéder aux données et des <a href="javascript:void(0);" open-help="filters" editor-mode="page"> filtres</a> pour les formater (ex. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)

source: Use provided UID widgets as a template for a custom widget
fr_fr: Utilisez les widgets standard du UI Designer comme modèle pour créer un widget personnalisé

source: Use the <em>ui-translate</em> directive in custom widgets for static content to be translated
fr_fr: Pour traduire du contenu statique dans les widgets personnalisés, utilisez la directive <em>ui-translate</em>

source: Use the <em>uiTranslate</em> filter in custom widgets for dynamic content to be translated
fr_fr: Pour traduire du contenu dynamique dans les widgets personnalisés, utilisez le filtre <em>uiTranslate</em>

source: Use the UI Designer to create or edit web artifacts: <b>application pages</b> composing business applications, <b>process forms</b> linked to process instantiation or human tasks execution, as well as <b>application layouts</b>, applied to all pages of a business application.
fr_fr: Utilisez le UI Designer pour créer ou éditer les artefacts web : <b>pages d'application</b> pour composer des applications métier, <b>formulaires de processus</b> liés à l'instantiation du processus ou à l'exécution de tâches humaines, et <b>layouts d'application</b> appliqués à toutes les pages d'une application métier.

source: Use the characters: H (hour), h (hour in AM/PM), m (minutes) and optionally s (seconds), a (AM/PM)
fr_fr: Utilisez les caractères : H (heures), h (heure au format AM/PM), m (minutes) et, éventuellement, s (secondes), et a (AM/PM)

source: Use the characters: M (month), d (day), y (year)
fr_fr: Utilisez les caractères : M (mois), d (jour), y (année)

source: Use the generated user interface
fr_fr: Utiliser l'interface utilisateur générée

source: Use the palette on the left to drag and drop containers and widgets in the whiteboard.
fr_fr: Utiliser la palette sur la gauche pour glisser-déplacer les containers et les widgets dans le whiteboard.

source: Use this container to create a pop-in window which can be opened or closed with a button, and displayed over the page, form, or layout content.
fr_fr: Ce container permet de créer une pop-in ouverte et fermée par un bouton, qui s'affiche au-dessus du contenu d'une page, d'un formulaire ou d'un layout.

source: Use this widget to select a date (e.g., a date of birth).
fr_fr: Utilisez ce widget pour faire sélectionner une date (par exemple, une date de naissance).

source: Use this widget to select a date and a time (e.g., to schedule a meeting).
fr_fr: Utilisez ce widget pour faire sélectionner une date et une heure (par exemple pour planifier une réunion).

source: Use this widget to:
fr_fr: Utilisez ce widget pour :

source: Use your Business data
fr_fr: Utiliser vos données métier

source: Used in the portal list of Resources. Part of the page.properties descriptor in the exported page archive.
fr_fr: Utilisé dans la liste des Ressources du portail. Fait partie du descripteur page.properties dans l'archive de la page exportée.

source: Used in the portal list of Resources. Part of the page.properties descriptor in the exported page archive. If empty, page technical name is used as fallback.
fr_fr: Utilisé dans la liste des ressources du portail. Fait partie du descripteur de page.properties dans l'archive de la page exportée. S'il est vide, le nom technique de la page est utilisé à la place.

source: User id could then be obtained by using {{myData.user_id}}
fr_fr: L'Id de l'utilisateur pourrait ensuite être obtenue grâce à {{myData.user_id}}

source: Using the Vertical Display property, it is possible to display tabs vertically or horizontally.
fr_fr: En utilisant la propriété Affichage vertical, il est possible d'afficher les onglets verticalement ou horizontalement.

source: Validation Errors
fr_fr: Erreurs de validation

source: Validation error on the page. Fix is recommended before export
fr_fr: Erreur de validation sur la page. Corrigez avant d'exporter

source: Validation error. Fix is recommended before export
fr_fr: Erreur de validation. Corrigez avant d'exporter

source: Value
fr_fr: Valeur

source: Value Format
fr_fr: Format de la Valeur

source: Value max length
fr_fr: Longueur maximum de la valeur

source: Value min length
fr_fr: Longueur minimum de la valeur

source: Value must be unique
fr_fr: La valeur doit être unique

source: Value to add
fr_fr: Valeur à ajouter

source: Variable content formatted in HTML
fr_fr: Contenu d'une variable, formaté en HTML

source: Variable for frontend paging and ordering or Bonita REST API URL for backend paging and ordering
fr_fr: "Variable" pour une pagination et un tri en front-end ; "Bonita REST API URL" pour une pagination et un tri en back-end

source: Variable in read-write binding with the property value
fr_fr: Variable en lien bidirectionnel avec la valeur de la propriété

source: Variable name
fr_fr: Nom de la variable

source: Variable names must start with a letter and contain only alphanumeric characters
fr_fr: Les noms de variables doivent commencer par une lettre et ne contenir que des caractères alphanumériques

source: Variable of type array
fr_fr: Variable de type tableau

source: Variables can be bound to input fields to create conditional behavior between widget properties.
fr_fr: Les variables peuvent être bindées aux différents champs pour créer un comportement conditionnel entre propriétés de widgets.

source: Vertical display
fr_fr: Affichage vertical

source: View
fr_fr: Voir le code ...

source: View asset content
fr_fr: Voir le contenu de l'asset

source: View in application <i class="fa fa-info-circle ng-scope" uib-tooltip="{{'In case your application is not available, please log in using a different account' | translate}}" tooltip-placement="bottom" tooltip-append-to-body="true"></i>
fr_fr: Visualiser dans l'application <i class="fa fa-info-circle ng-scope" uib-tooltip="{{'In case your application is not available, please log in using a different account' | translate}}" tooltip-placement="bottom" tooltip-append-to-body="true"></i>

source: View...
fr_fr: Voir le code ...

source: Visualize and explore your Business Data Model (BDM) in your browser. In a few clicks, generate user interfaces from the BDM, using the master/details pattern.
fr_fr: Visualisez et explorez votre Modèle de Données Métier (BDM) dans votre navigateur. En quelques clics, générez des interfaces utilisateur à partir du BDM, en utilisant le modèle master/detail.

source: W3C website
fr_fr: Site web du W3C

source: When 'Content' is a list of objects, specifies the attributes to display in the table columns. These keys must not be a number, or start with a number
fr_fr: Lorsque « Contenu » est une liste d'objets, spécifie les attributs à afficher dans les colonnes de la table. Ces clés ne doivent pas être un nombre, ou commencer par un nombre

source: When possible, properties of the target widget are mapped with similar properties of the source widget. You can edit that and map more.
fr_fr: Lorsque c'est possible, les propriétés du widget source sont appliquées à des propriétés identiques du widget cible. Vous pouvez modifier ce mapping et/ou en ajouter.

source: When sent in the JSON body of a request, it is serialized into an ISO 8601 formatted String variable with the time set to midnight UTC (e.g., 2016-12-31T00:00:00.000Z).
fr_fr: Quand elle est envoyée en JSON dans le corps de la requête, la valeur est convertie en une chaîne de caractères au format ISO 8601 avec l'heure à minuit UTC (par exemple : 2016-12-31T00:00:00.000Z).

source: When the switch is completed, chances are you will still have properties to fill out, in the properties panel.
fr_fr: Une fois le widget remplacé, il vous restera sans doute des propriétés à remplir, dans le panneau de propriétés.

source: When the table is displayed, each time the user updates the filter, the table display is updated accordingly. The filter is applied to the table rows that are currently displayed.
fr_fr: Lorsque le tableau table est affiché, chaque fois que l'utilisateur met le filtre à jour, l'affichage du tableau est mis à jour en conséquence. Le filtre s'applique aux lignes du tableau qui sont visibles.

source: When you delete a row, the following rows move up
fr_fr: Lorsque vous supprimez une ligne, les lignes suivantes se déplacent vers le haut

source: When you generate a form from a contract in the Studio, the form contains a Submit button and some default variables: <code>formInput</code>, <code>formOutput</code>, <code>taskId</code>, and <code>context</code>
fr_fr: Lorsque vous générez un formulaire à partir d'un contrat dans le studio, il contient un bouton "Submit" et 4 variables par défaut : <code>formInput</code>, <code>formOutput</code>, <code>taskId</code> et <code>context</code>

source: Whenever this form is reloaded, either by hitting F5 or browsing away and back again, the entry will be reloaded automatically from LocalStorage.
fr_fr: Chaque fois que ce formulaire est rechargé (appui sur F5 ou retour sur le formulaire après navigation sur une autre page), les valeurs saisies sont automatiquement rechargées à partir du LocalStorage.

source: Where businessDataType = com.company.model.MyData, queryName = name of the BDM query, filter = "myParam=myValue"
fr_fr: Où businessDataType = com.company.model.MyData, queryName = nom de la requête BDM, filter = "myParam=myValue"

source: Where businessVariableName is the name of the business variable defined at pool level.
fr_fr: Où businessVariableName est le nom de la variable métier définie au niveau du pool.

source: Widget description
fr_fr: Description du widget

source: Widget implementation is based on the AngularJS framework.
fr_fr: L'implémentation du widget est basée sur le framework AngularJS.

source: Widget properties defined on the right can be used as variables in a controller with $scope.properties.
fr_fr: Les propriétés du widget, définies à droite, peuvent être utilisées comme variables dans un controller en utilisant $scope.properties.

source: Widget properties defined on the right can be used as variables in a template with properties.newProperty.
fr_fr: Les propriétés du widget, définies à droite, peuvent être utilisées comme variables dans un template en utilisant properties.newProperty.

source: Widgets use the l10n mechanism that loads the translated string during page start up.
fr_fr: Les widgets utilisent le mécanisme de l10n qui charge la chaîne traduite au démarrage de la page.

source: Width
fr_fr: Largeur

source: Will be retrieved from the URL if not set ('app' parameter). You can pass it in the query string of the preview URL for tests.
fr_fr: Sera récupéré à partir de l’URL s'il n’est pas défini (paramètre « app »). Vous pouvez le passer dans l’URL de la fenêtre d'aperçu, pour vos tests.

source: With the new data model section, list your objects and drag&drop them into whiteboard (or create a new variable) to introspect your Business Data Model and simplify the retrieval of data by proposing an advanced wizard to configure it. Use this variable later as any other variable.
fr_fr: Avec la nouvelle section du modèle de données, listez vos objets et glissez-les sur le whiteboard (ou créez une nouvelle variable) pour introspecter votre Modèle de Données Métier et simplifier la récupération des données grâce à un assistant avancé. Utilisez cette variable plus tard comme toute autre variable.

source: With the newer way to store variables and widgets, the diff and merge operations are clearer thanks to a multiline storage.
fr_fr: Avec la nouvelle façon de stocker des variables et des widgets, les opérations de différence et de fusion sont plus claires grâce à un stockage multi-lignes.

source: With this widget, you can display data from an array in tabular presentation.
fr_fr: Avec ce widget, vous pouvez afficher les données d'un array en présentation tabulaire.

source: Within a row, when you delete a widget or a container, the following elements move to the left
fr_fr: A l'intérieur d'une ligne, lorsque vous supprimez un widget ou un container, les éléments qui suivent sont déplacés vers la gauche

source: Yes
fr_fr: Oui

source: Yes. You must bind this variable to a variable in the page, form, layout or fragment using this fragment.
fr_fr: Oui. Vous devez lier cette variable à une variable de la page, du formulaire, du fragment ou du layout qui intègre ce fragment.

source: You can also create custom widgets, from existing widgets by "saving as" or from scratch in the home page.
fr_fr: Vous pouvez également créer des widgets personnalisés, depuis les widgets existants avec "Enregistrer sous ..." ou depuis la page d'accueil.

source: You can apply it to the following variable value types:
fr_fr: Vous pouvez l’appliquer aux types de valeur de variable suivants :

source: You can change the type to be able to use this artifact as a process form or as an application page.
fr_fr: Vous pouvez changer de type pour utiliser cet artefact en tant que formulaire de processus, page d'application ou page de synthèse de cas.

source: You can delete page assets only, view local assets, and edit external assets of a page.
fr_fr: Vous pouvez uniquement supprimer un asset de page, voir les assets locaux et éditer les assets externes de la page.

source: You can explore the data model (with a graphical view) using the graph icon in the header of this panel. It shows the relationships between business objects, and their attributes.
fr_fr: Vous pouvez explorer le modèle de données (avec une vue graphique) en utilisant l'icône graphique dans l'en-tête de ce panneau. Il montre les relations entre les objets métiers et leurs attributs.

source: You can extend our REST API capacities by creating <em>REST API extensions</em> in the Studio <i>Development</i> menu and use them as External API variables in the UI Designer.
fr_fr: Vous pouvez étendre les capacités de notre API REST en créant des <em>extensions de l'API REST</em> dans le menu <i>Développement</i> du Studio et en les utilsant en tant que variables de type External API dans le UI Designer.

source: You can format data with filters when data is used in widget property fields that allow interpolation <i class="fa fa-paragraph"></i> or that are bound to a variable <i class="fa fa-link"></i> .
fr_fr: Le formatage de variables par filtres est possible dans les champs de propriété de widgets qui permettent l’interpolation <i class="fa fa-paragraph"></i> ou ceux qui sont liés à une variable <i class="fa fa-link"></i>.

source: You can group widgets into a container to define the arrangement of widgets in a form or a page. A container can contain other containers.
fr_fr: Vous pouvez regrouper des widgets dans un container pour gérer leur disposition dans un formulaire ou une page. Un container peut contenir d'autres containers.

source: You can only edit the query filters and pagination.
fr_fr: Vous ne pouvez modifier que les filtres de requête et la pagination.

source: You can optimize the UI designer responsiveness behavior for various screen sizes by configuring a different value for the <em>width</em> property for each device type. This uses the Bootstrap CSS grid mechanism.
fr_fr: Vous pouvez optimiser l'adaptation du UI Designer à différentes résolutions d'écran en configurant une valeur de la propriété <em>Largeur</em> différente pour chaque résolution, grâce au mécanisme de grille Bootstrap CSS.
