Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: Date Placeholder
fr_fr: Placeholder pour la date

source: Date and time
fr_fr: Placeholder pour la date et l'heure

source: Date and time can reflect the user time zone (e.g., a meeting day and time) or be absolute, identical everywhere (e.g., opening hours of a store somewhere). This is controlled by the property <em>Handle time zone</em>.
fr_fr: La date et l'heure peuvent intégrer le fuseau horaire de l'utilisateur (jour et heure d'une réunion) ou être absolues, affichées de façon identique partout (horaires d'ouverture d'une boutique). Ce choix est proposé par la propriété <em>Gérer fuseau horaire</em>.

source: Date display
fr_fr: Affichage de la date

source: Date filter
fr_fr: Filtre d'affichage des dates

source: Date formats are localized by default. Localized formats can be edited in <em>localization.json</em> (refer to the <a href="javascript:void(0);" ng-click="tabContainer.activeTab = 'localization'">localization section</a>).
fr_fr: Les formats de date sont localisés par défaut. Les formats localisés peuvent être édités dans l'asset <em>localization.json</em> (reportez-vous à la section <a href="javascript:void(0);" ng-click="tabContainer.activeTab = 'localisation'"> localisation</a>).

source: Date object
fr_fr: Objet Date

source: Date objects
fr_fr: Objets Date

source: Default
fr_fr: Défaut

source: Default label
fr_fr: Libellé par défaut

source: Default name
fr_fr: Nom par défaut

source: Default value
fr_fr: Valeur par défaut

source: Default variables
fr_fr: Variables par défaut

source: Define a condition for widget visibility, <em>userAge &gt; 18</em>
fr_fr: Définissez une condition pour la visibilité du widget : <em>userAge &gt; 18</em>

source: Define how to retrieve Business Object
fr_fr: Définir comment récupérer l'objet métier

source: Define table headers as the value of a variable: <em>myArrayVariable</em>
fr_fr: Définissez les en-têtes de tableau comme valeur d'une variable : <em>maVariableTableau</em>

source: Defines endpoint URL where the file will be uploaded
fr_fr: Définit l'URL cible dans laquelle le fichier sera chargé

source: Delete
fr_fr: Supprimer

source: Delete asset
fr_fr: Supprimer l'asset

source: Delete variable
fr_fr: Supprimer la variable

source: Deletion is not possible
fr_fr: La suppression n'est pas possible

source: Describes the property
fr_fr: Décrit la propriété

source: Description field on widgets
fr_fr: Champ de description sur les widgets

source: Details
fr_fr: Détails

source: Determines target application. It is recommended not to hard code it.
fr_fr: Détermine l’application cible. Il est recommandé de ne pas le saisir en dur.

source: Determines the application theme that will be used by the target page. It is recommended not to hard code it.
fr_fr: Détermine le thème de l’application qui sera utilisé par la page cible. Il est recommandé de ne pas le saisir en dur.

source: Direct link to an external file
fr_fr: Lien direct vers un fichier externe

source: Directly from the whiteboard or from the widget properties section, switch from your current widget to another one and keep the properties already configured.
fr_fr: Directement depuis le whiteboard ou depuis la section Propriétés du widget, remplacez un widget par un autre tout en gardant les propriétés déjà configurées.

source: Disabled
fr_fr: Désactivé

source: Discard changes
fr_fr: Ignorer

source: Display an image from assets or from a URL
fr_fr: Afficher une image à partir d'un asset ou d'une URL

source: Display name
fr_fr: Nom affiché

source: Display name and description are used when the page, form, or layout are imported in the portal's Resources page. To edit them, click on the new "Tag" button.
fr_fr: Le nom affiché et la description sont utilisés à l'importation de la page, du formulaire ou du layout dans la page « Ressources » du portail. Pour les éditer, cliquez sur le nouveau bouton « Etiquette ».

source: Display or hide the shortcut button to current day
fr_fr: Afficher ou masquer le bouton de raccourci pour sélectionner la date du jour

source: Display or hide the shortcut button to set date and time to now
fr_fr: Afficher ou masquer le bouton de raccourci pour régler la date et l’heure au moment présent

source: Display the document in the page or a form
fr_fr: Visualiser le document dans la page ou un formulaire

source: Display type
fr_fr: Type d'affichage

source: Displayed key
fr_fr: Clé affichée

source: Do not show me this dialog again
fr_fr: Ne plus afficher ce dialogue

source: Do you still want to import this {{ ::importReport.type }} now ?
fr_fr: Voulez-vous toujours importer ce/tte {{ ::importReport.type }} ?

source: Doughnut
fr_fr: Anneau

source: Download asset
fr_fr: Télécharger l'asset

source: Drag and drop a Business Object in the whiteboard or create a new variable of type Business Data.
fr_fr: Glissez et déposez un Objet Métier dans le whiteboard ou créez une nouvelle variable de type Métier.

source: Drag and drop widgets or containers in rows
fr_fr: Glisser et déposer des widgets ou des containers dans les lignes

source: Dropdown list of available values. The user selects one value
fr_fr: Liste déroulante de valeurs disponibles. L'utilisateur sélectionne une valeur

source: Dynamic
fr_fr: Dynamique

source: Dynamic value
fr_fr: Valeur dynamique

source: E.g. Given a variable <em>employee</em> of type External API that fetch the task context <code>../{{context.employee_ref.link}}</code>. To retrive all the addresses of <em>employee</em> that are lazy in the BDM, you can create another variable <em>employee_addresses</em> of type External API with an url parameter like <code>employee | lazyRef : 'addresses'</code>
fr_fr: Par exemple, étant donnée une variable <em>employé</em> de type API externe qui récupére le contexte de tâche <code>../{{context.employee_ref.link}}</code>. Pour récupérer toutes les adresses de <em>employé</em> qui sont liées en lazy dans le BDM, créez une autre variable <em>employee_addresses</em> de type API externe avec un paramètre d'URL tel que <code>employee | lazyRef : 'addresses'</code>

source: Each artifact contains a <em>localization.json</em> asset, with keys and translations for all strings and all supported languages (by default french and spanish). Each language has its section and is identified by the ISO 639 language attribute (for example, fr-FR, es-ES). To add new languages, keys and/or translations, export the default <em>localization.json</em>, edit it, and upload it with the same file name. For more information on installing new languages, go to the documentation web site (keywords:
fr_fr: Chaque artefact contient un asset <em>localization.json</em>, contenant les clés et les traductions pour toutes les chaînes de caractères des langues supportées (par défaut, français et espagnol). Chaque langue a sa propre section et est identifiée par l’attribut de langue ISO 639 (par exemple, fr-FR, es-ES). Pour ajouter de nouvelles langues, clés et/ou traductions, exportez le fichier <em>localization.json</em>, éditez-le et importez-le avec le même nom de fichier. Pour plus d’informations sur l’installation de nouvelles langues, visitez le site de documentation Bonita BPM (Mots-clés :

source: Each element of this property has to match an element of the Columns key property to figure out which table column can be sorted upon.
fr_fr: Chaque élément de cette propriété doit correspondre à un élément de la propriété Clé des colonnes pour définir quelles colonnes du tableau peuvent être triées.

source: Each type or container has specific behaviors
fr_fr: Chaque type de container a des comportements spécifiques

source: Easily create forms to edit business variables or documents, or display business variables in read-only
fr_fr: Créez facilement des formulaires pour éditer des variables métier ou des documents, ou encore afficher des variables métier en lecture seule

source: Edit
fr_fr: Modifier

source: Edit asset
fr_fr: Modifier l'asset

source: Edit property
fr_fr: Modifier la propriété

source: Edit the display name and display description of a page, form, or layout from the Editor
fr_fr: Modifier le nom d’affichage et la description d’une page, d'un formulaire ou d'un layout dans l'éditeur

source: Edit variable
fr_fr: Modifier la variable

source: Edit...
fr_fr: Modifier ...

source: Editor organization
fr_fr: Organisation de l'Editeur de page

source: Either select the widget to switch and click on <i class="fa fa-exchange"></i>.
fr_fr: Sélectionnez le widget à remplacer et cliquez sur <i class="fa fa-exchange"></i>.

source: Enhancements on table and data table
fr_fr: Améliorations des tables et des tables de données

source: Enter ' + vm.mode + ' name
fr_fr: Entrer le nom de ' + vm.mode + '

source: Enter a date (mm/dd/yyyy)
fr_fr: Saisissez une date (jj/mm/aaaa)

source: Enter a time (h:mm:ss a)
fr_fr: Entrez une heure (hh:mm:ss)

source: Error at line <code>{{ infos.location.line }}</code>, column <code>{{ infos.location.column }}</code>
fr_fr: Erreur à la ligne <code>{{ infos.location.line }}</code>, colonne <code>{{ infos.location.column }}</code>

source: Error during migration of . Check migration details <i class="fa fa-wrench status"></i> for more details.
fr_fr: Erreur lors de la migration de . Vérifiez les détails de la migration <i class="fa fa-wrench status"></i> pour plus de détails.

source: Error on upload holder
fr_fr: Contenu de l'erreur d'upload

source: Example of a tab title displaying a badge:
fr_fr: Exemple de titre d'un onglet affichant un badge :

source: Example of border table:
fr_fr: Exemple d'un tableau avec bordures :

source: Example: relative time filter
fr_fr: Exemple : filtre "temps relatif"

source: Expand Preview in new window
fr_fr: Agrandir l'aperçu dans une nouvelle fenêtre

source: Expendable text input field with HTML formatting, including style, image, links... This widget is based on textAngular.
fr_fr: Champ de saisie textuelle redimensionnable avec options de mise en forme HTML, dont style, image, liens... Ce widget est basé sur textAngular.

source: Explore Data Model in new window
fr_fr: Explorer le Modèle de Données dans une nouvelle fenêtre

source: Export
fr_fr: Exporter

source: Export {{ctrl.page.name}}
fr_fr: Exporter {{ctrl.page.name}}

source: Exported formats
fr_fr: Formats exportés

source: Expose fragment data to page?
fr_fr: Exposer cette variable de fragment au niveau de la page?

source: Exposed
fr_fr: Exposée

source: Extend Bonita standard widgets to fulfill the specific needs of your project, using the menu option <b>View</b> in the Properties panel of every standard widget. From there, save as your custom widget and implement the extension you need.
fr_fr: Personnalisez nos widgets standard Bonita pour répondre aux besoins spécifiques de votre projet, en utilisant l'option <b>Voir le code</b> dans le panneau Propriétés de chaque widget standard. De là, enregistrez en tant que widget personnalisé et implémentez la variation du widget dont vous avez besoin.

source: External
fr_fr: Externe

source: External API
fr_fr: API externe

source: External API (variable) or URL
fr_fr: External API (variable) ou URL

source: Extra Small devices (width < 768px)
fr_fr: Smartphones (largeur < 768 px)

source: Extra angular modules needed by this custom widget (comma separated)
fr_fr: Modules AngularJS nécessaires pour ce widget personnalisé (séparés par des virgules)

source: Failed response value
fr_fr: Valeur de réponse en cas d'échec

source: Favorites
fr_fr: Favoris

source: Field where the user can enter information
fr_fr: Champ où l'utilisateur peut entrer des informations

source: File
fr_fr: Fichier

source: File chooser for uploading a document to a form
fr_fr: Sélecteur de fichier pour télécharger un document vers un formulaire

source: File source
fr_fr: Source du fichier

source: File unavailable
fr_fr: Fichier indisponible

source: FileName
fr_fr: Nom du fichier

source: Filter
fr_fr: filtre

source: Filters
fr_fr: Filtres

source: First
fr_fr: Premier

source: For <em>Start process</em> and <em>Submit task</em> actions the format of the data must meet the process/task contract specifications.
fr_fr: Pour les actions <em>Démarrer le processus</em> et <em>Soumettre une tâche</em>, le format des données doit satisfaire les spécifications du contract de processus/tâche.

source: For HTTP requests and Start process / Submit task actions, you can store the response of the request in a variable using the properties:
fr_fr: Pour les requêtes HTTP et les actions Démarrer un processsus et Soumettre une tâche, vous pouvez stocker la réponse de la requête dans une variable en utilisant les propriétés :

source: For HTTP requests, the following methods are supported:
fr_fr: Pour les requêtes HTTP, les méthodes suivantes sont supportées :

source: For Instance to let users save the draft of the current form:
fr_fr: Par exemple pour permettre aux utilisateurs d'enregistrer le formulaire en cours d'édition :

source: For an error response, the message value is 'error' and the property <em>dataFromSuccess</em> is replaced by a property <em>dataFromError</em>
fr_fr: Pour une réponse en cas d'erreur, la valeur du message est « erreur » et la propriété <em>dataFromSuccess</em> est remplacée par une propriété <em>dataFromError</em>

source: For an example of JavaScript code to handle the message, you can have a look at the asset <em>layout.js</em> in the default application layout (you can retrieve it in the resources section of Bonita Portal Administrator profile).
fr_fr: Pour un exemple de code JavaScript qui gère le message, ouvrez l’asset <em>layout.js</em> du layout d’application par défaut (à exporter depuis la page Ressources du profil Administrateur de Bonita Portal).

source: For business objects, the UI Designer comes with a <em>lazyRef</em> filter to easily retrieve target url to use in an external API data.
fr_fr: Pour les objets métier, le UI Designer est livré avec un filtre <em>lazyRef</em> qui récupère facilement l'URL cible à utiliser dans une variable de type API externe.

source: For date format specifically, the UI Designer comes with a <em>uiDate</em> filter to easily display dates retrieved from the BDM or any other REST API.
fr_fr: Pour les formats de date particulièrement, le UI Designer embarque un filtre <em>uiDate</em> pour afficher facilement des dates de la BDM ou de toute autre API REST.

source: For example #FF0000, #0066FF
fr_fr: Par exemple, #FF0000, #0066FF

source: For instance, with a custom link widget :
fr_fr: Par exemple, avec un widget personnalisé de type lien :

source: For more information, consult the <a href="https://documentation.bonitasoft.com/?page=live-update#cache_busting">documentation</a>.
fr_fr: Pour plus d’informations, consultez la <a href="https://documentation.bonitasoft.com/?page=live-update#cache_busting"> documentation</a>.

source: For more information, consult the official UI Designer overview documentation.
fr_fr: Pour plus d’informations, consulter la documentation de présentation du UI Designer.

source: For more information, refer to the <a href="javascript:void(0);" open-help="localization" editor-mode="page"><em>localization</em> help section</a>.
fr_fr: Pour plus d'information, reportez-vous à la section d'aide <a href="javascript:void(0);" open-help="localization" editor-mode="page"><em>localisation</em></a>.

source: For more information, see the AngularJS guide on <a href="https://docs.angularjs.org/guide/templates">templates</a> and <a href="https://docs.angularjs.org/guide/controller">controllers</a>.
fr_fr: Pour plus d'informations, consultez le guide AngularJS sur les <a href="https://docs.angularjs.org/guide/templates">templates</a> et le <a href="https://docs.angularjs.org/guide/controller">controller</a>.

source: For new artifacts, you need to add the asset yourself in the custom widgets or pages that require it.
fr_fr: Pour les nouveaux artefacts, vous devez ajouter l'asset manuellement dans les widgets personnalisés ou les pages qui l'utilisent.

source: For the moment, you cannot implement custom widget containers.
fr_fr: Actuellement, la création de containers personnalisés n'est pas encore possible.

source: Format used to display the date
fr_fr: Format utilisé pour afficher la date

source: Format used to display the time
fr_fr: Format utilisé pour afficher l'heure

source: Formatting toolbar
fr_fr: Barre d'outils de mise en forme

source: Forms
fr_fr: Formulaires

source: Four device types are available:
fr_fr: Quatre résolutions cibles sont proposées :

source: Fragment data '' + name + '' will be bound to page data '' + binding + '', and thus not have it default value '' + data.value + ''
fr_fr: Les données de fragments '' + name + '' seront liées aux données de la page '' + binding + '', et donc ne pas avoir de valeur par défaut '' + données. alu + ''

source: Fragment data '' + name + '' will keep its default value '' + data.value + ''
fr_fr: La donnée de fragment '' + name + '' conservera sa valeur par défaut '' + data.value + ''

source: Fragment name
fr_fr: Nom du fragment

source: Frame
fr_fr: Cadre

source: From the page or form editors, right by the "Save" button, a click on the arrow displays a new option "Convert to...". It has also been added in the "Save as" option to, for example, save a form as a case overview page.
fr_fr: A partir des éditeurs de page ou de formulaire, juste à côté du bouton « Enregistrer », le clic sur la flèche affiche une nouvelle option « Convertir en... ». Elle a également été ajoutée dans l’option « Enregistrer sous » pour, par exemple, enregistrer un formulaire en tant que page de synthèse des cas.

source: Functions exposed in the controller can be used with ctrl.newFunction().
fr_fr: Les fonctions exposées dans le controller peuvent être utilisées avec ctrl.newFunction().

source: General
fr_fr: Général

source: Get a case by its identifier
fr_fr: Obtenir un cas par son identifiant

source: Get a human task by its identifier
fr_fr: Obtenir une tâche humaine par son identifiant

source: Get all business variables defined in a case
fr_fr: Obtenir toutes les variables métier définies dans un cas

source: Get current logged user
fr_fr: Obtenir l'utilisateur courant

source: Get custom information of a user
fr_fr: Obtenir des informations personnalisées sur un utilisateur

source: Get professional details of a user
fr_fr: Obtenir les détails professionnels d'un utilisateur

source: Go full screen
fr_fr: Affichez en plein écran

source: Graphical display of numerical data to ease understanding. This widget is based on angular-chart-0.8.1, which is based on Chart.js. For information see http://jtblin.github.io/angular-chart.js/ and http://www.chartjs.org/docs/. Available chart types to display a single set of data are pie, doughnut, and polar area. For multiple sets of data, available chart types are bar, line, and radar.
fr_fr: Affichage graphique de données numériques. Ce widget est basé sur angular-chart-0.8.1, qui est lui-même basé sur Chart.js. Pour plus d'informations, consultez http://jtblin.github.io/angular-chart.js/ et http://www.chartjs.org/docs/. Les différents types de graphiques disponibles pour afficher un unique jeu de données sont Secteurs, Anneau et Polaire. Pour afficher un ou plusieurs jeux de données, les différents types de graphiques disponibles sont Colonnes, Courbes et Radar.

source: Group of widgets used to define the arrangement of the page elements. Its content can be repeated over an array
fr_fr: Groupe de widgets permettant de définir la disposition des éléments dans la page. Son contenu peut être répété en utilisant une variable de type tableau

source: Group of widgets used to define the arrangement of the page elements. Its content is display like in modal.
fr_fr: Groupe de widgets permettant de définir la disposition des éléments dans la page. Son contenu est affiché sous forme de pop-in.

source: Group of widgets, inside a Tabs container
fr_fr: Groupe de widgets, dans un container d'onglets

source: HTTP request
fr_fr: Requête HTTP

source: HTTP status code
fr_fr: Code de statut HTTP

source: Handle time zone
fr_fr: Gérer les fuseaux horaires

source: Headers
fr_fr: En-têtes

source: Help
fr_fr: Aide

source: Help data model
fr_fr: Utiliser facilement le modèle de données

source: Here is the format of the message posted to the parent frame in JSON (in the parent frame you will need to call <code>JSON.parse</code> as it is stringified before being sent):
fr_fr: Voici le format du message JSON envoyé au cadre parent (dans le cadre parent, vous devrez appeler <code>JSON.parse</code> comme le message est transformé en chaîne de caractères avant d’être envoyé) :

source: Hidden
fr_fr: Caché

source: Holds the HTTP status code of the response
fr_fr: Contient le code de statut de la réponse HTTP

source: Holds the response content from the upload error endpoint. That value can be used to guidance purpose
fr_fr: Contient le contenu de la réponse du d'erreur su service d'upload. Cette valeur peut être utilisée pour guider l'utilisateur.

source: Holds the response from the upload endpoint. That value can be used to fulfill a contract
fr_fr: Contient la réponse de l'URL cible après chargement. Cette valeur peut être utilisée pour remplir un contrat

source: Holds the response when the request has failed
fr_fr: Recueille la réponse lorsque la requête a échoué

source: Holds the response when the request is successful
fr_fr: Recueille la réponse lorsque la requête a réussi

source: Home page
fr_fr: Page d'accueil

source: How to customize Zebra-striping
fr_fr: Personnaliser les rayures

source: How to customize border
fr_fr: Personnaliser les bordures

source: However, <b>the output of the widget is always a Javascript Date object</b>. So it will change the type of the variable bound to the widget <em>Value</em> to a Date object when the user selects a date. This is required in order to ensure backward compatibility for pages designed with older UI Designer versions.
fr_fr: Toutefois, <b>la sortie du widget est toujours un objet Javascript Date</b>. Donc la variable liée à la <em>valeur</em> de la widget deviendra un objet Date lorsque l’utilisateur sélectionnera une date. Ce comportement permet d'assurer la rétrocompatibilité des pages crées avec d'anciennes versions du UI Designer.

source: However, such a redirection of the current window (frame) won't be performed in Bonita portal nor in an application iframe with id <em>bonitaframe</em> (as in the default application layout). This is due to the fact that Bonita Portal and the default application layout handle the successful response by themselves.
fr_fr: Cependant, telle une redirection de la fenêtre active (frame) ne sera pas effectuée dans Bonita Portal ni dans un iframe d'application avec l'id <em>bonitaframe</em> (comme dans le layout d’application par défaut). Cela est dû au fait que Bonita Portal et le layout d'application par défaut gèrent la réponse en cas de succès par eux-mêmes.

source: Human task form
fr_fr: Formulaire de tâche humaine

source: Id must be unique, so the {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> will be overwritten.
fr_fr: L'Id doit être unique, donc le/la {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> sera écrasé(e).

source: Id must be unique, so those elements will be overwritten.
fr_fr: L'Id doit être unique, donc ces éléments seront écrasés.

source: Identifier
fr_fr: Identifiant
