Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: Add CSS assets at page level and use them to edit the CSS classes property of any widget. (UI Designer integrates default Bootstrap style)
fr_fr: Ajoutez des assets de type CSS au niveau de la page et utilisez-les dans les propriétés Classes CSS des widgets. (Le UI Designer intègre le style Bootstrap par défaut)

source: Add JavaScript assets for custom scripts. They will be loaded and made available at page level. You can use them in variables of type JavaScript expression. In the value field of the variable, simply call the function and pass the required parameters.
fr_fr: Ajoutez des assets JavaScript pour intégrer des scripts personnalisés. Ils seront chargés et utilisables au niveau de la page. Vous pouvez les utiliser dans des variables de type expression JavaScript. Dans le champ valeur de la variable, appelez simplement la fonction avec les paramètres requis.

source: Add a modal ID, as the button will need to open the right modal container. This ID must be unique within a given page, form, or layout.
fr_fr: Ajoutez un ID de container modal, pour permettre au bouton de savoir quel container ouvrir. Cet ID doit être unique au sein d'une page, d'un formulaire ou d'un layout.

source: Add a new asset
fr_fr: Ajouter un nouvel asset

source: Add a new tab
fr_fr: Ajouter un nouvel onglet

source: Add a widget to the page where the user will specify the filter. This can be an Input widget for free-form text, or a Select widget to choose from a preset list.
fr_fr: Ajouter un widget à la page dans laquelle l'utilisateur spécifiera le filtre. Cela peut être un widget de saisie (Input) pour un texte libre, ou un widget Select, pour choisir dans une liste prédéfinie.

source: Add borders all around the table and between all the columns.
fr_fr: Ajouter des bordures autour de la table et entre toutes les colonnes.

source: Add documentation to your pages by providing information on a widget (e.g. how to use it), thanks to the new Description field. Use this information to generate documentation.
fr_fr: Ajoutez de la documentation à vos pages en fournissant des informations sur un widget (par ex. comment l'utiliser), grâce au nouveau champ de description. Utilisez ces informations pour générer de la documentation.

source: Add images, CSS or JavaScript resources to your pages in the Assets panel at the bottom.
fr_fr: Ajoutez des assets de type images, CSS ou JavaScript dans vos pages ou formulaires à partir du panneau Assets en bas.

source: Add the following class in style.css asset.
fr_fr: Ajoutez la classe suivante dans l'asset style.css.

source: Add to collection
fr_fr: Ajouter à la collection

source: Add/Remove an Object to/from a collection
fr_fr: Ajouter/supprimer un Objet à/d'une collection

source: Added artifacts
fr_fr: Artefacts ajoutés

source: Additional request parameters added to the query string
fr_fr: Paramètres de requête supplémentaires ajoutés à la requête

source: Advanced options
fr_fr: Options avancées

source: Alignment
fr_fr: Alignement

source: Alignment toolbar
fr_fr: Barre d'outils d'alignement

source: All <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter" target="_blank">angularJS filters</a> are available. Usage requires the use of <code>|</code> ("pipe"). E.g. <code>myVariable|lowercase</code>.
fr_fr: Tous les <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter" target="_blank"> filtres angularJS</a> sont disponibles. Pour les utiliser, tapez <code>|</code> (« pipe »). Par exemple, <code>myVariable | minuscules</code>.

source: All process data of a case: Search for a list of case variables
fr_fr: Toutes les données de processus d'un cas : rechercher une liste des variables d'un cas

source: Alternate text
fr_fr: Texte alternatif

source: Alternating gray and transparent backgrounds
fr_fr: Alternance de fonds gris et transparent

source: Alternatively, you can set the Data source to Variable and use a variable definition to point to the table content.
fr_fr: Vous pouvez aussi passer la Source de données à Variable et utiliser une définition de variable pour pointer vers le contenu du tableau.

source: An artifact designed with the UI Designer can be exported to be shared with teammates (import in the UI Designer) or used in business applications (import in Bonita Portal).
fr_fr: Un artefact conçu avec le UI Designer peut être exporté pour être partagé entre coéquipiers (importation dans le UI Designer) ou utilisé dans les applications métier (importation dans Bonita Portal).

source: An errors occurs during migration.
fr_fr: Une erreur est survenue lors de la migration.

source: An extended table widget that provides column sorting, filtering, and paging in addition to the standard table widget capabilities.
fr_fr: Un widget de tableau étendu qui propose le tri des colonnes, le filtrage et la pagination en plus des fonctions du widget Table standard.

source: An {{type}} asset named <em>{{ name }}</em> is already added to assets.
fr_fr: Un asset de type {{type}} portant le nom <em>{{ name }}</em> a déjà été ajouté aux assets.

source: Another possibility would be adding different containers inside the modal and specify any of the following classes:
fr_fr: Vous pouvez aussi ajouter différents containers simples à l’intérieur de la fenêtre modale et spécifier les classes suivantes :

source: Any accessible CSS classes. By default UI Designer comes with Bootstrap http://getbootstrap.com/css/#helper-classes
fr_fr: Toute classe CSS accessible. Par défaut, le UI Designer embarque Bootstrap http://getbootstrap.com/css/#helper-classes

source: Any boolean variable: <i>myData</i> or <i>myData.attribute</i>
fr_fr: Une variable Booléene : <i>myData</i> ou <i>myData.attribute</i>

source: Any button can close a modal container that contains it when a success happens after any button action.
fr_fr: N'importe quel bouton peut fermer le container modal dans lequel il est placé, si l'action qu'il déclenche est à succès.

source: Any variable: <i>myData</i> or <i>myData.attribute</i>
fr_fr: Une variable : <i>myData</i> ou <i>myData.attribute</i>

source: Any variable: myData or myData.attribute.
fr_fr: Variable : myData ou myData.attribute.

source: Application URL token
fr_fr: Token URL de l'application

source: Application layout
fr_fr: Layout d'application

source: Application page
fr_fr: Page d'application

source: Apply a filter to the value of a variable: <em>selectedUser | json</em>
fr_fr: Appliquer un filtre à la valeur d'une variable : <em>selectedUser | json</em>

source: Are you sure you want to delete <b>{{ctrl.artifact}}</b> {{ctrl.type}} ?
fr_fr: Etes-vous sûr(e) de vouloir supprimer <b>{{ctrl.artifact}}</b> {{ctrl.type}}?

source: Are you sure you want to delete the {{ artifact.type }} <b>{{ artifact.name }}</b>?
fr_fr: Etes-vous sûr(e) de vouloir supprimer {{ artifact.type }} <b>{{ artifact.name }}</b>?

source: Array used to populate the table. Can be a list of objects. Use 'Column keys' to refine content
fr_fr: Tableau (ex. une liste d'objets) utilisé pour remplir le tableau. Utilisez "Clés des colonnes" pour préciser le contenu utilie

source: Artifact creation:
fr_fr: Création d'artefact :

source: As used in the URL after the application token
fr_fr: Tel qu’utilisé dans l’URL après le token de l’application

source: Asset Name
fr_fr: Nom de l'asset

source: Asset has not been saved
fr_fr: L'asset n'a pas été sauvegardé

source: Asset list
fr_fr: Liste des assets

source: Asset reordering
fr_fr: Réorganisation des assets

source: Asset use
fr_fr: Utilisation des assets

source: Assets enable you to add web resources to pages and forms. Available asset types are <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Image</strong> and <strong>Localization</strong>. Assets can be <strong>Local</strong> (file stored into the page artifact) or External (URL). The Localization asset is always local.
fr_fr: Les Assets vous permettent d'ajouter des ressources du web aux pages et aux formulaires. Les types d'assets disponibles sont <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Image</strong> et <strong>localisztion</strong>. Un asset peut être <strong>Local</strong> (fichier stocké dans l'objet page) ou <strong>Externe</strong> (URL). L'asset de localisation est toujours local.

source: Assign before Submit
fr_fr: Assigner avant de soumettre

source: At runtime, CSS and JavaScript assets are loaded in the page header. This loading is done as it's represented in this list, CSS first then Javascript. All assets are loaded in order they are listed, widget assets before page assets (in alphabetical order of the widgets name).
fr_fr: A l'exécution, les assets CSS et JavaScript sont chargés dans l'en-tête de la page, dans l'ordre visible sur cette liste : CSS d'abord puis JavaScript. Tous les assets sont chargés dans l'ordre de la liste, les assets de widgets avant les assets de page (dans l'ordre alphabétique du nom des widgets).

source: At runtime, assets of a custom widget are loaded in the order defined.
fr_fr: A l'exécution, les assets d'un widget personnalisé sont chargés dans l'ordre établi.

source: Automatically assign the Task to the current user before the execution
fr_fr: Assigner automatiquement la tâche à l'utilisateur actuel avant l'exécution

source: Available in the palette, it opens over the content of a page/form/layout. To manage such containers, the Button widget gains two actions: "Open modal" and "Close modal".
fr_fr: Disponible dans la palette, il s'ouvre au-dessus d'une page/formulaire/layout. Pour gérer ce type de containers, le widget Button possède deux nouvelles actions : "Ouvrir une fenêtre modale" et "Fermer une fenêtre modale".

source: Available values
fr_fr: Valeurs disponibles

source: Available values: <i>bold, italics, underline, strikeThrough, pre, quote</i>
fr_fr: Valeurs disponibles : <i>gras, italique, souligné, strikeThrough, pre, guillemet</i>

source: Available values: <i>h1, h2, h3, h4, h5, h6, p, ul, ol</i>
fr_fr: Valeurs disponibles : <i>h1, h2, h3, h4, h5, h6, p, ul, ol</i>

source: Available values: <i>html, insertImage, insertLink, insertVideo, wordcount, charcount, undo, redo, clear</i>
fr_fr: Valeurs disponibles : <i>html, insertImage, insertLink, insertVideo, wordcount, charcount, undo, redo, clear</i>

source: Available values: <i>justifyLeft, justifyCenter, justifyRight, indent, outdent</i>
fr_fr: Valeurs disponibles : <i>justifyLeft, justifyCenter, justifyRight, indent, outdent</i>

source: Available variables types are string and JSON (static), and External API, Business data, JavaScript expression, and URL parameter (dynamic).
fr_fr: Les types de variables disponibles sont les chaînes de caractères et JSON (statique), et les API externes, les données métier, l'expression JavaScript et le paramètre URL (dynamique).

source: BDM APIs are not yet sortable. For other APIs, test in the preview or refer to the BonitaBPM documentation 'REST API' pages
fr_fr: Les API BDM ne sont pas encore triables. Pour les autres API, faites un test avec l'aperçu ou consultez la documentation (mots-clés : «REST API»)

source: Back
fr_fr: Précédent

source: Back to default size
fr_fr: Revenir à la taille par défaut

source: Bar
fr_fr: Colonnes

source: Base framework
fr_fr: Framework Bonita

source: Because of this change, if you receive a fragment, rename it and then share it back, it will be considered as a new file by the other Bonita Studios or UI Designers.
fr_fr: De ce fait, si vous recevez un fragment, le renommez et le repartagez, il sera considéré comme un nouveau fichier par les autres Bonita Studios ou UI Designers.

source: Bidirectional bond
fr_fr: Binding bidirectionnel

source: Bind the <em>formInput</em> variable of your form.
fr_fr: Lier la variable <em>formInput</em> de votre formulaire.

source: Bind the filter variable to the Data table widget Filter property.
fr_fr: Lier la variable de filtre à la propriété Filtre du widget Data Table.

source: Bind the filter variable to the widget.
fr_fr: Lier la variable de filtre au widget.

source: Bind to a Variable to filter the table 'Content'
fr_fr: Binder à une variable pour filtrer le tableau « Contenu »

source: Bindable fragment data
fr_fr: Donnée de fragment à binder

source: Bonita REST API calls
fr_fr: Appels vers la REST API Bonita

source: Bordered
fr_fr: Avec bordure

source: Bound data
fr_fr: Donnée bindée

source: Business Data Management enhancements
fr_fr: Améliorations de la gestion des données métier

source: Business data
fr_fr: Données métier

source: By convention, in <em>localization.json</em>, the language used for translation keys is English. This means that in the editor whiteboard, any widget default text is currently in English. However, to ease maintenance and update of the UI artifacts in English, you can change the keys into code names and add an <b>en-US</b> section in the <em>localization.json</em> asset file.
fr_fr: Par convention, dans le fichier <em>localization.json</em>, la langue utilisée pour les clés de traduction est l'anglais. Cela veut dire que sur le tableau blanc dans l'éditeur des artéfacts, le texte des widgets est en anglais par défaut. Cependant, pour faciliter la maintenance et la mise à jour des artéfacts en anglais, vous pouvez remplacer ces clés par des noms de code et ajouter une section <b>en-US</b> dans le fichier <em>localization.json</em>.

source: By default, only page assets are displayed. To display others scopes assets, we should check Widget or Base Framework checkbox.
fr_fr: Par défaut, seuls les assets de la page sont affichés. Pour afficher les assets d'autres périmètres, cochez la case "Widgets" ou "Framework Bonita".

source: CSS classes
fr_fr: Classes CSS

source: Calendar for selecting a date (only)
fr_fr: Calendrier pour la sélection d'une date (uniquement)

source: Calendar for selecting a date and time
fr_fr: Calendrier pour la sélection d'une date et d'une heure

source: Call a business data (custom) query
fr_fr: Appel d'une requête BDM (spécifique)

source: Can be a list of objects. Use 'Displayed key' to refine options and 'Returned key' to refine selections
fr_fr: Peut être une liste d'objets. Utilisez « Clé affichée » pour préciser les options et « Clé retournée » pour préciser les sélections

source: Can be a list of objects. Use 'Displayed key' to refine suggestions and 'Returned key' to refine selection
fr_fr: Peut être une liste d'objets. Utilisez « Clé affichée » pour préciser la liste des suggestions et « Clé retournée » pour préciser la sélection

source: Can be translated using the asset localization.json
fr_fr: Peut être traduit à l'aide de l'asset localization.json

source: Can be used to define the expected input format
fr_fr: Peut être utilisé pour expliquer le format d'entrée attendu

source: Can be used to fulfill a contract
fr_fr: Peut être utilisé pour remplir un contrat

source: Cancel
fr_fr: Annuler

source: Caption
fr_fr: Légende

source: Case Id
fr_fr: Cas

source: Case identifier could then be retrieved by {{myData.rootCaseId}}
fr_fr: L'Id du cas pourrait donc être récupérée grâce à {{myData.rootCaseId}}

source: Case overview
fr_fr: Page de synthèse du cas

source: Change the type of a UI Designer artifact (page/form)
fr_fr: Modifier le type d’un artefact créé avec le UI Designer (page/formulaire)

source: Changes need to be saved to enable the preview
fr_fr: Enregistrez les changements pour activer la prévisualisation

source: Check that the json file structure matches a standard UI Designer export.
fr_fr: Vérifiez que la structure du fichier json correspond bien à un fichier standard exporté depuis le UI Designer.

source: Check that the zip archive contains one of following files {{ infos.modelfiles }}.
fr_fr: Vérifiez que l'archive zip contient bien l'un des fichiers suivants {{ infos.modelfiles }}.

source: Check that the zip archive contains the file {{ infos.modelfile }}.
fr_fr: Vérifiez que l'archive zip contient bien le fichier {{ infos.modelfile }}.

source: Check that the zip file structure matches a standard UI Designer export.
fr_fr: Vérifiez que la structure du fichier json correspond bien à un fichier standard exporté depuis le UI Designer.

source: Check the log files
fr_fr: Consultez les fichiers de log

source: Choices
fr_fr: Choix

source: Choices (comma separated)
fr_fr: Choix (séparés par des virgules)

source: Choose a business object
fr_fr: Choisir un objet métier

source: Choose process document if the file is used by a process
fr_fr: Choisir document de processus si le fichier est utilisé par un processus

source: Choose true if you want display this modal with an animation, false otherwise
fr_fr: Choisissez 'vrai' pour l'afficher avec animation, 'faux' pour la faire apparaître

source: Clear
fr_fr: Vider

source: Clear search
fr_fr: Effacer la recherche

source: Click <em>Add</em> to override.
fr_fr: Cliquez sur <em>Ajouter</em> pour remplacer.

source: Click to bind to a constant
fr_fr: Cliquer pour binder une constante

source: Click to bind to an expression
fr_fr: Cliquer pour binder une expression

source: Click to see migration report
fr_fr: Cliquez pour voir le rapport de migration

source: Close
fr_fr: Fermer

source: Close Modal
fr_fr: Fermer une fenêtre modale

source: Close modal
fr_fr: Fermer une fenêtre modale

source: Close modal on success
fr_fr: Fermer une fenêtre modale en cas de succès

source: Close modal when the action is successful
fr_fr: Fermer une fenêtre modale lorsque l'action a été réalisée avec succès

source: Collection
fr_fr: Collections

source: Colors
fr_fr: Couleurs

source: Column keys
fr_fr: Clés des colonnes

source: Columns key
fr_fr: Clé des colonnes

source: Comma-separated list
fr_fr: Liste séparée par des virgules

source: Comma-separated list or bound an array data
fr_fr: Liste séparée par des virgules ou variable de type tableau de données

source: Comma-separated list or variable
fr_fr: Liste séparée par des virgules ou variable

source: Condensed
fr_fr: Condensée

source: Condensed table with half padding
fr_fr: Table condensée avec demi-remplissage

source: Configure widgets using the <b>properties panel</b> on the right.
fr_fr: Configurez les widgets en utilisant le <b>panneau de propriétés</b> sur la droite.

source: Confirm deletion
fr_fr: Confirmez-vous la suppression ?

source: Constant
fr_fr: Constante

source: Container used for a form. Eases validation
fr_fr: Container utilisé pour un formulaire. Facilite la validation

source: Containers cannot be edited.
fr_fr: Les conteneurs ne peuvent pas être modifiés.

source: Containers cannot be switched.
fr_fr: Impossible de remplacer un container.

source: Content
fr_fr: Contenu

source: Control
fr_fr: Contrôle

source: Controller can be left empty if not needed.
fr_fr: Le controller peut être laissé vide s'il n'est pas nécessaire.

source: Convert to ...
fr_fr: Convertir en ...

source: Convert {{ctrl.page.name}}
fr_fr: Convertir {{ctrl.page.name}}

source: Corrupted zip archive.
fr_fr: L'archive zip est corrompue.

source: Create
fr_fr: Créer

source: Create a JSON variable named <code>updateDate</code> to hold a timestamp as a number
fr_fr: Créez une variable JSON nommée <code>updateDate</code> qui contient un timestamp sous forme de nombre

source: Create a JavaScript file named <code>date-ago-filter.js</code> that updates the <code>bonitasoft.ui.extensions</code> module with the filter:
fr_fr: Créez un fichier JavaScript nommé <code>date-ago-filter.js</code> qui met à jour le module <code>bonitasoft.ui.extensions</code> avec le filtre:

source: Create a filter variable in the variable panel. If you are using an Input widget, this variable has no value.
fr_fr: Créer une variable de filtre dans le panneau de variables. Si vous utilisez un widget de saisie (Input), cette variable n'a pas de valeur.

source: Create a fragment to reuse the same group of widgets with the same behavior in several pages or forms.
fr_fr: Créez un fragment pour réutiliser un groupe de widgets identiques ayant le même comportement dans plusieurs pages ou formulaires.

source: Create a new UI Designer artifact
fr_fr: Créer un nouvel artefact

source: Create a new variable
fr_fr: Créer une nouvelle variable

source: Create a user interface to handle "{{ctrl.businessData.name}}"
fr_fr: Créer une interface utilisateur pour gérer "{{ctrl.businessData.name}}"

source: Create a variable here. Using the variable in a widget property depends on the property value type, described in the page editor general help, in the <i>Properties</i> section.
fr_fr: Créez une variable ici. L'utilisation de la variable dans une propriété de widget dépend du type de propriété, décrit dans l'aide générale de l'éditeur de page, dans la section <i>Propriétés</i>.

source: Create a variable in the bottom panel. Using a variable in a widget property depends on the property value type, described in the next section.
fr_fr: Créez une variable dans le panneau du bas. L'utilisation de la variable dans une propriété de widget dépend du type de propriété, décrit dans la section suivante.

source: Create an <b>application page</b> directly in the UI Designer
fr_fr: Créez une <b>page d'application</b> directement dans le UI Designer

source: Create new artifact
fr_fr: Créer un nouvel artefact

source: Create new property
fr_fr: Créer une nouvelle propriété

source: Create variables in the Variables panel at the bottom, and use them to edit the widget properties.
fr_fr: Créez des variables dans le panneau Variables en bas, puis utilisez-les, seules ou dans des expressions simples, au niveau des propriétés des widgets.

source: Created with an older version of UI Designer. Open it for more details.
fr_fr: Créé avec une ancienne version de UI Designer. Ouvrez-la pour plus de détails.

source: Current frame (_self)
fr_fr: Cadre actuel (_self)

source: Custom URL
fr_fr: URL personnalisée

source: Custom services
fr_fr: Services personnalisés

source: Custom style
fr_fr: Style personnalisé

source: Custom widget
fr_fr: Widget personnalisé

source: Custom widgets
fr_fr: Widgets personnalisés

source: Custom widgets are not clearly visible on the whiteboard but you can see them with the preview.
fr_fr: Les widgets personnalisés n'apparaissent pas clairement sur le whiteboard ; cliquez sur Aperçu pour les visualiser.

source: Customize tab title or add css dynamically, hide or disable tabs according to the conditions are the new capabilities of each tab. Change tab format or build nice side menus thanks to vertical display, read this <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">how to to learn more about customization.</a>
fr_fr: Personnalisez le titre de l'onglet ou ajoutez du css dynamiquement, masquez ou désactivez les onglets selon les conditions, sont les nouvelles capacités de chaque onglet. Changez le format des onglets ou construisez de jolis menus latéraux grâce à l'affichage vertical, lisez ceci <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">comment en savoir plus sur la personnalisation.</a>

source: Customize the default look and feel as follows:
fr_fr: Personnaliser l'affichage comme suit :

source: Data
fr_fr: Données

source: Data Management
fr_fr: Gestion des données

source: Data saved on click. You might bind it to the variable you use to initialize your form, e.g. 'formInput'
fr_fr: Données sauvegardées lors d'un clic. Vous pourriez les associer à une variable que vous utilisez pour initialier votre formulaire, e.g. 'formInput'

source: Data sent on click
fr_fr: Données envoyées au clic

source: Data source
fr_fr: Source de données

source: Date & time display
fr_fr: Affichage des dates et heures
