Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: If a Business Object has been dropped, a user interface is generated for you. You can either keep it as is, modify it, or remove it if it does not fit your needs.
fr_fr: Si un Objet Métier a été déposé, une interface utilisateur est générée pour vous. Vous pouvez le conserver tel quel, le modifier, ou le supprimer s'il ne répond pas à vos besoins.

source: If checked, this popup will not be displayed again unless you clean up your browser cache
fr_fr: Si vous cochez cette case, la pop-up ne s’affichera plus, à moins que vous ne vidiez le cache de votre navigateur

source: If the page is displayed inside an iframe, a JavaScript postMessage will be sent to the <b>parent</b> frame with the status of the response and the properties values of the button widget. Bonita portal, tasklist or the default application layout handle this message differently:
fr_fr: Si la page est affichée à l’intérieur d’un iframe, un postMessage JavaScript sera envoyé au cadre <b>parent</b> avec l’état de la réponse et les valeurs de propriétés du widget button. Bonita Portal, la liste des tâches ou le layout d’application par défaut gèrent ce message différemment :

source: If the standard widget does not meet your needs, you can create a custom widget to match exactly what you want to. To do this, clone the standard widget by saving it with a different name, and modify it. After creation, the custom widget is available in the palette for designing pages, forms, layouts or fragments.
fr_fr: Si le widget standard ne répond pas exactement à vos besoins, vous pouvez créer un widget personnalisé. Après création, un widget personnalisé est mis à disposition dans la palette pour être ajouté à des pages, des formulaires, des layouts our des fragments.

source: If you choose 'no', HTML code will be escaped instead of being interpreted
fr_fr: Si vous choisissez « non », le code HTML sera être échappé au lieu d’être interprété

source: If you choose 'no', HTML code will be escaped instead of being interpreted in row's cells
fr_fr: Si vous choisissez 'non', le code HTML sera échappé au lieu d'être interprété dans les cellules de la ligne

source: If you create your own user interface, bind your Business data variable on widget properties or use your variable in javascript expressions. Be careful, by default each business data variable is an array (even if only one result from query is returned).
fr_fr: Si vous créez votre propre interface utilisateur, liez votre variable de données Métier sur les propriétés du widget ou utilisez votre variable dans les expressions javascript. Attention, par défaut, chaque variable de données métier est un tableau (même si un seul résultat de la requête est retourné).

source: If you need to add links, icons, actions or customize styles, now you are able as you can enable html computing into table cells. New stylings properties are available to differentiate lines (zebra-striping), condensate table contents or even border your cells and table.
fr_fr: Si vous avez besoin d'ajouter des liens, des icônes, des actions ou des styles personnalisés, vous pouvez maintenant activer la propriété interpréter le code html dans les cellules du tableau. De nouvelles propriétés de style sont disponibles pour différencier les lignes (alternance des couleurs), le contenu de la table de condensation ou même la bordure de vos cellules et tableaux.

source: If you specify an expression, the result must be an array of strings
fr_fr: Si vous spécifiez une expression, le résultat doit être un tableau de "strings"

source: Image or Localization assets are not imported in index.html. So we don't need to reorder them.
fr_fr: Les images et le fichier de traduction ne sont pas importés dans le fichier index.html. Nous n'avons donc pas besoin de les réorganiser.

source: Import
fr_fr: Importer

source: Import a UI Designer artifact
fr_fr: Importer un artefact du UI Designer

source: Import error
fr_fr: Erreur d'import

source: Import error: incompatible artifact
fr_fr: Erreur d'importation : artefact incompatible

source: Import the moment.js library as an external asset.
fr_fr: Importez la librairie moment.js en tant qu'asset externe.

source: Import this JavaScript file as a local page asset.
fr_fr: Importez ce fichier JavaScript comme un asset local de page.

source: Import {{ ::importReport.name }}
fr_fr: Importer {{ ::importReport.name }}

source: Import, define or deploy a Business Data Model in Bonita Studio.
fr_fr: Importer, définir ou déployer un Modèle de Données Métier dans Bonita Studio.

source: Improve collaboration on UID artifacts
fr_fr: Améliorer la collaboration sur les artefacts UID

source: In 'CSS Classes' property add the <code>zebra-custom</code> class
fr_fr: Dans la propriété 'Classes CSS', ajoutez la classe <code>zebra-custom</code>

source: In 'CSS Classes' property add the following class <code>zebra-custom</code>
fr_fr: Dans la propriété 'Classes CSS', ajoutez la classe suivante <code>zebra-custom</code>

source: In 'Classes CSS' property add the following value
fr_fr: Dans la propriété 'Classes CSS' ajoutez la valeur suivante

source: In a JavaScript asset, you can specify a dependency on an Angular module. First add the JavaScript asset, and then add the module name in the dedicated section. You can find the the available modules on <a href="http://ngmodules.org/">http://ngmodules.org/</a>.
fr_fr: Sur un asset de type JavaScript, vous pouvez spécifier une dépendance vers un module AngularJS. Tout d'abord ajoutez l'asset JavaScript, puis ajoutez le nom du module dans la section dédiée. Vous pouvez trouver les modules disponibles sur <a href="http://ngmodules.org/"> http://ngmodules.org/</a>.

source: In a form, a page, or a layout, we recommend to drop modal containers at the bottom of the editor content.
fr_fr: Dans un éditeur de formulaire, une page ou un layout, nous vous recommandons de placer les containers modaux tout en bas du contenu.

source: In a process form, if you have defined business variables in your process, use the link to the variable to retrieve using the context variable:
fr_fr: Dans un formulaire de processus, si vous avez défini des variables métier dans votre processus, utilisez le lien vers la variable à récupérer à l'aide de la variable context :

source: In addition to the <em>Successful response value</em> variable, for the <em>POST</em>,<em>PUT</em>,<em>DELETE</em>, <em>Start process</em> and <em>Submit task</em> requests you also have the possibility to define a <em>Target URL on success</em> that will be used to set the current window (frame) location when the request is successful.
fr_fr: En plus de la variable de la <em>valeur de réponse en cas de succès</em>, pour les requêtes <em>POST</em>, <em>PUT</em>, <em>DELETE</em>, <em>Start process</em> et <em>Submit task</em> vous pouvez également définir une <em>URL cible en cas de succès</em> qui sera être utilisée pour définir l’emplacement de la fenêtre actuelle (frame) lorsque la requête est à succès.

source: In case your application is not available, please log in using a different account
fr_fr: Vous cherchez une autre application ? Connectez-vous avec un autre compte utilisateur

source: In folder:
fr_fr: Dans le dossier :

source: In production, if the user is logged into Bonita Portal, UI artifacts are displayed in the Portal language selected by the user or in the browser locale.
fr_fr: En environnement de production, si l'utilisateur est connecté à Bonita Portal, les artefacts des interfaces utilisateur sont affichés dans la langue sélectionnée par l'utilisateur dans le portail ou dans la langue par défaut du portail.

source: In some case, you want override your theme to display <b>one specific table</b>, to do this:
fr_fr: Dans certains cas, vous voudrez remplacer votre thème pour afficher <b>un tableau spécifique</b>, pour faire cela :

source: In some case, you want to override your theme to display <b>one</b> data-table with specific line color, to do this:
fr_fr: Dans certains cas, vous voudrez remplacer votre thème pour afficher <b>un</b> tableau avec une ligne de couleur spécifique. Pour cela :

source: In some cases, other types of variables are created: <ul> <li> When the business variable is edited in the form (as specified in the contract creation wizard), a UI Designer variable is created for each variable (External API). <br>For example, if the contract input has been created from a business variable 'invoice' in the process, a variable <code>invoice</code> is created in the form and its URL is set to <span ng-non-bindable>../{{context.invoice_ref.link}}</span>. <br>If <code>invoice</code> contains lazy relations, additional variables are generated for each lazy relation to resolve (using <em>lazyRef</em> filter). <br>For example, if 'invoice' has a 'customer' relation in lazy, an External API variable <code>invoice_customer</code> is added. Its URL is set to <span ng-non-bindable>{{invoice|lazyRef:'customer'}}</span>.</li> <li>To display an aggregated object, a Select widget is generated to display the <em>available values</em> of the object. The variable (External API) bound to the widget is created. It queries the BDM. <br>For example, when the object Invoice has an aggregated object Customer, a variable <code>customer_query</code> is created with URL: <span ng-non-bindable>../API/bdm/businessData/com.company.model.Customer?q=find&p=0&c=99</span>. By default it uses the <code>find</code> query with a default pagination (only first 100 objects are returned).</li> </ul>
fr_fr: Dans certains cas, d'autres types de variables sont créées : <ul> <li> Quand la variable métier est éditée dans le formulaire (tel que spécifié dans l'assistant de création du contrat), une variable UI Designer est créée (de type External API).<br>Par exemple, si l'input de contrat a été créé à partir d'une variable métier 'facture' dans le processus, une variable <code>facture</code> est créée dans le formulaire, avec pour URL <span ng-non-bindable>../{{context.facture_ref.link}}</span>. <br>Si <code>facture</code> contient des relations lazy, d'autres variables sont créées pour chaque relation en lazy à résoudre (en utilisant le filtre <em>lazyRef</em>). <br>Par exemple, si 'facture' a une relation 'client' de type lazy, une variable External API <code>facture.client</code> est créée, avec pour URL <span ng-non-bindable>{facture|lazyRef:'client'}</span>. </li><li>Pour afficher un objet agrégé, un widget Select est généré. Il affichera les <em>valeurs disponibles</em> de l'objet. La variable (External API) liée au widget est créée pour requêter le BDM. <br>Par exemple, quand l'objet Facture a un objet agrégé Client, une variable <code>client_query</code> est créée avec, comme URL : <span ng-non-bindable>../API/bdm/businessData/com.company.model.Client?q=find&p=0&c=99</span>. Par défaut, elle utilise la requête <code>find</code> avec une pagination par défaut (seules les 100 premiers objets sont retournés).</li></ul>

source: In tab title properties add the following value
fr_fr: Dans la propriété Titre de l'onglet, ajoutez la valeur suivante

source: In the Asset list, you can manually change the order of CSS and Javascript page assets. Reorder this files can be useful to override some css classes or javascript functions.
fr_fr: Dans la liste des assets, vous pouvez manuellement modifier l'ordre des assets CSS et JavaScript de la page. Réordonner ces fichiers peut être utile pour écraser certaines classes CSS ou fonctions JavaScript.

source: In the Studio, a form must be linked to a process or a task, using the contract; a page is linked to an application descriptor.
fr_fr: Dans le studio, un formulaire doit être associé à un processus ou une tâche en utilisant le contrat ; une page est associée à un descripteur d'application ou un processus (synthèse des cas).

source: In the Switch wizard, select or type the widget to switch to, then click <b>Show properties</b>.<br> Whenever possible, properties in the source widgets are mapped with similar properties in the target widget. You can edit that or map more, then click on <b>Switch</b>.
fr_fr: Dans l'assistant, sélectionnez ou saisissez le nom du widget à remplacer, puis cliquez sur <b>Afficher les propriétés</b>.<br> Lorsque c'est possible, les propriétés du widget source sont automatiquement associées à des propriétés similaires du widget cible. Vous pouvez modifier ce mapping, en ajouter, puis cliquer sur <b>Remplacer</b>.

source: In the context of a form container, use $form.$invalid as a Boolean to check form validity in a widget property
fr_fr: Dans le contexte d'un form container, utilisez $form. $invalid dans une propriété de widget comme une valeur booléenne permettant de vérifier la validité du formulaire

source: In the fragment editor, you can set the scope of a variable to <i>specific to this fragment</i> or to <i>exposed to the page</i>.
fr_fr: Dans l'éditeur de fragment, vous pouvez définir la portée d'une variable : <i>spécifique à ce fragment</i> ou <i>exposée à la page</i>.

source: In the preview and at runtime, the displayed text will adapt automatically to the selected language.
fr_fr: Dans l’aperçu et à l’exécution, le texte affiché s’adaptera automatiquement à la langue sélectionnée.

source: In the scope of a page, form, or layout, a variable can be used to handle business data, or can contain structural information that determines how page elements behave.
fr_fr: Dans le cadre d'une page, d'un formulaire ou d'un layout, une variable peut être utilisée pour gérer les données métier ou des variables de processus, ou peut contenir des informations de structure qui déterminent la façon dont se comportent les éléments.

source: In this list, you can use the arrows to reorder assets, view local assets, edit external assets, and delete any.
fr_fr: Dans cette liste, vous pouvez utiliser les flèches pour ré-ordonner les assets, voir les assets locaux, éditer les assets externes et supprimer tout type d'assets.

source: Includes the localized version of the Technical date format property, to guide the user
fr_fr: Inclut la version localisée de la propriété Format technique de date, pour guider l’utilisateur

source: Includes the localized version of the Technical time format property, to guide the user
fr_fr: Inclut la version localisée de la propriété Format technique de l'heure, pour guider l’utilisateur

source: Incorrect zip structure.
fr_fr: La structure du zip est incorrecte.

source: Inline
fr_fr: En ligne

source: Input field with content completion from a given list
fr_fr: Champ de saisie avec suggestion à partir d'une liste donnée

source: Input: <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatted String (yyyy-MM-dd), Date object or Long number <br>Output: Date object (see widget help)
fr_fr: Entrée : Chaîne de caractères au format <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'> ISO 8601</a> (yyyy-MM-dd), Objet Date ou nombre <br>Sortie : Objet Date (voir l'aide du widget)

source: Integration with Bonita platform
fr_fr: Intégration avec la plateforme Bonita

source: Interpret HTML
fr_fr: Interpréter le HTML

source: Invalid URL: it must only contain alphanumeric character or #!:.?+=&%@-/
fr_fr: URL invalide : elle doit contenir uniquement des caractères alphanumériques ou #!:. ? += &%@-/

source: Invalid {{ infos.modelfile }} json file structure
fr_fr: La structure du fichier json {{ infos.modelfile }} est invalide

source: It is possible to deactivate the animation when the modal appears. The main usage of this option would be to create a wizard, where several modal containers are displayed in a sequence.
fr_fr: Vous pouvez désactiver l’animation d'affichage de la fenêtre modale. Ce sera le cas par exemple pour créer un assistant dans lequel plusieurs fenêtres modales se succèdent.

source: It provides references to all business variables and documents in the process instance (case). To retrieve a business variable instance, create an External API variable with value
fr_fr: Elle fournit des références aux documents et variables métiers définis dans l'instance de processus (cas). Pour récupérer la valeur d'une variable métier, créez une variable de type API externe avec pour valeur

source: Item
fr_fr: Elément courant

source: Item to remove
fr_fr: Élément à supprimer

source: JSON descriptor to exchange between UI Designers
fr_fr: Descripteur JSON permettant d'échanger des fichiers entre UI Designers

source: JSON specifications can be found on the
fr_fr: Plus d'informations sur les spécifications JSON sur

source: Javascript expression
fr_fr: Expression JavaScript

source: Know your Business Data Model and retrieve Business Data information is simpler than never
fr_fr: Connaître votre Modèle de Données Métier et récupérer les informations de Données Métier est plus simple que jamais

source: Label
fr_fr: Libellé

source: Label hidden
fr_fr: Libellé masqué

source: Label position
fr_fr: Position du libellé

source: Label width
fr_fr: Largeur du libellé

source: Labels
fr_fr: Libellés

source: Large devices (width ≥ 1200px)
fr_fr: Ecrans de bureau (largeur ≥ 1200 px)

source: Last
fr_fr: Dernier

source: Last Update:
fr_fr: Dernière mise à jour :

source: Lazy reference filter
fr_fr: Filtre de référencement de données en mode "Lazy"

source: Legend hidden
fr_fr: Légende masquée

source: Level 1
fr_fr: Niveau 1

source: Level 2
fr_fr: Niveau 2

source: Level 3
fr_fr: Niveau 3

source: Level 4
fr_fr: Niveau 4

source: Level 5
fr_fr: Niveau 5

source: Level 6
fr_fr: Niveau 6

source: Line
fr_fr: Courbes

source: Link
fr_fr: Lien

source: Link to display or download a document
fr_fr: Lien pour afficher et/ou télécharger un document

source: Linked to a process instantiation or a task, using the contract
fr_fr: Associé à l'instanciation d'un processus ou à une tâche, en utilisant le contrat

source: Linked to an application descriptor.
fr_fr: Associée à un descripteur d’application ou un processus (synthèse des cas).

source: List from column keys
fr_fr: Liste des clés de colonnes pertinentes

source: List of cases open for a process definition id
fr_fr: Liste des cas ouverts pour un id de définition de processus

source: List of human task in ready state for current user (pending + assigned)
fr_fr: Liste des tâches humaines en état ready pour l'utilisateur courant (en attente + assignées)

source: Loading {{mode}}...
fr_fr: Chargement {{mode}}...

source: Localization
fr_fr: Localisation

source: Long number values (Milliseconds since epoch)
fr_fr: Nombres Long (Millisecondes depuis epoch)

source: Look what you're missing
fr_fr: Regardez ce que vous allez rater

source: MM/dd/yyyy
fr_fr: dd/MM/yyyy

source: Make sure the technical format value and its translations is a valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">date format</a>.
fr_fr: Assurez-vous que la valeur pour le format technique de date et ses traductions sont des <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formats de date</a> valides.

source: Make sure the technical format values and their translations are valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">date/time formats</a>.
fr_fr: Assurez-vous que la valeur pour le format technique de date/heure et ses traductions sont des <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formats de date/heure</a> valides.

source: Malformed json file
fr_fr: Le fichier json n'a pas le bon format

source: Mark as favorite
fr_fr: Ajouter à mes favoris

source: Max value
fr_fr: Valeur maximum

source: Medium devices (width ≥ 992px)
fr_fr: Ecrans de laptops (largeur ≥ 992 px)

source: Metadata
fr_fr: Méta-données

source: Migrate
fr_fr: Migrer

source: Migration report
fr_fr: Rapport de migration

source: Milliseconds since Epoch (number or string variable)
fr_fr: Millisecondes depuis Epoch (nombre ou variable String)

source: Min value
fr_fr: Valeur minimum

source: Minified widgets JavaScript for optimized performance
fr_fr: JavaScript minifié des widgets, pour des performances optimisées en production

source: Miscellaneous toolbar
fr_fr: Barre d'outils divers

source: Modal
fr_fr: Fenêtre modale (pop-in)

source: Modal Id
fr_fr: ID de la fenêtre modale

source: Modal container
fr_fr: Container modal

source: Modals
fr_fr: Fenêtres modales

source: Move asset down
fr_fr: Déplacer l'asset vers le bas

source: Move asset up
fr_fr: Déplacer l'asset vers le haut

source: Move the row down
fr_fr: Déplacer la ligne vers le bas

source: Move the row up
fr_fr: Déplacer la ligne vers le haut

source: Multi-line, expandable, text input field
fr_fr: Champ de saisie de texte multiligne et extensible

source: Multiple content for tabs container
fr_fr: Contenus multiples pour le tabs container

source: Multiple groups of widgets, each group in a tab
fr_fr: Plusieurs groupes de widgets, chaque groupe représentant un onglet

source: Multiple screen size
fr_fr: Résolutions d'écran multiples

source: Multiple set charts
fr_fr: Graphiques multiples

source: Name
fr_fr: Nom

source: Name must be less than {{maxlength}} characters long
fr_fr: Le nom doit contenir moins de {{maxlength}} caractères

source: Name must contains only alphanumeric characters with no space
fr_fr: Le nom ne doit contenir que des caractères alphanumériques sans espace

source: Navigation link to another page or form
fr_fr: Lien de navigation vers une autre page ou formulaire

source: New embedded AngularJS filter to resolve the lazy references of a business object
fr_fr: Nouveau filtre AngularJS intégré, permettant de résoudre les références à un objet métier en mode Lazy

source: New modal container to create pop-ins
fr_fr: Nouveau container modal pour créer des pop-ins

source: New window (_blank)
fr_fr: Nouvelle fenêtre (_blank)

source: Next page to display, for applications. In the Portal, it is ignored as navigation is managed automatically
fr_fr: Page suivante à afficher, dans une application. Dans le portail, ce champ est ignoré car la navigation est gérée automatiquement

source: No
fr_fr: Non

source: No Bonita REST API calls.
fr_fr: Aucun appel à la REST API Bonita.

source: No Business Data Model currently deployed.
fr_fr: Aucun Modèle de Données Métier actuellement déployé.

source: No application selected
fr_fr: Aucune application sélectionnée

source: No artifact found.
fr_fr: Aucun artefact.

source: No variable
fr_fr: Aucune variable

source: No {{label}} asset (no scope selected).
fr_fr: Aucun asset {{label}} (aucun périmètre sélectionné).

source: No {{label}} asset at page level.
fr_fr: Aucun asset {{label}} au niveau de la page.

source: No {{label}} asset at widget level.
fr_fr: Aucun asset {{label}} au niveau du widget.

source: No {{label}} asset.
fr_fr: Aucun asset {{label}}.

source: No. This data will be specific to this fragment.
fr_fr: Non, cette variable sera interne au fragment.

source: No: user time zone is ignored. <br>Yes: display/input reflects the user time zone and may be different from value
fr_fr: Non : fuseau horaire de l’utilisateur ignoré <br>Oui : fuseau horaire de l’utilisateur reflété dans l'affichage/saisie qui peut être différent(e) de la valeur

source: None
fr_fr: Aucun

source: Not compatible with current UI Designer version. To open it, use a newer version of UI Designer.
fr_fr: Non compatible avec la version actuelle du UI Designer . Pour l'ouvrir, utilisez une nouvelle version de UI Designer.
