Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: Note that reordering assets is disabled when the list is a search results list. Indeed, reordering is only relevant if the complete list of page assets is displayed.
fr_fr: Note : la réorganisation des assets est désactivée lorsque la liste donne les résultats d'une recherche. En effet, la réorganisation n'est pertinente que si c'est la liste complète des assets de page qui est affichée.

source: Noteworthy changes
fr_fr: Changements notables

source: Now
fr_fr: Maintenant

source: Now button label
fr_fr: Libellé du bouton Aujourd'hui

source: Number of array elements defines the number of times the container structure is repeated. Array data is available to widgets in the container
fr_fr: Le nombre des éléments du tableau détermine le nombre des répétitions de la structure du container. Les données du tableau peuvent être utilisées dans les widgets du container

source: Object key to display
fr_fr: Clé de l'objet à afficher

source: Object key to display. Leave it empty for whole object
fr_fr: Clé de l'objet à afficher. Laisser vide pour l'object complet

source: Once you select an element, edit its properties in the properties panel on the right.
fr_fr: Lorsque vous sélectionnez un élément, modifiez ses propriétés dans le panneau de propriétés sur la droite.

source: Only works with formats supported by the browser (by default PDF and image)
fr_fr: Fonctionne uniquement avec les formats supportés par le navigateur (par défaut PDF et image)

source: Open Modal
fr_fr: Ouvrir une fenêtre modale

source: Open documentation
fr_fr: Ouvrir la documentation

source: Open help
fr_fr: Ouvrir l'aide

source: Open modal
fr_fr: Ouvrir une fenêtre modale

source: Open your preview in a browser tab to set new URL parameters, play with dynamic browser sizing, and to reuse the same URL in another browser for testing purposes.
fr_fr: Ouvrez votre aperçu dans un nouvel onglet de votre navigateur, soit pour définir de nouveaux paramètres d'URL, soit pour jouer avec le sizing dynamique du navigateur, soit pour copier l'URL et la coller dans un autre navigateur à des fins de test.

source: Or use the <b>Switch</b> menu option close to the widget name in the properties panel.
fr_fr: Ou utilisez l'option de menu <b>Remplacer</b> près du nom du widget, dans le panneau de propriétés.

source: Ordered by artifact name.<br/>Click to sort by last update
fr_fr: Classés par nom d’artefact. <br/> Cliquez pour trier par date de dernière mise à jour

source: Ordered by last update.<br/>Click to sort by artifact name
fr_fr: Classés par date de dernière mise à jour. <br/> Cliquez pour trier par nom d’artefact

source: Overridden artifacts
fr_fr: Artefacts remplacés

source: Overview
fr_fr: Synthèse

source: Page Name
fr_fr: Nom de la page

source: Page description
fr_fr: Description de la page

source: Page display name
fr_fr: Nom affiché de la page

source: Page level
fr_fr: Niveau de la page

source: Page size
fr_fr: Taille de la page

source: Page token
fr_fr: Token de la page

source: Parent frame (_parent)
fr_fr: Cadre parent (_parent)

source: Perform an HTTP request
fr_fr: Effectue une requête HTTP

source: Pie
fr_fr: Secteurs

source: Please provide the information on how to retrieve elements of "{{ctrl.businessData.name}}"
fr_fr: Veuillez fournir les informations sur la façon de récupérer les éléments de "{{ctrl.businessData.name}}"

source: Polar Area
fr_fr: Aire polaire

source: Preview
fr_fr: Aperçu

source: Preview - {{pageName}}
fr_fr: Aperçu - {{pageName}}

source: Process document
fr_fr: Document de processus

source: Process form
fr_fr: Formulaire de processus

source: Process instantiation form
fr_fr: Formulaire d'instanciation de processus

source: Process name
fr_fr: Nom du processus

source: Process version
fr_fr: Version du processus

source: Properties
fr_fr: Propriétés

source: Property names must start with a letter and contain only alphanumeric characters
fr_fr: Les noms des widgets personnalisés doivent commencer par une lettre et ne contenir que des caractères alphanumériques

source: Put usage of this widget. This information is only visible on UI-Designer editor
fr_fr: Pour décrire l'utilisation du widget. Cette information n'est visible que dans l'éditeur du UI Designer

source: Read-only
fr_fr: Lecture seule

source: Read-write binding, initialized or updated by users' input (bi-directional bond)
fr_fr: Liaison de type lecture / écriture, initialisée ou mise à jour par l’input de l'utilisateur (liaison bidirectionnelle)

source: Referenced in a case context (current case or other cases)
fr_fr: Référencé dans le contexte d'un cas (cas courant ou autres cas)

source: Relative time filter
fr_fr: Filtre d'affichage de temps relatif

source: Remove
fr_fr: Supprimer

source: Remove from collection
fr_fr: Supprimer de la collection

source: Remove tab
fr_fr: Supprimer l'onglet

source: Rename
fr_fr: Renommer

source: Render a UID page of form in the end-user browser
fr_fr: Afficher une page UID de formulaire dans le navigateur de l'utilisateur final

source: Repeat container content. Variable of type array
fr_fr: Répéter le contenu du container. Variable de type tableau

source: Repeat content for the plain container
fr_fr: Répéter le contenu du container simple

source: Repeated container
fr_fr: Container répété

source: Request
fr_fr: Requête

source: Required
fr_fr: Obligatoire

source: Required angular modules
fr_fr: Modules AngularJS requis

source: Reset mapping
fr_fr: Réinitialiser

source: Reset mapping to default
fr_fr: Réinitialiser le mapping

source: Response
fr_fr: Réponse

source: Returned key
fr_fr: Clé retournée

source: Row
fr_fr: Ligne

source: Rows
fr_fr: Lignes

source: Save
fr_fr: Enregistrer

source: Save a variable to the LocalStorage
fr_fr: Enregistrer une variable dans le LocalStorage

source: Save as ...
fr_fr: Enregistrer sous...

source: Save as fragment...
fr_fr: Enregistrer en tant que fragment ...

source: Save as...
fr_fr: Enregistrer sous ...

source: Save data to / Load data from LocalStorage.
fr_fr: Enregistrer une donnée dans / charger une donnée à partir du LocalStorage.

source: Save draft
fr_fr: Sauvegarder le brouillon

source: Save {{ctrl.page.name}} as...
fr_fr: Enregistrer {{ctrl.page.name}} sous ...

source: Save {{ctrl.widget.name}} as...
fr_fr: Enregistrer {{ctrl.widget.name}} sous ...

source: Saved
fr_fr: Enregistré

source: Scope
fr_fr: Périmètre

source: Search
fr_fr: Chercher

source: Search a list of cases based on search indexes
fr_fr: Recherchez une liste de cas basée sur une clé de recherche

source: Search on name
fr_fr: Rechercher par nom

source: See <a href="https://github.com/chartjs/Chart.js/tree/v1.0.2/docs" target="_blank">chart.js</a> for details of the chart options for each type of chart. Specify a JSON structure corresponding to the options you want
fr_fr: Visitez <a href="https://github.com/chartjs/Chart.js/tree/v1.0.2/docs" target="_blank">chart.js</a> pour plus de détails sur les options disponibles pour chaque type de graphique. Spécifiez une structure JSON correspondant aux options de votre choix

source: See example
fr_fr: Voir l'exemple

source: See example 'date object initialization'
fr_fr: Voir l’exemple « initialisation d’un objet date »

source: See example 'functional programming'
fr_fr: Voir l'exemple 'programmation fonctionnelle"

source: See examples
fr_fr: Exemples

source: See the default localization asset for an example.
fr_fr: Voir l'asset de localisation par défaut pour obtenir un exemple.

source: Select
fr_fr: Sélectionner

source: Select a widget or start typing
fr_fr: Sélectionnez un widget ou commencez à taper

source: Select an element on the whiteboard, then set its properties here
fr_fr: Sélectionnez un élément du tableau blanc puis utilisez cette zone pour définir ses propriétés

source: Select an option
fr_fr: Sélectionnez une option

source: Select the device type icon in the top bar, then specify the width property for each widget in the page or form. Each configuration is independent. To specify the width property for a widget for all device types, set the value for each device type separately, or leave the default value.
fr_fr: Sélectionnez l'icone correspondant à l'affichage cible dans la barre du haut, puis spécifiez la propriété Largeur pour tous les widgets de la page ou du formulaire. Pour spécifier la propriété Largeur d'un widget pour tous les affichages, définissez une valeur pour chaque affichage, ou laissez la valeur par défaut.

source: Select the query to retrieve Business Object. Queries can be a simple attribute query (ex: findByName) or an additional query such as a custom query.
fr_fr: Sélectionnez la requête pour récupérer l'objet métier. Les requêtes peuvent être une requête d'attribut simple (ex: findByName) ou une requête supplémentaire telle qu'une requête personnalisée.

source: Select your .zip file
fr_fr: Sélectionnez votre fichier .zip

source: Select your file
fr_fr: Sélectionnez votre fichier

source: Select your localization.json
fr_fr: Sélectionnez votre fichier localization.json

source: Selected Row
fr_fr: Ligne sélectionnée

source: Selected Value
fr_fr: Valeur sélectionnée

source: Selected values
fr_fr: Valeurs sélectionnées

source: Send data to this URL when the button is clicked
fr_fr: Envoyer des données vers cette URL lors du clic sur le bouton

source: Set <code>Bordered</code> property at true.
fr_fr: Passez la propriété <code>Bordures</code> à oui.

source: Set labels
fr_fr: Libellés des jeux de données

source: Set of buttons for mutually exclusive options. The user selects one option
fr_fr: Jeu de cases d'options s'excluant mutuellement. L'utilisateur sélectionne une option

source: Set of checkboxes for options. The user selects zero or more
fr_fr: Ensemble de cases à cocher pour des options. L'utilisateur sélectionne zéro ou plusieurs

source: Set the Data source to Bonita API to populate the data table with records from a Bonita REST API.
fr_fr: Passez la propriété Source de données à API Bonita pour remplir le tableau avec les données d'une REST API Bonita.

source: Set the input time on the same line as the input date
fr_fr: Saisie de la date et de l’heure sur la même ligne

source: Short hint that describes the expected input format for the date
fr_fr: Court indice qui décrit le format attendu pour la saisie de la date

source: Short hint that describes the expected input format for the time
fr_fr: Court indice qui décrit le format attendu pour la saisie de l'heure

source: Short hint that describes the expected value
fr_fr: Indice court qui décrit la valeur attendue

source: Short string or paragraph of text to be displayed. Can include HTML tags
fr_fr: Courte chaîne de texte ou paragraphe à afficher. Peut inclure des balises HTML

source: Should contain time zone information only when 'Handle time zone' is set to 'yes'
fr_fr: Doit contenir des informations de fuseau horaire uniquement si « Gérer les fuseaux horaires » a la valeur« oui »

source: Show Now button
fr_fr: Afficher le bouton Maintenant

source: Show Today button
fr_fr: Afficher le bouton Aujourd'hui

source: Show preview
fr_fr: Afficher l'aperçu

source: Show properties
fr_fr: Afficher les propriétés

source: Shows the languages for which there are translations in localization.json and Default, which is the source language of your page
fr_fr: Langues pour lesquelles le fichier localization.json contient des traductions, plus l'option "par défaut", la langue source de votre page

source: Since 7.5.0, UI Bootstrap is no longer provided in the UI Designer pages.
fr_fr: Depuis Bonita 7.5.0, UI Bootstrap n’est plus fourni dans les pages du UI Designer.

source: Single set charts
fr_fr: Graphiques simples

source: Size
fr_fr: Taille

source: Small devices (width ≥ 768px)
fr_fr: Tablettes (largeur ≥ 768px)

source: Sort
fr_fr: Trier

source: Sortable columns
fr_fr: Colonnes triables

source: Source Type
fr_fr: Type de source

source: Space-separated list
fr_fr: Liste séparée par des espaces

source: Specifies an alternate text for an image. The text should describe the image if the image contains information or should be left empty if the image is only for decoration
fr_fr: Spécifie un texte de remplacement pour une image. Le texte devrait décrire l'image si celle-ci contient des informations ou être laissé vide si elle est uniquement utilisée à des fins de décoration

source: Specifies the case (process instance) Id
fr_fr: Spécifie l'Id du cas (instance de processus)

source: Specifies the legal number intervals between values
fr_fr: Spécifie les intervalles numériques légaux entre les valeurs

source: Specifies the process name
fr_fr: Spécifie le nom du processus

source: Specifies the process version
fr_fr: Spécifie le numéro de version du processus

source: Specifies the task instance Id
fr_fr: Spécifie l’Id de la tâche

source: Specifies the type of link to create
fr_fr: Spécifie le type de lien à créer

source: Specifies where to open the linked document
fr_fr: Spécifie l'endroit où le document lié sera ouvert

source: Specify the number of columns of the element. All elements can take up to 12 columns.
fr_fr: Indiquez le nombre de colonnes de l'élément. Tous les éléments peuvent prendre jusqu'à 12 colonnes.

source: Standard widgets JavaScript for edition outside the UI Designer
fr_fr: JavaScript standard des widgets, pour éditer la page en dehors du UI Designer

source: Start a process
fr_fr: Démarrer un processus

source: Start creating a <b>process form</b> in Bonita Studio: from the appropriate pool or human task, create a contract and launch the UI Designer. It will auto-generate a dedicated form to edit.
fr_fr: Débutez la création des <b>formulaires de processus</b> dans Bonita Studio : dans le pool ou la tâche humaine adéquate, créez un contrat (le nécessaire attendu pour s'exécuter) puis lancez le UI Designer. Le formulaire sera automatiquement généré. Il est basé sur le contrat et peut être édité.

source: Start creating an <b>application layout</b> by importing the default layout, available in the Bonita Portal resources, and edit it.
fr_fr: Créez un <b>layout d'application</b> en important le layout par défaut (disponible dans les Ressources de Bonita Portal) et en lui apportant la personnalisation nécessaire.

source: Start process
fr_fr: Démarrer un processus

source: Starting with version 7.7.0, the name of a UI artifact becomes its unique identifier, instead of a randomized identifier. This will make them easier to find in Bonita repositories. You may rename existing artifacts so they benefit from this change too.
fr_fr: A partir de la version 7.7.0, le nom d'un nouvel artefact créé avec le UI Designer devient son identifiant unique, en remplacement d'un identifiant aléatoire. Cela permet de mieux les retrouver dans le projet Bonita. Pour que ce changement s'applique aux artefacts existants, renommez-les.

source: Static
fr_fr: Statique

source: Step
fr_fr: Étape

source: String
fr_fr: Chaines

source: Style toolbar
fr_fr: Barre d'outils de style

source: Styling zebra-striping can be done in the theme.css file to customize <b>all</b> the tables.
fr_fr: Les rayures peuvent être ajoutées dans le fichier theme.css pour personnaliser <b>tous</b> les tableaux.

source: Styling zebra-striping can be done in the theme.css file to customize all data-tables.
fr_fr: Les rayures peuvent être ajoutées dans le fichier theme.css pour personnaliser tous les tableaux.

source: Subgroup of toolbar buttons for extra options
fr_fr: Sous-groupe des boutons de la barre d'outils pour les options supplémentaires

source: Subgroup of toolbar buttons to arrange the text layout
fr_fr: Sous-groupe des boutons de la barre d'outils pour organiser la mise en page du texte

source: Subgroup of toolbar buttons to set how the text looks
fr_fr: Sous-groupe des boutons de la barre d'outils pour organiser le style du texte

source: Subgroup of toolbar buttons to structure the text
fr_fr: Sous-groupe des boutons de la barre d'outils pour organiser la mise en page du texte

source: Submit
fr_fr: Soumettre

source: Submit a task
fr_fr: Soumettre une tache

source: Submit task
fr_fr: Soumettre une tache

source: Successful import
fr_fr: Importation réussie

source: Successful response value
fr_fr: Valeur de réponse en cas de succès

source: Summary of the Bonita REST API calls made by the page.
fr_fr: Résumé des appels à la REST API Bonita faits par la page.

source: Summary of the calls to Bonita REST API made in a page, form, or layout
fr_fr: Récapitulatif des appels à l’API REST de Bonita faits par une page, formulaire ou layout

source: Switch
fr_fr: Remplacer

source: Switch <i class="fa fa-exchange"></i>
fr_fr: Remplacer <i class="fa fa-exchange"></i>

source: Switch to
fr_fr: Remplacer par

source: Switch widget
fr_fr: Remplacer le widget

source: Switch {{ctrl.propertiesFrom.name}} {{ctrl.widgetFrom.$$widget.type}}
fr_fr: Remplacer {{ctrl.propertiesFrom.name}} {{ctrl.widgetFrom.$$widget.type}}

source: Switch...
fr_fr: Remplacer ...

source: Tab properties usage
fr_fr: Utilisation des propriétés de l'onglet

source: Tab x
fr_fr: Onglet x

source: Table
fr_fr: Tableau

source: Table with pagination and filtering capabilities
fr_fr: Tableau permettant la pagination et le filtrage

source: Tabs Container advancement
fr_fr: Evolution des conteneurs d'onglets

source: Tabular presentation of data from an array
fr_fr: Présentation tabulaire de données à partir d'un tableau

source: Target
fr_fr: Cible

source: Target URL on success
fr_fr: URL cible en cas de succès

source: Task Id
fr_fr: ID de tâche

source: Technical Format
fr_fr: Format technique

source: Technical date format
fr_fr: Format technique de la date

source: Technical time format
fr_fr: Format technique de l'heure

source: Text
fr_fr: Texte

source: Text used to structure the page or form content
fr_fr: Texte utilisé pour structurer le contenu de la page ou du formulaire

source: Text, optionally including variables in simple expressions for interpolation using [[ variableName ]]
fr_fr: Texte, incluant éventuellement des variables dans des expressions simples en utilisant l'interpolation avec {{ variableName }}

source: The .zip archive of an exported page contains:
fr_fr: L’archive .zip d’une page exportée contient :

source: The <code>Sortable columns</code> property enables to list the columns which allow a sorted search.
fr_fr: La propriété <code>Colonnes triables</code> permet de lister les colonnes qui peuvent être triées.

source: The <em>Close modal</em> action will close the modal container that contains the button when it is pressed.
fr_fr: Sur le clic, l’action <em>Fermer une fenêtre modale</em> du bouton ferme le container modal dans lequel il est placé.

source: The <em>Open modal</em> action can be used to open any modal container on the page. To point towards the right one, specify the ID in the button's "Modal ID" property.
fr_fr: L’action <em>Ouvrir une fenêtre modale</em> ouvre n’importe quel container modal situé dans la page, le formulaire ou le layout. Spécifiez son ID dans la propriété du bouton « ID du container modal ».

source: The <em>Technical date format</em> and <em>Technical time format</em> properties define the format of the values displayed in the date and time inputs. They should be valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">AngularJS date/time formats</a>.
fr_fr: Les propriétés <em>Format technique de date</em> et <em>Format technique d'heure</em> définissent le format et les valeurs affichées dans les inputs de date et heure. Elles doivent correspondre à des <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank"> formats de date/time AngularJS</a> valides.

source: The <em>Technical date format</em> property define the format of the values displayed in the date input. It should be a valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">AngularJS date format</a>.
fr_fr: La propriété <em>Format technique de date</em> définit le format et les valeurs affichées dans l'input de date. Elle doit correspondre à un <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank"> format de date AngularJS</a> valide.

source: The <em>data sent on click</em> for POST and PUT requests must be a JavaScript Object (JSON can be used). This data will be sent in the body of the request.
fr_fr: Les <em>données envoyées au clic</em> pour les demandes POST et PUT doivent être un objet JavaScript (un JSON peut être utilisé). Ces données seront envoyées dans le corps de la requête.

source: The Display Type property allows you to customize the tabs style ('tabs' or 'pills').
fr_fr: La propriété Type d'affichage permet de personnaliser le style des onglets ('onglets' ou 'pillules').

source: The UI Designer generates <b>standard html application code, based on AngularJS</b>. Export pages if you want to further customize them in a different favorite web development environment.
fr_fr: Le UI Designer génère <b>du code html standard basé sur AngularJS</b>. Vous pouvez donc exporter des pages dans votre environnement de développement web favori pour les personnaliser davantage.

source: The UI Designer is displayed in the language of your Bonita Studio.
fr_fr: Le UI Designer s’affiche dans la langue de votre Bonita Studio.

source: The caption will be displayed as such below the property label.
fr_fr: La légende s'affiche comme telle sous le libellé de la propriété.

source: The content of <em>Label</em>, <em>Technical date format</em>, <em>Placeholder</em> properties, as well as the label of button <em>Today</em> are localized by default. Localized format can be edited in the asset <em>localization.json</em>.
fr_fr: Le contenu des propriétés <em>Libellé</em>, <em>Format technique de date</em>, <em>Placeholder</em> et le libellé du bouton <em>Aujourd'hui</em> sont localisés par défaut. Ces éléments peuvent être édités dans l'asset <em>localization.json</em>.

source: The content of <em>Label</em>, <em>Technical date formats</em>, <em>Placeholder</em> properties, as well as the labels of buttons <em>Today/Now</em> are localized by default. Localized formats can be edited in the asset <em>localization.json</em>.
fr_fr: Le contenu des propriétés <em>Libellé</em>, <em>Format technique de date</em>, <em>Placeholder</em> et les libellés des boutons <em>Aujourd'hui/Maintenant</em> sont localisés par défaut. Ces éléments peuvent être édités dans l'asset <em>localization.json</em>.

source: The controller is a JavaScript function that augments the AngularJS scope and exposes functions that can be used in the widget template.
fr_fr: Le controller est une fonction JavaScript qui augmente le scope d'AngularJS et expose des fonctions qui peuvent être utilisées dans le template du widget.

source: The default application layout will retrieve the <em>Target URL on success</em> that was sent in the message and set its window location with it.
fr_fr: Le layout d’application par défaut va récupérer l' <em>URL cible en cas de succès</em> qui a été envoyée dans le message et définir l'emplacement de sa fenêtre grâce à elle.

source: The display of dates and times relies on the user's browser time zone. Therefore, displayed values are different from stored values (except in the GMT time zone).
fr_fr: L’affichage des dates et des heures s’appuie sur le fuseau horaire du navigateur de l’utilisateur. Par conséquent, les valeurs affichées diffèrent des valeurs stockées (sauf pour le fuseau horaire GMT).
