Repository: bonitasoft/bonita-ui-designer
Catalog: backend/webapp/src/main/resources/i18n/lang-template-*.po
Languages: fr_fr

source: You can provide a filter for users to update the displayed table to show only the rows that match the filter. To do this :
fr_fr: Vous pouvez fournir un filtre permettant aux utilisateurs de mettre à jour le tableau affiché pour ne montrer que les lignes qui correspondent au filtre. Pour faire cela :

source: You can save the content of a plain container as a reusable fragment.
fr_fr: Vous pouvez enregistrer le contenu d'un container simple en tant que fragment réutilisable.

source: You can see the migration notes again by clicking on the help button
fr_fr: Pour relire ces notes de migration, cliquez sur le bouton d'aide "?"

source: You can translate all the text displayed on a UI artifact: labels, placeholders, available values of a list. Even the Date format of the Date Picker widget can be localized.
fr_fr: Vous pouvez traduire tout le texte affiché dans un artefact composant l’interface utilisateur : libellés, placeholders, valeurs disponibles d’une liste. Même le format de date du widget Date Picker peut être localisé.

source: You can use Business data type to get a business data object.
fr_fr: Vous pouvez utiliser le type de données métier pour obtenir un objet de données métier.

source: You can use Pagination section to define the number of elements you want by page (by default 10 elements) and the page number (by default first page - index 0). For example, you can bind a variable to get dynamic pagination: {{paginationVariable.pageNumber}}.
fr_fr: Vous pouvez utiliser la section Pagination pour définir le nombre d'éléments que vous voulez par page (par défaut 10 éléments) et le numéro de page (par défaut la première page - l'index 0). Par exemple, vous pouvez lier une variable pour obtenir une pagination dynamique : {{paginationVariable.pageNumber}}.

source: You can use standard HTML tags and AngularJS built-in directives, scope and interpolation system.
fr_fr: Vous pouvez utiliser les balises HTML standards ainsi que les directives, le scope, et le système d'interpolation d'AngularJS.

source: You can use the <code>API request parameters</code> property to pass additional parameters to the request.
fr_fr: Vous pouvez utiliser la propriété <code>paramètres de requête API</code> pour passer des paramètres supplémentaires à la requête.

source: You can use the <i>environment</i> property injected in the scope when inside the whiteboard editor. It allows to create a mockup display for the whiteboard as the real use data will not be available.
fr_fr: Vous pouvez utiliser la propriété <i>environment</i> injectée dans le scope à l'intérieur du whiteboard. Elle permet de d'émuler un affichage pour le whiteboard puisque les données réelles d'utilisation ne seront pas disponibles.

source: You cannot have more than one localization asset. When you upload a new asset file, it overwrites the existing one.
fr_fr: Vous ne pouvez pas avoir plus d'un asset de localisation. Télécharger un nouvel asset remplace le fichier existant.

source: You cannot import or use this artifact in older version anymore.
fr_fr: Vous ne pouvez plus importer ou utiliser cet artefact dans une version antérieure.

source: You cannot move, delete or disable <b>Base framework</b> assets. They are here only to show you which library is used to build your artifact
fr_fr: Il n'est pas possible de déplacer, supprimer ou désactiver les assets du <b>Framework Bonita</b>. Il s'agit d'informations sur les bibliothèques utilisées pour la génération de votre artefact

source: You have unsaved changes. Do you really want to leave ?
fr_fr: Vous avez des modifications non enregistrées. Voulez-vous vraiment quitter ?

source: You need to use this following css selector in your theme.css file:
fr_fr: Vous devez utiliser le sélecteur css suivant dans votre fichier theme.css :

source: You should start process form design in the studio: from the appropriate pool or human task, create a contract and launch the UI Designer. It will auto-generate a dedicated form to edit.
fr_fr: Vous devriez créer le formulaire de processus à partir du Studio : dans le pool ou la tâche humaine adéquate, créez un contrat et lancez le UI Designer. Le formulaire sera automatiquement généré, basé sur le contrat et éditable pour sa finalisation.

source: You will have to manage the minification and update the resources URL to trigger the cache busting.
fr_fr: Vous devrez gérer la minification et mettre à jour les URL des ressources pour déclencher le cache-busting et prendre en compte les modifications.

source: Your artifact was migrated from <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> to <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.
fr_fr: Votre artefact a été migré de <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> à <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.

source: Your artifact was migrated to <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.
fr_fr: Votre artefact a été migré vers <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.

source: Zebra-striping
fr_fr: Alternance de couleur

source: added
fr_fr: ajoutée

source: artifact
fr_fr: artefact

source: center
fr_fr: au centre

source: column
fr_fr: colonne

source: custom widgets
fr_fr: Widgets personnalisés

source: data model
fr_fr: modèle de données

source: default
fr_fr: par défaut

source: desktop screens (1200px ≤ screenSize)
fr_fr: écrans de bureau (1200px ≤ taille d'écran)

source: error
fr_fr: erreur

source: expression or variable
fr_fr: expression ou variable

source: form
fr_fr: formulaire

source: formatted String variables
fr_fr: variable String au format

source: h:mm:ss a
fr_fr: HH:mm:ss

source: has been migrated successfully. Check migration details <i class="fa fa-wrench status"></i> for more details.
fr_fr: a été migré avec succès. Vérifiez les détails de la migration <i class="fa fa-wrench status"></i> pour plus de détails.

source: hidden
fr_fr: masqué

source: if you edit the page, form or layout outside the UI Designer, you will not be able to reimport it.
fr_fr: si vous modifiez une page, un formulaire ou un layout en dehors du UI Designer, vous ne serez pas en mesure de la/le réimporter.

source: is not compatible with this UI Designer version. A newer version is required.
fr_fr: n'est pas compatible avec cette version du UI Designer . Une version plus récente est requise.

source: laptop screens (992px ≤ screenSize < 1200px)
fr_fr: écrans de laptop (992px ≤ taille d'écran < 1200px)

source: large
fr_fr: grande

source: left
fr_fr: A gauche

source: medium
fr_fr: moyenne

source: mobile screens (screenSize < 768px)
fr_fr: écrans de mobile (taille d'écran < 768px)

source: name
fr_fr: nom

source: no
fr_fr: non

source: overwritten
fr_fr: écrasé

source: password
fr_fr: mot de passe

source: pills
fr_fr: pilules

source: right
fr_fr: à droite

source: small
fr_fr: petite

source: successfully imported.
fr_fr: importé avec succès.

source: supportTicket is an object composed of a <em>subject</em>, <em>severity</em> level, user <em>environment</em>, reporter’s <em>contact</em> (<em>name</em> and <em>job title</em>), and an <em>URL</em> providing more details on the contact.
fr_fr: supportTicket est un objet composé d'un <em>sujet</em>, d'un <em>niveau de sévérité </em>, d'un <em>environnement utilisateur</em>, d'un <em>contact</em> (<em>name</em> et <em>job title</em>), et d'une <em>URL</em> qui fournissent plus de détails sur le contact.

source: tablet screens (768px ≤ screenSize < 992px)
fr_fr: écrans de tablette (768px ≤ taille d'écran < 992px)

source: tabs
fr_fr: onglets

source: text
fr_fr: texte

source: top
fr_fr: En haut

source: view W3C's Json specification
fr_fr: voir la spécification du JSON par le W3C

source: widget editor
fr_fr: éditeur de widget

source: yes
fr_fr: oui

source: {{ vm.page.type }} editor
fr_fr: Éditeur de {{ vm.page.type }}

source: {{asset.name}} content<expand-modal></expand-modal>
fr_fr: contenu de {{asset.name}}<expand-modal></expand-modal>

source: {{ctrl.artifact}} requires a migration
fr_fr: {{ctrl.artifact}} nécessite une migration

source: {{ctrl.page.name}} information
fr_fr: Informations de {{ctrl.page.name}}

source: {{currentLength}} of {{totalNumber}}
fr_fr: {{currentLength}} de {{totalNumber}}
