Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: Add a widget to the page where the user will specify the filter. This can be an Input widget for free-form text, or a Select widget to choose from a preset list.
pt_br: Adicione um widget à página onde o usuário irá especificar o filtro. Este pode ser um widget de entrada para texto de forma livre, ou um widget selecionado para escolher de uma lista predefinida.

source: Add borders all around the table and between all the columns.
pt_br: Adicione bordas em torno da tabela e entre todas as colunas.

source: Add documentation to your pages by providing information on a widget (e.g. how to use it), thanks to the new Description field. Use this information to generate documentation.
pt_br: Adicione documentação às suas páginas fornecendo informações em um widget (por exemplo, como usá-lo), graças ao novo campo Descrição. Use estas informações para gerar documentação.

source: Add images, CSS or JavaScript resources to your pages in the Assets panel at the bottom.
pt_br: Adicione imagens, recursos CSS ou JavaScript às suas páginas no painel de Ativos na parte inferior.

source: Add the following class in style.css asset.
pt_br: Adicione a seguinte classe no recurso style.css.

source: Add to collection
pt_br: Adicionar à coleção

source: Add/Remove an Object to/from a collection
pt_br: Adicionar/Remover um objeto para/de uma coleção

source: Added artifacts
pt_br: Artefatos adicionados

source: Additional request parameters added to the query string
pt_br: Parâmetros de requisição adicionais adicionados à string de consulta

source: Additional request parameters added to the query string as json or javascript object, by using the related variable type
pt_br: Parâmetros de solicitação adicionais adicionados à string de consulta como objeto json ou javascript usando o tipo de variável relacionado

source: Advanced options
pt_br: Opções avançadas

source: Alignment
pt_br: Alinhamento

source: Alignment toolbar
pt_br: Barra de Alinhamento

source: All <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter" target="_blank">angularJS filters</a> are available. Usage requires the use of <code>|</code> ("pipe"). E.g. <code>myVariable|lowercase</code>.
pt_br: Todos os filtros <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter" target="_blank"> angularJS </a> estão disponíveis. O uso requer o uso de <code>|</code>("pipe"). Por exemplo. <code> myVariable|lowercase </code>.

source: All process data of a case: Search for a list of case variables
pt_br: Todos os dados de processo de um caso: busca por uma lista de variáveis de caso

source: Alternate text
pt_br: Texto alternativo

source: Alternating gray and transparent backgrounds
pt_br: Alternando fundo cinza e transparente

source: Alternatively, you can set the Data source to Variable and use a variable definition to point to the table content.
pt_br: Como alternativa, você pode definir a fonte de dados como variável e usar uma definição de variável para apontar para o conteúdo da tabela.

source: An artifact designed with the UI Designer can be exported to be shared with teammates (import in the UI Designer) or used in business applications (import in Bonita Portal).
pt_br: Um artefato projetado com o Designer de UI pode ser exportado para ser compartilhado com colegas de equipe (importação no Designer de UI) ou usado em aplicações de negócios (importação no Portal Bonita).

source: An errors occurs during migration.
pt_br: Ocorreu erros durante a migração.

source: An extended table widget that provides column sorting, filtering, and paging in addition to the standard table widget capabilities.
pt_br: Um widget de tabela estendido que fornece classificação, filtragem e paginação de colunas, além dos recursos de widget de tabela padrão .

source: An {{type}} asset named <em>{{ name }}</em> is already added to assets.
pt_br: Uma ativo {{type}} chamado <em>{{ name }}</em> já está adicionada aos ativos.

source: Animation
pt_br: Animação

source: Another possibility would be adding different containers inside the modal and specify any of the following classes:
pt_br: Outra possibilidade seria adicionar contêineres diferentes dentro do modal e especificar qualquer um dos seguintes classes:

source: Any accessible CSS classes. By default UI Designer comes with Bootstrap http://getbootstrap.com/css/#helper-classes
pt_br: Quaisquer classes CSS acessíveis. Por padrão, o UI Designer vem com Bootstrap http://getbootstrap.com/css/#helper-classes

source: Any boolean variable: <i>myData</i> or <i>myData.attribute</i>
pt_br: Qualquer variável booleana: <i>myData</i> ou <i>myData.attribute</i>

source: Any button can close a modal container that contains it when a success happens after any button action.
pt_br: Qualquer botão pode fechar um container modal que o contém quando um sucesso ocorre após qualquer ação de botão.

source: Any variable: <i>myData</i> or <i>myData.attribute</i>
pt_br: Qualquer variável: <i>myData</i> ou <i>myData.attribute</i>

source: Any variable: myData or myData.attribute.
pt_br: Qualquer variável: myData ou myData.attribute.

source: Application URL token
pt_br: Token da aplicação

source: Application layout
pt_br: Layout da aplicação

source: Application page
pt_br: Página da aplicação

source: Apply a filter to the value of a variable: <em>selectedUser | json</em>
pt_br: Aplique um filtro ao valor de uma variável: <em>selectedUser | json</em>

source: Are you sure you want to delete <b>{{ctrl.artifact}}</b> {{ctrl.type}} ?
pt_br: Tem certeza que deseja excluir o {{ctrl.artifact}}<b>{{ctrl.type}}</b> ?

source: Are you sure you want to delete the {{ artifact.type }} <b>{{ artifact.name }}</b>?
pt_br: Tem certeza que deseja excluir o {{ artifact.type }}<b>{{ artifact.name }}</b>?

source: Array used to populate the table. Can be a list of objects. Use 'Column keys' to refine content
pt_br: Um array é utilizado para preencher a tabela. Pode ser uma lista de objetos. Utilize 'Chaves de coluna' para aprimorar o conteúdo

source: Artifact creation:
pt_br: Criação de artefato:

source: As used in the URL after the application token
pt_br: Como usado na URL após o token do aplicativo

source: Asset
pt_br: Ativo

source: Asset Name
pt_br: Nome Ativo

source: Asset has not been saved
pt_br: O ativo não foi salvo

source: Asset list
pt_br: Lista de Ativos

source: Asset reordering
pt_br: Reordenamento de conteúdo

source: Asset use
pt_br: Utilização de ativos

source: Assets
pt_br: Ativo

source: Assets enable you to add web resources to pages and forms. Available asset types are <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Image</strong> and <strong>Localization</strong>. Assets can be <strong>Local</strong> (file stored into the page artifact) or External (URL). The Localization asset is always local.
pt_br: Os ativos permitem que você adicione recursos web a páginas e formulários. Tipos de ativos disponíveis são <strong>JavaScript</strong>, <strong>CSS</strong>, <strong>Imagem</strong> e <strong>Localização</strong>. Os ativos podem ser <strong>Locais</strong> (arquivo armazenado no artefato de página) ou Externo (URL). O ativo de Localização é sempre local.

source: Assign before Submit
pt_br: Atribuir antes de Enviar

source: At runtime, CSS and JavaScript assets are loaded in the page header. This loading is done as it's represented in this list, CSS first then Javascript. All assets are loaded in order they are listed, widget assets before page assets (in alphabetical order of the widgets name).
pt_br: No runtime, arquivos CSS e JavaScript são carregados no cabeçalho da página. Este carregamento é feito como ele está representado nesta lista, CSS primeiro, em seguida Javascript. Todos os arquivos são carregados em ordem que são listados, ativos de widget antes dos arquivos da página (em ordem alfabética do nome dos widgets).

source: At runtime, assets of a custom widget are loaded in the order defined.
pt_br: Durante a execução, os ativos de um widget personalizada são carregados na ordem definida.

source: Attention:
pt_br: Atenção:

source: Automatically assign the Task to the current user before the execution
pt_br: Atribuir automaticamente a tarefa ao usuário atual antes da execução

source: Available in the palette, it opens over the content of a page/form/layout. To manage such containers, the Button widget gains two actions: "Open modal" and "Close modal".
pt_br: Disponível na paleta, abre sobre o conteúdo de um página/formulário/layout. Para gerenciar esses containers, o botão widget ganha duas ações: "Abrir modal" e "Fechar modal".

source: Available values
pt_br: Valores disponíveis

source: Available values: <i>bold, italics, underline, strikeThrough, pre, quote</i>
pt_br: Valores disponíveis: <i>em negrito, em itálico, sublinhado, strikeThrough, pre, citação</i>

source: Available values: <i>h1, h2, h3, h4, h5, h6, p, ul, ol</i>
pt_br: Valores disponíveis: <i>h1, h2, h3, h4, h5, h6, p, ul, ol</i>

source: Available values: <i>html, insertImage, insertLink, insertVideo, wordcount, charcount, undo, redo, clear</i>
pt_br: Valores disponíveis: <i>html, insertImage, insertLink, insertVideo, wordcount, charcount, undo, redo, clear</i>

source: Available values: <i>justifyLeft, justifyCenter, justifyRight, indent, outdent</i>
pt_br: Valores disponíveis: <i>justifyLeft, justifyCenter, justifyRight, indent, outdent</i>

source: Available variables types are string and JSON (static), and External API, Business data, JavaScript expression, and URL parameter (dynamic).
pt_br: Tipos de variáveis disponíveis são string e JSON (estáticos), e API externa, dados de negócios, expressão JavaScript e parâmetro URL (dinâmico).

source: BDM APIs are not yet sortable. For other APIs, test in the preview or refer to the BonitaBPM documentation 'REST API' pages
pt_br: As APIs BDM ainda não são classificáveis. Para outras APIs, teste na pré-visualização ou consulte a documentação 'REST API' BonitaBPM

source: Back
pt_br: Voltar

source: Back to default size
pt_br: Voltar para o tamanho padrão

source: Bar
pt_br: Barra

source: Base framework
pt_br: Quadro base

source: Because of this change, if you receive a fragment, rename it and then share it back, it will be considered as a new file by the other Bonita Studios or UI Designers.
pt_br: Por causa desta alteração, se você receber um fragmento, renomeá-lo e depois compartilhá-lo de volta, ele será considerado como um novo arquivo pelos outros Projetos Bonita ou Designers de UI.

source: Bidirectional bond
pt_br: Ligação bidirecional

source: Bind the <em>formInput</em> variable of your form.
pt_br: Vincule a <em>formInput</em> variável do seu formulário.

source: Bind the filter variable to the Data table widget Filter property.
pt_br: Vincule a variável filtro à propriedade do filtro da tabela de dados.

source: Bind the filter variable to the widget.
pt_br: Vincular a variável de filtro ao widget.

source: Bind these options to a UI-Designer variable and use them in your artifact.
pt_br: Vincule essas opções a uma variável UI-Designer e use-as no seu artefato.

source: Bind to a Variable to filter the table 'Content'
pt_br: Associar a uma variável para filtrar a tabela 'Conteúdo'

source: Bindable fragment data
pt_br: Dados de fragmento que podem ser vinculados

source: Bonita API
pt_br: API Bonita

source: Bonita REST API calls
pt_br: Chamadas Bonita REST API

source: Bordered
pt_br: Borda

source: Bound data
pt_br: Vincular dados

source: Business Data Management enhancements
pt_br: Aprimoramentos do Gerenciamento de Dados Negócio

source: Business data
pt_br: Dados de negócio

source: By convention, in <em>localization.json</em>, the language used for translation keys is English. This means that in the editor whiteboard, any widget default text is currently in English. However, to ease maintenance and update of the UI artifacts in English, you can change the keys into code names and add an <b>en-US</b> section in the <em>localization.json</em> asset file.
pt_br: Por convenção, em <em>localization.json</em>, o idioma usado para as chaves de tradução é inglês. Isto significa que no quadro do editor, qualquer texto padrão do widget está atualmente em inglês. No entanto, para facilitar a manutenção e atualização dos artefatos da interface de usuário em inglês, você pode mudar as chaves em nomes de código e adicionar uma seção <b>en-US</b> no arquivo <em>localization.json</em>.

source: By default, only page assets are displayed. To display others scopes assets, we should check Widget or Base Framework checkbox.
pt_br: Por padrão, apenas os arquivos de página são exibidos. Para exibir outros escopos ativos, devemos verificar a caixa de seleção de Widget ou Base.

source: CSS classes
pt_br: Classes CSS

source: Calendar for selecting a date (only)
pt_br: Calendário para selecionar uma data (apenas)

source: Calendar for selecting a date and time
pt_br: Calendário para selecionar uma data e hora

source: Call a business data (custom) query
pt_br: Chamada de uma consulta de dados de negócios (personalizada)

source: Can be a list of objects. Use 'Displayed key' to refine options and 'Returned key' to refine selections
pt_br: Pode ser uma lista de objetos. Use 'Displayed key' para refinar opções e 'Returned key' para aprimorar as seleções

source: Can be a list of objects. Use 'Displayed key' to refine suggestions and 'Returned key' to refine selection
pt_br: Pode ser uma lista de objetos. Use 'Displayed key' para refinar sugestões e 'Returned key' para aprimorar as seleções

source: Can be translated using the asset localization.json
pt_br: Pode ser traduzido usando o asset localization.json

source: Can be used to define the expected input format
pt_br: Pode ser usado para definir o formato de entrada esperado

source: Can be used to fulfill a contract
pt_br: Pode ser usado para preencher um contrato

source: Cancel
pt_br: Cancelar

source: Caption
pt_br: Legenda

source: Case Id
pt_br: Id da instância de processo

source: Case identifier could then be retrieved by {{myData.rootCaseId}}
pt_br: Identificador de caso pôde ser obtido por {{myData.rootCaseId}}

source: Case overview
pt_br: Visão geral da instância

source: Change the type of a UI Designer artifact (page/form)
pt_br: Alterar o tipo de um artefato de UI Designer (página/formulário)

source: Changes need to be saved to enable the preview
pt_br: As alterações precisam ser salvas para ativar a visualização

source: Check that the json file structure matches a standard UI Designer export.
pt_br: Verifique se a estrutura do arquivo json corresponde a uma exportação do Designer de UI padrão.

source: Check that the zip archive contains one of following files {{ infos.modelfiles }}.
pt_br: Verifique se o arquivo zip contém um dos seguintes arquivos {{ infos.modelfiles }}.

source: Check that the zip archive contains the file {{ infos.modelfile }}.
pt_br: Verifique se o arquivo zip contém o arquivo {{ infos.modelfile }}.

source: Check that the zip file structure matches a standard UI Designer export.
pt_br: Verifique se a estrutura do arquivo zip corresponde a uma exportação do UI Designer padrão.

source: Check the log files
pt_br: Verifique os arquivos de log

source: Choices
pt_br: Opções

source: Choices (comma separated)
pt_br: Opções (separadas por vírgula)

source: Choose a business object
pt_br: Escolha um objeto de negócio

source: Choose process document if the file is used by a process
pt_br: Escolha o documento de processo se o arquivo for usado por um processo

source: Choose true if you want display this modal with an animation, false otherwise
pt_br: Escolha verdadeiro se você quer exibir esta modal com uma animação, falso caso contrário

source: Clear
pt_br: Limpar

source: Clear search
pt_br: Limpar Pesquisa

source: Click <em>Add</em> to override.
pt_br: Clique em <em>Adicionar</em> à substituição.

source: Click to bind to a constant
pt_br: Clique para associar a uma constante

source: Click to bind to an expression
pt_br: Clique para associar a uma expressão

source: Click to see migration report
pt_br: Clique para ver o relatório de migração

source: Close
pt_br: Fechar

source: Close Modal
pt_br: Fechar Modal

source: Close modal
pt_br: Fechar Modal

source: Close modal on success
pt_br: Fechar modal com sucesso

source: Close modal when the action is successful
pt_br: Fechar modal quando a ação for bem sucedida

source: Collection
pt_br: Coleção

source: Collections
pt_br: Coleções

source: Colors
pt_br: Cores

source: Column keys
pt_br: Chaves de coluna

source: Columns key
pt_br: Chave de colunas

source: Comma-separated list
pt_br: Lista separada por vírgulas

source: Comma-separated list or bound an array data
pt_br: Lista separada por vírgulas ou uma associação de array de dados

source: Comma-separated list or variable
pt_br: Lista separada por vírgulas ou variáveis

source: Community edition features
pt_br: Recuros da Edição Community

source: Condensed
pt_br: Condensado

source: Condensed table with half padding
pt_br: Tabela condensada com meio espaçamento

source: Configure widgets using the <b>properties panel</b> on the right.
pt_br: Configure as widgets usando o <b>painel de propriedades</b> à direita.

source: Confirm deletion
pt_br: Confirme a exclusão

source: Constant
pt_br: Constante

source: Container used for a form. Eases validation
pt_br: Contêiner utilizado para um formulário. Facilita a validação

source: Containers
pt_br: Contêiners

source: Containers cannot be edited.
pt_br: Os contêiners não podem ser editados.

source: Containers cannot be switched.
pt_br: Os contêiners não podem ser trocados.

source: Content
pt_br: Conteúdo

source: Control
pt_br: Controle

source: Controller
pt_br: Controlador

source: Controller can be left empty if not needed.
pt_br: Controlador pode ser deixado vazio se não necessário.

source: Convert to ...
pt_br: Converter para ...

source: Convert {{ctrl.page.name}}
pt_br: Converter {{ctrl.page.name}}

source: Corrupted zip archive.
pt_br: Arquivo zip corrompido.

source: Create
pt_br: Criar

source: Create a JSON variable named <code>updateDate</code> to hold a timestamp as a number
pt_br: Cria uma variável JSON chamada <code>updateDate</code> para segurar um timestamp como um número

source: Create a JavaScript file named <code>date-ago-filter.js</code> that updates the <code>bonitasoft.ui.extensions</code> module with the filter:
pt_br: Crie um arquivo JavaScript chamado <code>date-ago-filter.js</code> que atualiza o módulo <code>bonitasoft.ui.extensions</code> com o filtro:

source: Create a filter variable in the variable panel. If you are using an Input widget, this variable has no value.
pt_br: Crie uma variável de filtro no painel de variáveis. Se você estiver usando um widget de entrada, essa variável não tem valor.

source: Create a fragment to reuse the same group of widgets with the same behavior in several pages or forms.
pt_br: Crie um fragmento para reutilizar o mesmo grupo de widgets com o mesmo comportamento em várias páginas ou formulários.

source: Create a new UI Designer artifact
pt_br: Criar um novo artefato de UI Designer

source: Create a new variable
pt_br: Criar uma nova variável

source: Create a user interface to handle "{{ctrl.businessData.name}}"
pt_br: Criar uma interface de usuário para lidar com "{{ctrl.businessData.name}}"

source: Create a variable in the bottom panel. Using a variable in a widget property depends on the property value type, described in the next section.
pt_br: Crie uma variável no painel inferior. O uso de uma variável em uma propriedade de widget depende do tipo de propriedade descrita na próxima seção.

source: Create an <b>application page</b> directly in the UI Designer
pt_br: Criar uma <b>página de aplicação</b> diretamente no UI Designer

source: Create new artifact
pt_br: Criar novo artefato

source: Create new property
pt_br: Criar nova propriedade

source: Create variables in the Variables panel at the bottom, and use them to edit the widget properties.
pt_br: Crie variáveis no painel Variáveis na parte inferior e use-as para editar as propriedades das widgets.

source: Created with an older version of UI Designer. Open it for more details.
pt_br: Criado com uma versão mais antiga do UI Designer. Abra-o para mais detalhes.

source: Current frame (_self)
pt_br: Quadro atual (_self)

source: Custom URL
pt_br: URL personalizada

source: Custom services
pt_br: Serviços personalizados

source: Custom style
pt_br: Estilo personalizado

source: Custom widget
pt_br: Widgets personalizados

source: Custom widgets
pt_br: Widgets personalizadas

source: Custom widgets are not clearly visible on the whiteboard but you can see them with the preview.
pt_br: Widgets personalizados não estão claramente visíveis no quadro atual, mas você pode vê-los com a prévia.

source: Customize the default look and feel as follows:
pt_br: Personalizar a aparência padrão da seguinte forma:

source: DELETE
pt_br: EXCLUIR

source: Data
pt_br: Dado

source: Data Management
pt_br: Gerenciamento de dados

source: Data saved on click. You might bind it to the variable you use to initialize your form, e.g. 'formInput'
pt_br: Dados salvos ao clicar. Você pode vinculá-los à variável que você usa para inicializar seu formulário, por exemplo, 'formInput'

source: Data sent on click
pt_br: Dados enviados no clique

source: Data source
pt_br: Fonte de dados

source: Data-Table
pt_br: Tabela-Dados

source: Date
pt_br: Data

source: Date & time display
pt_br: Exibir Data e Hora

source: Date Placeholder
pt_br: Espaço reservado para data

source: Date and time
pt_br: Data e hora

source: Date and time can reflect the user time zone (e.g., a meeting day and time) or be absolute, identical everywhere (e.g., opening hours of a store somewhere). This is controlled by the property <em>Handle time zone</em>.
pt_br: Data e hora podem reflectir a zona de tempo do usuário (por exemplo, um dia de reunião e hora) ou ser absoluta, idêntica em todo o lado (ex.: horas de abertura de uma loja em algum lugar). Isso é controlado pela propriedade <em>Área de tempo de uso</em>.

source: Date display
pt_br: Exibição de data

source: Date filter
pt_br: Filtro de data

source: Date formats are localized by default. Localized formats can be edited in <em>localization.json</em> (refer to the <a href="javascript:void(0);" ng-click="tabContainer.activeTab = 'localization'">localization section</a>).
pt_br: Formatos de datas são localizados por padrão. Formatos localizados podem ser editados em <em>localization.json</em> (consulte a seção de localização <a href="javascript:void(0);" ng-click="tabContainer.activeTab = 'localization'"></a>).

source: Date object
pt_br: Data do objeto

source: Date objects
pt_br: Objetos de data

source: Default
pt_br: Padrão

source: Default label
pt_br: Etiqueta padrão

source: Default name
pt_br: Nome padrão

source: Default value
pt_br: Valor padrão

source: Define a condition for widget visibility, <em>userAge &gt; 18</em>
pt_br: Defina uma condição para a visibilidade da widget, <em>userAge &gt; 18</em>

source: Define how to retrieve Business Object
pt_br: Definir como recuperar o objeto de negócio

source: Define table headers as the value of a variable: <em>myArrayVariable</em>
pt_br: Defina os cabeçalhos de tabela como o valor de uma variável: <em>myArrayVariable</em>

source: Defines endpoint URL where the file will be uploaded
pt_br: Define a URL onde o arquivo será carregado

source: Delete
pt_br: Excluir

source: Delete asset
pt_br: Excluir asset

source: Delete variable
pt_br: Excluir a variável

source: Deletion is not possible
pt_br: Exclusão não é possível

source: Describes the property
pt_br: Descreve a propriedade

source: Description
pt_br: Descrição
