Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: The modal size can be selected in the container <em>Size</em> properties. Options available are small, medium or large, which will control the width of the modal.
pt_br: O tamanho do modal pode ser selecionado nas propriedades do contêiner <em>Tamanho</em>. As opções disponíveis são pequenas, média ou grande, que controlará a largura do modal.

source: The modal style can be improved by using the <em>modal-body</em> specific class into the <em>CSS Classes</em> property field.
pt_br: O estilo modal pode ser melhorado usando o <em>modal-body</em> classe específica para o <em>CSS Classes</em> campo de propriedade.

source: The name of the key to use as label. Can be empty
pt_br: O nome da chave utilizada como etiqueta. Pode ser vazio

source: The name of the key to use as value. Leave it empty for whole object
pt_br: O nome da chave utilizada como valor. Deixe-a vazia para utilizar o objeto completo

source: The page has not been imported.
pt_br: A página não foi importada.

source: The portal and tasklist will redirect to the process list (<em>Start process</em> action) or refresh the task list (<em>Submit task</em> action).
pt_br: O portal e a lista de tarefas redirecionarão para a lista de processos (ação <em>Iniciar processo</em>) ou atualizar a lista de tarefas (ação <em>Enviar tarefa</em>).

source: The property <em>Value to add</em> can either be a JavaScript Object or a String depending on the format expected for the collection you are building.
pt_br: A propriedade <em>Valor para adicionar</em> pode ser um objeto JavaScript ou uma String dependendo do formato esperado para a coleção que você está construindo.

source: The same "Tag" button displays a summary of all REST API calls made by the current artifact to the Bonita REST API."
pt_br: O mesmo botão "Tag" exibe um resumo de todas as chamadas de API REST feita pelo artefato atual para a Bonita API REST."

source: The scale labels for the x-axis for line and bar charts, ray labels for a radar chart, sector labels for single set charts
pt_br: As etiquetas do eixo x-axis para gráficos de linhas e barras, do raio para um gráfico de radar, do setor para gráficos únicos

source: The sort is backend when datasource is Bonita API. It is frontend, otherwise.
pt_br: O tipo é backend quando a fonte de dados é Bonita API. É frontend, caso contrário.

source: The switch widget feature has been improved to guide the user efficiently to avoid incompatible properties mapping that may lead to inconsistent states of widgets.
pt_br: O recurso de alternância de widget foi melhorado para guiar o usuário de forma eficiente para evitar o mapeamento de propriedades incompatíveis que pode levar a estados inconsistentes de widgets.

source: The tab's properties allows you to customize default display and behaviour of tabs based on data and/or JS expressions.
pt_br: As propriedades da guia permitem que você personalize o comportamento e exibição padrão de guias baseadas em dados e/ou expressões JS.

source: The tooltip will be display as such, close to the property label.
pt_br: A dica será exibida como tal, perto da etiqueta de propriedade.

source: The values of all properties are also used as translation keys. As a result, if you choose not to keep the default values, update the asset <em>localization.json</em> accordingly.
pt_br: Os valores de todas as propriedades também são usados como chaves de tradução. Como resultado, se você escolher não manter os valores padrão, atualize o ativo <em>localization.json.</em> apropriadamente.

source: The whiteboard is organized in <b>rows</b> that you can move up and down, or delete.
pt_br: O quadro é organizado em <b>linhas</b> que você pode mover para cima e para baixo, ou excluir.

source: The widget HTML template is defined here.
pt_br: O modelo HTML do widget está definido aqui.

source: The widget has not been imported.
pt_br: O widget não foi importado.

source: The {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> will be overwritten.
pt_br: O {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> será sobrescrito.

source: The {{ ::importReport.type }} to import contains elements with the same Id as some existing elements.
pt_br: O {{ ::importReport.type }} para importar contém elementos com o mesmo Id que alguns elementos existentes.

source: The {{ artifact.type }} cannot be deleted because it is used in:
pt_br: O {{ artifact.type }} não pode ser excluído porque é usado em:

source: The {{ artifactType }} has not been imported.
pt_br: O {{ artifactType }} não foi importado.

source: Then, provide a comma-separated list for the columns keys indicating the attribute to display in each column.
pt_br: Em seguida, forneça uma lista separada por vírgulas para as chaves que indicam o atributo a ser exibido em cada coluna.

source: There is a set of <b>default widgets</b> for displaying information to and for gathering information from the end users. You can also create <b>custom widgets</b>.
pt_br: Há um conjunto de <b>widgets padrão</b> para exibir e coletar informações dos usuários finais. Você também pode criar <b>widgets personalizados</b>.

source: This Business Object contains more than {{number}} levels of relations. {{numberAsText}} level and beyond will not appear.
pt_br: Este objeto de negócio contém mais de {{number}} níveis de relações. {{numberAsText}} nível e além não aparecerão.

source: This description will be displayed as a tooltip in the palette
pt_br: Esta descrição será exibida como uma dica na paleta

source: This example uses the JSON example provided if you select the type JSON.<br> It looks for the string ‘Linux’ in the array <code>environment</code> of JSON object <code>supportTicket</code>
pt_br: Este exemplo usa o exemplo JSON fornecido se selecionar o tipo JSON.<br> Procura a seqüência de caracteres 'Linux' no array <code>environment</code> do objeto JSON <code>supportTicket</code>

source: This feature is not available on Internet Explorer 11 nor Microsoft Edge for the moment.
pt_br: Este recurso não está disponível no Internet Explorer 11 nem no Microsoft Edge para o momento.

source: This filter uses the <a href="http://momentjs.com/">moment.js</a> library to transform the display of a relative time. For example, it transforms '01/01/2011' to '4 years ago'.
pt_br: Este filtro usa a biblioteca <a href="http://momentjs.com/">moment.js</a> para transformar a exibição de um tempo relativo. Por exemplo, ele transforma '01/01/2011' em 'Há 4 anos'.

source: This modal is based on ui-bootstrap implementation. It is possible to change the size or the style of the modal.
pt_br: Esta modal é baseada na implementação ui-bootstrap. É possível alterar o tamanho ou o estilo da modal.

source: This name already exists
pt_br: Este nome já existe

source: This page allows you to view a standard widget, or edit a custom widget.
pt_br: Esta página permite que você veja um widget padrão, ou edite um widget personalizado.

source: This page is empty.
pt_br: Esta pasta está vazia

source: This panel displays the list of Business Objects that has been defined and deployed using Bonita Studio.
pt_br: Este painel exibe a lista de objetos de negócio que foi definida e implantada usando o Bonita Studio.

source: This widget can be used to display/update business variable attributes defined in the Business Data Model (BDM) with the following types:
pt_br: Este widget pode ser usado para exibir/atualizar atributos de variável de negócios definidos em Modelo de Dados do Negócio (BDM) com os seguintes tipos:

source: This widget supports the following types for its <em>Value</em> property as input:
pt_br: Este widget suporta os seguintes tipos de propriedades de <em>Valor</em> como entrada:

source: This will also update the content of the preview window
pt_br: Isso também atualizará o conteúdo da janela de pré-visualização

source: Time Placeholder
pt_br: Espaço reservado

source: Title
pt_br: Título

source: Title level
pt_br: Nível do título

source: To Display the tab vertically and on the left of the content, you can read this <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">how to learn more about customization</a>
pt_br: Para exibir a guia verticalmente e à esquerda do conteúdo, você pode ler isso <a href="https://www.bonitasoft.com/bos_redirect.php?bos_redirect_id=712&bos_redirect_product=bos&bos_redirect_major_version=7.10">como aprender mais sobre a personalização</a>

source: To add content, drag and drop components from the palette to the whiteboard above.
pt_br: Para adicionar conteúdo, arraste e solte componentes da paleta para o quadro acima.

source: To allow your user to download a document add a link widget with its url property bound to
pt_br: Para permitir que seu usuário baixe um documento adicione um widget de link com sua propriedade url vinculada a

source: To avoid them being overwritten, <i>rename</i> them before you import.
pt_br: Para evitar que eles sejam substituídos, <i>renomear</i> eles antes de importar.

source: To close a modal window, put a button inside the modal that you wish to close and select the <em>Close modal</em> action.
pt_br: Para fechar uma janela modal, coloque um botão dentro da janela que você deseja fechar e selecionar a ação <em>Fechar modal</em>.

source: To control modal containers, the following methods are available in a button:
pt_br: Para controlar containers modais, os seguintes métodos estão disponíveis em um botão:

source: To control modal containers, the following methods are supported:
pt_br: Para controlar containers modais, os seguintes métodos são suportados:

source: To define the tab selected by default
pt_br: Para definir a aba selecionada por padrão

source: To display (and not update) a date and a time retrieved from the BDM API (or another API), you can either use this <em>Date time picker</em> widget with <em>Read-only</em> property set to "yes" or use a <em>Text</em>, <em>Title</em> or a <em>Table</em> widget and format the value using the provided <em>uiDate</em> <a href="javascript:void(0);" open-help="filters" editor-mode="page">filter</a>.
pt_br: Para exibir (e não atualizar) uma data e um horário recuperados da API do BDM (ou de outra API), você pode usar este widget <em>Seletor de data e hora</em> com <em>Somente leitura</em> propriedade definida como "sim" ou use um <em>Texto</em>, <em>Titulo</em> ou um widget <em>Tabela</em> e formate o valor usando o <em>uiDate</em> <a href="javascript:void(0);" open-help="filter" editor-mode="page">filter</a>.

source: To display (and not update) a date retrieved from the BDM API (or another API), you can either use this <em>Date picker</em> widget with <em>Read-only</em> property set to "yes" or use a <em>Text</em>, <em>Title</em> or a <em>Table</em> widget and format the value using the provided <em>uiDate</em> <a href="javascript:void(0);" open-help="filters" editor-mode="page">filter</a>.
pt_br: Para exibir (e não atualizar) uma data recuperada da API do BDM (ou de outra API), você pode usar este widget <em>Seletor de data</em> com a propriedade <em>Somente leitura</em> definida como " sim "ou use um <em>texto</em>, <em>título</em> ou um widget <em>tabela</em> e formate o valor usando o <em>uiDate</em> <a href = "javascript: void (0);" open-help = "filters" editor-mode="page"> filter</a>.

source: To display the data, define the header properties with a comma-separated list of column headings, bind the content to an array of JavaScript objects.
pt_br: Para exibir os dados, definir as propriedades do cabeçalho com uma lista separada por vírgulas de cabeçalhos de colunas, vincular o conteúdo a uma matriz de objetos JavaScript.

source: To display the date in a widget property evaluated as an expression, use the <code>dateAgo</code> filter on the <code>updateDate</code> variable as follows: <code>updateDate | dateAgo</code>
pt_br: Para exibir a data em uma propriedade de widget avaliada como uma expressão, use o filtro <code>dateAgo</code> na variável <code>updateDate</code> da seguinte forma: <code>updateDate ├dateAgo</code>

source: To edit a custom widget, use the <b>Edit</b> menu option close to the widget name in the properties panel.
pt_br: Para editar um widget personalizado, use a opção de menu <b>Editar</b> próxima do nome do widget no painel de propriedades.

source: To edit this standard widget, save it first as a new custom widget
pt_br: Para editar este widget padrão, salve-o primeiro como um novo widget personalizado

source: To embed a pop-in into another pop-in at runtime, drop the first modal container at the bottom, drop the second modal container below the first one, and drop the button that opens the second pop-in within the first modal container.
pt_br: Para incorporar um pop-in em outro pop-in no tempo de execução, solte o primeiro container modal no final, solte o segundo container modal abaixo do primeiro, e solte o botão que abre o segundo pop-in dentro do primeiro container modal.

source: To extend a page or form with custom AngularJS services (such as filters, constants, or factories), use the <code>bonitasoft.ui.extensions</code> module.
pt_br: Para estender um formulário ou uma página com serviços personalizados AngularJS (tais como filtros, constantes ou factories), use o módulo <code>bonitasoft.ui.extensions</code>.

source: To get data from the <i>Business Data Model</i>, please use the Business data variable type.
pt_br: Para obter dados do <i>Modelo de Dados de Negócio</i>, por favor use o tipo da variável de dados de negócio.

source: To get the data from a selected row, bind selected row to a variable.
pt_br: Para obter os dados de uma linha selecionada, vincular a linha selecionada a uma variável.

source: To keep things working, if you migrate a page designed in a version older than 7.5.0 and containing custom widgets, <em>ui-bootstrap-tpls-0.13.0.min.js</em> will be added as an asset of your page automatically. You can remove it if you don't need it.
pt_br: Para manter as coisas funcionando, se você migrar uma página criada em uma versão anterior 7.5.0 e contendo widgets personalizados, <em>ui-bootstrap-tpls-0.13.0.min.js</em> será adicionado como um ativo da sua página automaticamente. Você pode removê-lo se você não precisar dele.

source: To load a local image asset in a custom widget, you need to reference it in the template inside a <code>&lt;img&gt;</code> tag with a relative path as follows: <br><code ng-non-bindable>&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>
pt_br: Para carregar um asset de imagem local em uma widget personalizada, é preciso referenciá-lo no modelo dentro de uma baliza <code>&lt;img&gt;</code> com um caminho relativo como segue: <br><code ng-non-bindable>&lt;img src="widgets/[custom widget id]/assets/img/[image name]"&gt;</code>

source: To load an image for any custom widget, add image assets at page level. Access it with <code>asset/img/[image name]</code>.
pt_br: Para carregar uma imagem em qualquer widget personalizada, adicione assets de imagem no nível da página. Ela pode ser acessada com <code>asset/img/[image name]</code>.

source: To manage multiple version of dependencies, make sure only one version of an asset is active inside a page.
pt_br: Para gerenciar múltiplas versões de dependências, certifique-se de que somente uma versão de um asset esteja ativa dentro de uma página.

source: To open a modal window it is enough to input a modal ID in the properties, to create a button, select <em>Open modal</em> in the Action property, and fill in the right modal ID. The button should be located outside of the modal container.
pt_br: Para abrir uma janela modal, é suficiente para inserir um ID modal nas propriedades, para criar um botão, selecione <em>Abrir modal</em> na propriedade de Ação, e preencher o ID modal correto. O botão deve ser localizado fora do recipiente modal.

source: To pre-fill with a template, bind an HTML formatted variable
pt_br: Para pré-preencher com um modelo, vincule uma variável HTML formatada

source: To save <strong>{{ ::importReport.overwrittenName }}</strong> with a different identifier, <i>rename</i> it before you import.
pt_br: Para salvar <strong>{{ ::importReport.overwrittenName }}</strong> com um identificador diferente, <i>renomear</i> antes de importar.

source: To save <strong>{{ ::importReport.overwrittenName }}</strong> with a different identifier, open it and use <i>Save as</i> before you import.
pt_br: Para salvar <strong>{{ ::importReport.overwrittenName }}</strong> com um identificador diferente, abra-o e use <i>Salvar como</i> antes de importar.

source: To select a date and a time (e.g., to schedule a meeting), use the <em>Date time picker</em> widget instead.
pt_br: Para selecionar uma data e uma hora (por exemplo, para agendar uma reunião), use o <em>selecionador de datas</em> widget.

source: To select only a date (e.g., a date of birth), use the <em>Date picker</em> widget instead.
pt_br: Para selecionar apenas uma data (por exemplo, uma data de nascimento), use o<em> seletor de datas</em> widget.

source: To support multi-languages for end-users, it includes a mechanism to translate the UI artifacts (pages, forms, layouts) created.
pt_br: Para oferecer suporte a vários idiomas para usuários finais, ele inclui um mecanismo para traduzir os artefatos da interface do usuário (páginas, formulários, layouts) criados.

source: To switch widget, use another browser: Google Chrome or Mozilla Firefox.
pt_br: Para mudar o widget, use outro navegador: Google Chrome ou Mozilla Firefox.

source: To use AngularJS standard services, you must declare them in the main function arguments.
pt_br: Para utilizar os serviços padrão AngularJS, você deve declará-los nos principais argumentos da função.

source: To use a localization asset, replace the default localization.json file with a file of the same format containing all the keys in the page and the translations into the target languages. The localization asset is at page level. The format of the file must be:
pt_br: Para usar um recurso de localização, substitua o arquivo localization.json padrão com um arquivo do mesmo formato contendo todas as chaves na página e as traduções para os idiomas de destino. O ativo de localização está no nível de página. O formato do arquivo deve ser:

source: To use an image asset in the image widget, set the <code>Source type</code> property to <i>Asset</i>, and then enter the image name in the <code>Asset name</code> input field.
pt_br: Para usar um asset de imagem na widget de imagem, defina a propriedade <code>Tipo de fonte</code> como <i>Asset</i>, e, em seguida, digite o nome da imagem no campo de entrada <code>Nome do Ativo</code>.

source: To use the collection data in the widgets of this container, there are contextual variables that you can bind to the widget properties:
pt_br: Para usar os dados da coleção nos widgets deste contêiner, há variáveis contextuais que você pode conectar às propriedades do widget:

source: To use the same asset in several pages, you can add it to a custom widget and use this custom widget in your application pages or forms. When you add a custom widget with assets to a page, those assets are automatically linked to the page.
pt_br: Para usar o mesmo asset em várias páginas, você pode adicioná-lo a uma widget personalizada e utilizar esta widget em páginas de aplicação ou formulários. Quando você adiciona uma widget personalizada com assets a uma página, esses assets são associados automaticamente a esta página.

source: To view the code of a standard widget, use the <b>View</b> menu option close to the widget name in the properties panel. From there, to use the standard widget as a basis for a custom widget, click on <b>Save as</b>, find a name for the custom widget, and make it your own.
pt_br: Para ver o código de um widget padrão, use a opção de menu <b>Ver</b>, perto do nome do widget no painel de propriedades. A partir daí, para usar o widget padrão como base para um widget personalizado, clique em <b>Salvar como</b>, encontre um nome para o widget personalizado e faça dele o seu próprio.

source: Today
pt_br: Hoje

source: Today & Now
pt_br: Hoje & Agora

source: Today button label
pt_br: Rótulo do botão hoje

source: Toggle properties panel
pt_br: Alternar painel de propriedades

source: Tooltip
pt_br: Dica

source: Top frame (_top)
pt_br: Quadro superior (_top)

source: Translate the given text
pt_br: Traduzir o texto dado

source: Treat as
pt_br: Tratar como

source: Treat value as
pt_br: Tratar o valor como

source: Trigger for an action in a page or form
pt_br: Dispara uma ação em um formulário ou página

source: Two use cases : <ul> <li><code>dateVariable|uiDate</code> applies a default <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">format</a>. For an ISO 8601 string with a time, the default format is <em>'medium'</em>. Otherwise, it is <em>'mediumDate'</em>.</li> <li><code>dateVariable|uiDate:format</code> if you need to be more specific in which format, it can be specified exactly the same way as with <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">angularJS date filter</a>.<br> E.g. <code>dateVariable|uiDate:'short'</code> or <code> dateVariable|uiDate:'dd/MM/yyyy'</code></li> </ul>
pt_br: Dois casos de uso: <ul> <li><code>dateVariable|uiDate</code> aplica um padrão <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/ data "target =" _ blank "> formato </a>. Para uma seqüência ISO 8601 com um tempo, o formato padrão é <em>'médio'</em>. Caso contrário, é <em>'mediumDate'</em>.</ Li> <li><code>dateVariable|uiDate:format</code> se você precisar ser mais específico em qual formato, ele pode ser especificado exatamente da mesma forma que com o filtro <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">angularJS</a>.<br>Por exemplo <code>dateVariable|uiDate:'short'</code> ou <code>dateVariable|uiDate:'dd/MM/aaaa'</code></ li> </ ul>

source: Type
pt_br: Tipo

source: URL parameter
pt_br: Parâmetro de URL

source: URL parameter name
pt_br: Nome do parâmetro da URL

source: URL parameters
pt_br: Parâmetro de URL

source: URL to call
pt_br: URL para chamar

source: URL used to perform the HTTP request when this button is clicked.
pt_br: URL usada para executar a solicitação HTTP quando este botão é clicado.

source: Unable to access Business Data Model. Restart Bonita Studio and try again.
pt_br: Não foi possível acessar o Modelo de Dados de Negócio. Reinicie o Bonita Studio e tente novamente.

source: Unable to connect to the Business Data Model. Restarting the Studio may solve this issue
pt_br: Não foi possível conectar ao Modelo de Dados de Negócio. Reiniciar o Studio pode resolver este problema

source: Unique ID of this modal
pt_br: ID único deste modal

source: Unique checkbox for an option. The user checks it or not
pt_br: Caixa de seleção única para uma opção. O usuário seleciona ou não

source: Unmark as favorite
pt_br: Desmarcar como favorito

source: Update asset
pt_br: Atualizar o ativo

source: Upgrade between maintenance versions without migration. When a migration is required, get help from the UI Designer (warning icon, confirmation dialog, migration report)
pt_br: Atualize entre as versões de manutenção sem migração. Quando é necessária migração, obtenha ajuda do UI Designer (ícone de aviso, caixa de confirmação e relatório de migração)

source: Upgrade to a newer UI Designer version to import this {{type}}
pt_br: Atualize para uma versão mais recente do UI Designer para importar este {{type}}

source: Usage
pt_br: Uso
