Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: Ordered by last update.<br/>Click to sort by artifact name
pt_br: Ordenado pela última atualização.<br/>Clique para classificar por nome de artefato

source: Overridden artifacts
pt_br: Artefatos substituídos

source: Overview
pt_br: Visão geral

source: Page Name
pt_br: Nome da Página

source: Page description
pt_br: Descrição da Página

source: Page display name
pt_br: Nome da exibição de página

source: Page level
pt_br: Nível da página

source: Page size
pt_br: Tamanho da página

source: Page token
pt_br: Token da página

source: Pages
pt_br: Páginas

source: Parent frame (_parent)
pt_br: Quadro pai (_parent)

source: Perform an HTTP request
pt_br: Executar um pedido HTTP

source: Pie
pt_br: Pizza

source: Placeholder
pt_br: Espaço reservado

source: Please provide the information on how to retrieve elements of "{{ctrl.businessData.name}}"
pt_br: Forneça informações sobre como recuperar elementos de"{{ctrl.businessData.name}}"

source: Polar Area
pt_br: Área polar

source: Preview
pt_br: Visualizar

source: Preview - {{pageName}}
pt_br: Pré-visualização - {{pageName}}

source: Process document
pt_br: Processar documento

source: Process form
pt_br: Formulário processo

source: Process instantiation form
pt_br: Formulário de instanciação do processo

source: Process name
pt_br: Nome do Processo

source: Process version
pt_br: Versão do processo

source: Properties
pt_br: Propriedades

source: Property names must start with a letter and contain only alphanumeric characters
pt_br: Nomes de propriedades devem começar com uma letra e conter apenas caracteres alfanuméricos

source: Put usage of this widget. This information is only visible on UI-Designer editor
pt_br: Colocar o uso deste widget. Esta informação só é visível no editor de UI-Designer

source: Read-only
pt_br: Somente leitura

source: Read-write binding, initialized or updated by users' input (bi-directional bond)
pt_br: Associação read-write, inicializado ou atualizado pela entrada dos usuários (ligação bi-direcional)

source: Referenced in a case context (current case or other cases)
pt_br: Referenciado num caso (caso atual ou outros casos)

source: Relative time filter
pt_br: Filtro de tempo relativo

source: Remove
pt_br: Excluir

source: Remove from collection
pt_br: Remover da coleção

source: Remove tab
pt_br: Remover a aba

source: Rename
pt_br: Renomear

source: Render a UID page of form in the end-user browser
pt_br: Renderizar uma UID página de formulário no navegador de usuário final

source: Repeat container content. Variable of type array
pt_br: Repetir conteúdo do contêiner. Variável do tipo array

source: Repeat content for the plain container
pt_br: Repetir o conteúdo para o contêiner genérico

source: Repeated container
pt_br: Container repetido

source: Request
pt_br: Requisição

source: Required
pt_br: Obrigatório

source: Required angular modules
pt_br: Módulos AngularJS necessários

source: Reset mapping
pt_br: Redefinir mapeamento

source: Reset mapping to default
pt_br: Redefinir mapeamento para o padrão

source: Response
pt_br: Resposta

source: Response headers
pt_br: Cabeçalhos de resposta

source: Response status code
pt_br: Status da resposta

source: Returned key
pt_br: Chave retornada

source: Row
pt_br: Linha

source: Rows
pt_br: Linhas

source: Save
pt_br: Salvar

source: Save a variable to the LocalStorage
pt_br: Salvar uma variável para o LocalStorage

source: Save as ...
pt_br: Salvar Como ...

source: Save as fragment...
pt_br: Salvar como fragmento...

source: Save as...
pt_br: Salvar Como...

source: Save data to / Load data from LocalStorage.
pt_br: Salvar dados para / carregar dados do LocalStorage.

source: Save draft
pt_br: Salvar rascunho

source: Save {{ctrl.page.name}} as...
pt_br: Salve {{ctrl.page.name}} como...

source: Save {{ctrl.widget.name}} as...
pt_br: Salve {{ctrl.widget.name}} como...

source: Saved
pt_br: Salvo

source: Scope
pt_br: Escopo

source: Search
pt_br: Pesquisar

source: Search a list of cases based on search indexes
pt_br: Procurar uma lista de casos com base nos índices de busca

source: Search on name
pt_br: Pesquisar por nome

source: See <a href="https://github.com/chartjs/Chart.js/tree/v1.0.2/docs" target="_blank">chart.js</a> for details of the chart options for each type of chart. Specify a JSON structure corresponding to the options you want
pt_br: Veja <a href="https://github.com/chartjs/Chart.js/tree/v1.0.2/docs" target="_blank">chart.js</a> para detalhes das opções de gráfico para cada tipo de gráfico. Especifique uma estrutura JSON correspondente às opções desejadas

source: See example
pt_br: Ver exemplos

source: See example 'date object initialization'
pt_br: Ver exemplo 'data de inicialização do objeto'

source: See example 'functional programming'
pt_br: Ver exemplo 'programação funcional'

source: See examples
pt_br: Ver exemplos

source: See the default localization asset for an example.
pt_br: Veja o ativo de localização padrão para um exemplo.

source: Select
pt_br: Selecionar

source: Select a widget or start typing
pt_br: Selecione um widget ou comece a digitar

source: Select an element on the whiteboard, then set its properties here
pt_br: Selecione um elemento no quadro e, em seguida, defina suas propriedades aqui

source: Select an option
pt_br: Selecione uma opção

source: Select the device type icon in the top bar, then specify the width property for each widget in the page or form. Each configuration is independent. To specify the width property for a widget for all device types, set the value for each device type separately, or leave the default value.
pt_br: Selecione o ícone do tipo de dispositivo na barra superior e, em seguida, especifique a propriedade de largura de cada widget na página ou no formulário. Cada configuração é independente. Para especificar a propriedade de largura de um widget para todos os tipos de dispositivos, defina o valor para cada tipo de dispositivo separadamente, ou deixe o valor padrão.

source: Select the query to retrieve Business Object. Queries can be a simple attribute query (ex: findByName) or an additional query such as a custom query.
pt_br: Selecione a consulta para recuperar Objeto de Negócio. As consultas podem ser uma consulta de atributo simples (ex: findByName) ou uma consulta adicional, como uma consulta personalizada.

source: Select your .zip file
pt_br: Selecione seu arquivo .zip

source: Select your file
pt_br: Selecione seu arquivo

source: Select your localization.json
pt_br: Selecione o seu arquivo localization.json

source: Selected
pt_br: Selecionado

source: Selected Row
pt_br: Linha selecionada

source: Selected Value
pt_br: Valor selecionado

source: Selected values
pt_br: Valores selecionados

source: Send data to this URL when the button is clicked
pt_br: Enviar dados para esta URL quando o botão é clicado

source: Set <code>Bordered</code> property at true.
pt_br: Definir propriedad <code>Bordas</code> em sim.

source: Set labels
pt_br: Definir etiqueta

source: Set of buttons for mutually exclusive options. The user selects one option
pt_br: Conjunto de botões para opções mutuamente exclusivas. O usuário seleciona uma opção

source: Set of checkboxes for options. The user selects zero or more
pt_br: Conjunto de caixas de seleção para opções. O usuário seleciona zero ou mais

source: Set the Data source to Bonita API to populate the data table with records from a Bonita REST API.
pt_br: Defina a fonte de dados para a API Bonita para preencher a tabela de dados com registros de um API Bonita REST .

source: Set the input time on the same line as the input date
pt_br: Defina a hora de entrada na mesma linha que a data de entrada

source: Short hint that describes the expected input format for the date
pt_br: Dica curta que descreve o formato de entrada esperado para a data

source: Short hint that describes the expected input format for the time
pt_br: Dica curta que descreve o formato de entrada esperado para a hora

source: Short hint that describes the expected value
pt_br: Pequena dica que descreve o valor esperado

source: Short string or paragraph of text to be displayed. Can include HTML tags
pt_br: Texto curto ou parágrafo de texto a ser exibido. Pode incluir tags HTML

source: Should contain time zone information only when 'Handle time zone' is set to 'yes'
pt_br: Deve conter informações de fuso horário, somente quando 'Identificador de fuso horário' é definida como 'Sim'

source: Show Now button
pt_br: Mostrar botão Agora

source: Show Today button
pt_br: Mostrar botão Hoje

source: Show preview
pt_br: Mostrar sumário

source: Show properties
pt_br: Mostrar propriedades

source: Shows the languages for which there are translations in localization.json and Default, which is the source language of your page
pt_br: Mostra os idiomas para os quais há traduções em localization.json e Default, que é o idioma de origem da sua página

source: Since 7.12.0, after an artifact has been migrated, a migration report <i class="fa fa-wrench status"></i> is available from the editor header. It disappears once the page is refreshed, but can be retrieved in the UI Designer log file.
pt_br: Desde 7.12.0, após a migração de um artefato, um relatório de migração <i class="fa fa-wrench status"></i> está disponível no cabeçalho do editor. Ele desaparece quando a página é atualizada, mas pode ser recuperada no arquivo de log do UI Designer.

source: Since 7.5.0, UI Bootstrap is no longer provided in the UI Designer pages.
pt_br: Desde 7.5.0, UI Bootstrap já não constam nas páginas do UI Designer.

source: Single set charts
pt_br: Gráficos simples

source: Size
pt_br: Tamanho

source: Small devices (width ≥ 768px)
pt_br: Dispositivos pequenos (largura ≥ 768px)

source: Sort
pt_br: Ordenar

source: Sortable columns
pt_br: Colunas ordenáveis

source: Source
pt_br: Origem

source: Source Type
pt_br: Tipo de origem

source: Space-separated list
pt_br: Lista separada por espaço

source: Specifies an alternate text for an image. The text should describe the image if the image contains information or should be left empty if the image is only for decoration
pt_br: Especifica um texto alternativo para uma imagem. O texto deve descrever a imagem se a imagem contém informações ou deve ser deixada em branco se a imagem for apenas para decoração

source: Specifies the case (process instance) Id
pt_br: Especifica o ID do caso (instância de processo)

source: Specifies the legal number intervals between values
pt_br: Especifica os intervalos de números legais entre valores

source: Specifies the process name
pt_br: Especifica o nome do processo

source: Specifies the process version
pt_br: Especifica a versão do processo

source: Specifies the task instance Id
pt_br: Especifica o ID da instância da tarefa

source: Specifies the type of link to create
pt_br: Especifica o tipo de link para criar

source: Specifies where to open the linked document
pt_br: Especifica onde abrir o documento vinculado

source: Specify the number of columns of the element. All elements can take up to 12 columns.
pt_br: Especifica o número de colunas do elemento. Todos os elementos podem ter até 12 colunas.

source: Standard widgets JavaScript for edition outside the UI Designer
pt_br: JavaScript padrão widgets para edição fora do Designer de UI

source: Start a process
pt_br: Iniciar processo

source: Start creating a <b>process form</b> in Bonita Studio: from the appropriate pool or human task, create a contract and launch the UI Designer. It will auto-generate a dedicated form to edit.
pt_br: Comece a criar um <b>formulário de processo</b> em Bonita Studio: a partir do pool apropriado ou tarefa humana, crie um contrato e inicie o Designer de UI. Ele gerará automaticamente um formulário dedicado para editar.

source: Start creating an <b>application layout</b> by importing the default layout, available in the Bonita Portal resources, and edit it.
pt_br: Comece a criar um <b>layout de aplicação</b> importando o layout padrão, disponível nos recursos do Portal Bonita e editá-lo.

source: Start process
pt_br: Iniciar processo

source: Starting with version 7.7.0, the name of a UI artifact becomes its unique identifier, instead of a randomized identifier. This will make them easier to find in Bonita repositories. You may rename existing artifacts so they benefit from this change too.
pt_br: A partir da versão 7.7.0, o nome de um artefato de UI torna-se seu identificador exclusivo, em vez de um identificador aleatório. Isso os tornará mais fáceis de encontrar nos repositórios do Bonita. Você pode renomear os artefatos existentes para que eles também se beneficiem dessa mudança.

source: Static
pt_br: Estático

source: Step
pt_br: Passo

source: Store as Number value
pt_br: Armazenar como valor numero

source: Store as a Json object { header-name : HeaderValue } and can be accessed using this syntax $data.myRequestHeaders['header-name']
pt_br: Armazenar como um objeto Json { header-name : HeaderValue } e pode ser acessado usando esta sintaxe $data.myRequestHeaders['nome do cabeçalho']

source: Style
pt_br: Estilo

source: Style toolbar
pt_br: Barra de ferramentas de Estilos

source: Styling zebra-striping can be done in the theme.css file to customize <b>all</b> the tables.
pt_br: O estilo de zebra-striping pode ser feito no arquivo theme.css para personalizar <b> todas </b> as tabelas.

source: Styling zebra-striping can be done in the theme.css file to customize all data-tables.
pt_br: O estilo de zebra-striping pode ser feito no arquivo theme.css para personalizar todas as tabelas.

source: Subgroup of toolbar buttons for extra options
pt_br: Subgrupo de botões da barra de ferramentas para opções extras

source: Subgroup of toolbar buttons to arrange the text layout
pt_br: Subgrupo de botões da barra de ferramentas para organizar o layout do texto

source: Subgroup of toolbar buttons to set how the text looks
pt_br: Subgrupo de botões da barra de ferramentas para definir como o texto aparece

source: Subgroup of toolbar buttons to structure the text
pt_br: Subgrupo de botões da barra de ferramentas para estruturar o texto

source: Submit
pt_br: Enviar

source: Submit a task
pt_br: Executar a tarefa

source: Submit task
pt_br: Executar a tarefa

source: Successful import
pt_br: Importação bem sucedida

source: Successful response value
pt_br: Valor de resposta bem-sucedida

source: Summary of the Bonita REST API calls made by the page.
pt_br: Resumo das chamadas Bonita REST API feitas pela página.

source: Summary of the calls to Bonita REST API made in a page, form, or layout
pt_br: Resumo das chamadas para a Bonita API REST, feita em uma página, um formulário ou um layout

source: Switch
pt_br: Trocar

source: Switch <i class="fa fa-exchange"></i>
pt_br: Mudar <i class="fa fa-exchange"></i>

source: Switch to
pt_br: Mudar para

source: Switch widget
pt_br: Alternar widget

source: Switch {{ctrl.propertiesFrom.name}} {{ctrl.widgetFrom.$$widget.type}}
pt_br: Mudar {{ctrl.propertiesFrom.name}} {{ctrl.widgetFrom.$$widget.type}}

source: Switch...
pt_br: Trocar...

source: Tab properties usage
pt_br: Uso de propriedades de guia

source: Tab widget: Possibility to define the selected tab
pt_br: Widget de guia: Possibilidade de definir a guia selecionada

source: Table
pt_br: Tabela

source: Table with pagination and filtering capabilities
pt_br: Tabela com paginação e capacidades de filtragem

source: Tabs Container advancement
pt_br: Abas Avanço de contêiner

source: Tabs container
pt_br: Contêiner de abas

source: Tabular presentation of data from an array
pt_br: Apresentação tabular dos dados de um array

source: Target
pt_br: Destino

source: Target URL on success
pt_br: URL de destino em caso de sucesso

source: Task Id
pt_br: Id da tarefa

source: Technical Format
pt_br: Formato técnico

source: Technical date format
pt_br: Formato de data técnica

source: Technical time format
pt_br: Formato técnico da hora

source: Template
pt_br: Modelo

source: Text
pt_br: Texto

source: Text used to structure the page or form content
pt_br: Texto usado para estruturar o conteúdo da página ou do formulário

source: Text, optionally including variables in simple expressions for interpolation using [[ variableName ]]
pt_br: Texto, opcionalmente, incluindo variáveis em expressões simples para interpolação usando [[ variableName ]]

source: The .zip archive of an exported page contains:
pt_br: O arquivo .zip de uma página exportada contém:

source: The <code>Sortable columns</code> property enables to list the columns which allow a sorted search.
pt_br: A propriedade <code>Colunas ordenadas</code> permite listar as colunas que permitem uma pesquisa ordenada.

source: The <em>Close modal</em> action will close the modal container that contains the button when it is pressed.
pt_br: A ação <em>Fechar modal</em> fechará o container modal que contém o botão quando for pressionado.

source: The <em>Open modal</em> action can be used to open any modal container on the page. To point towards the right one, specify the ID in the button's "Modal ID" property.
pt_br: A ação <em>Abrir modal</em> pode ser usada para abrir qualquer container modal na página. Para apontar corretamente, especifique o ID na propriedade "ID Modal" do botão.

source: The <em>Technical date format</em> and <em>Technical time format</em> properties define the format of the values displayed in the date and time inputs. They should be valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">AngularJS date/time formats</a>.
pt_br: A <em>formato técnico data</em> e <em>formato técnico hora</em> propriedades definem o formato dos valores exibidos na entrada da data e hora. Eles devem ser válidos <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formatos de data/hora do AngularJS</a>.

source: The <em>Technical date format</em> property define the format of the values displayed in the date input. It should be a valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">AngularJS date format</a>.
pt_br: A <em>data técnica</em> a propriedade define o formato dos valores exibidos na data de entrada. Ela deve ser válida <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formato data do AngularJS</a>.

source: The <em>data sent on click</em> for POST and PUT requests must be a JavaScript Object (JSON can be used). This data will be sent in the body of the request.
pt_br: Os <em>dados enviados no clique</em> para solicitações POST e PUT devem ser um objeto JavaScript (JSON pode ser usado). Esses dados serão enviados no corpo da solicitação.

source: The Display Type property allows you to customize the tabs style ('tabs' or 'pills').
pt_br: A propriedade Tipo de Exibição permite que você personalize o estilo das abas ('abas' ou 'comprimidos').

source: The UI Designer generates <b>standard html application code, based on AngularJS</b>. Export pages if you want to further customize them in a different favorite web development environment.
pt_br: O UI Designer gera o <b>código html padrão do aplicativo, baseado em AngularJS</b>. Exporte as páginas caso queira personalizá-las no seu ambiente de desenvolvimento web preferido.

source: The UI Designer is displayed in the language of your Bonita Studio.
pt_br: O Designer de UI é exibido no idioma do seu Bonita Studio.

source: The caption will be displayed as such below the property label.
pt_br: A legenda será exibida como tal abaixo da etiqueta da propriedade.

source: The content of <em>Label</em>, <em>Technical date format</em>, <em>Placeholder</em> properties, as well as the label of button <em>Today</em> are localized by default. Localized format can be edited in the asset <em>localization.json</em>.
pt_br: O conteúdo da <em>Etiqueta</em>, <em>formatos de data técnica</em>, <em>Posicionador</em> propriedades, bem como os rótulos dos botões <em>Hoje/Agora</em> são localizados por padrão. Formatos localizados podem ser editados no arquivo <em>de localization.json</em>.

source: The content of <em>Label</em>, <em>Technical date formats</em>, <em>Placeholder</em> properties, as well as the labels of buttons <em>Today/Now</em> are localized by default. Localized formats can be edited in the asset <em>localization.json</em>.
pt_br: O conteúdo da <em>Etiqueta</em>, <em>formatos de data técnica</em>, <em>Posicionador</em> propriedades, bem como os rótulos dos botões <em>Hoje/Agora</em> são localizados por padrão. Formatos localizados podem ser editados no arquivo <em>de localization.json</em>.

source: The controller is a JavaScript function that augments the AngularJS scope and exposes functions that can be used in the widget template.
pt_br: O controlador é uma função JavaScript que aumenta o escopo AngularJS e expõe funções que podem ser usadas no modelo de widget.

source: The default application layout will retrieve the <em>Target URL on success</em> that was sent in the message and set its window location with it.
pt_br: O layout padrão da aplicação recuperará a <em>URL de destino no sucesso</em> que foi enviado na mensagem e defini sua localização de janela com ela.

source: The display of dates and times relies on the user's browser time zone. Therefore, displayed values are different from stored values (except in the GMT time zone).
pt_br: A exibição de datas e horas depende do fuso horário do navegador do usuário. Por conseguinte, os valores exibidos são diferentes dos valores armazenados (exceto na zona de tempo do GMT).

source: The following documentation applies if you need to handle the behavior on success yourself (e.g. if you build your own tasklist or any page with an iframe to display forms).
pt_br: A seguinte documentação se aplica se você precisa lidar com o comportamento no sucesso sozinho (por exemplo, se você construir sua própria lista de tarefas ou qualquer página com um iframe para exibir formulários).

source: The hex codes for the sector colors for single set charts, or for the set colors for multiple set charts. If not specified, default colors are used
pt_br: Os códigos hexadecimais para as cores do setor para gráficos simples, ou cores para os conjuntos de dados para gráficos múltiplos. Se não for especificado, as cores padrões serão usadas

source: The imported {{ ::importReport.type }} also contains new elements.
pt_br: O importado {{ ::importReport.type }} também contém novos elementos.

source: The input/output of the widget (its <em>Value</em>) is an <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> formatted String variable.
pt_br: A entrada/saída do widget (seu <em>Valor</em>) é que um <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> formatado como variável de sequência de caracteres.

source: The legend shows the sector labels for single set charts, and the set labels for multiple set charts
pt_br: A legenda mostra as etiquetas do setor para gráficos simples e as etiquetas de conjunto para gráficos múltiplos

source: The link text which is static is translated using the <em>ui-translate</em> directive. The link text title held inside the <em>properties.title</em> variable is translated using the <em>uiTranslate</em> filter.
pt_br: O texto do link que é estático é traduzido usando a diretiva <em>ui-translate</em> . O título do texto de link mantido dentro das <em>propriedades.title</em> variável é traduzido usando o filtro <em>uiTranslate</em>.

source: The list contains page assets, the assets of the widgets used in this page and assets used by base framework.
pt_br: A lista contém arquivos de página, os arquivos dos widgets usados nesta página e ativos usados pelo quadro base.
