Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: Description field on widgets
pt_br: Descrição do campo nos widgets

source: Details
pt_br: Detalhes

source: Determines target application. It is recommended not to hard code it.
pt_br: Determina a aplicação de destino. Recomenda-se não codificá-la.

source: Determines the application theme that will be used by the target page. It is recommended not to hard code it.
pt_br: Determina o tema da aplicação que será usado pela página de destino. Recomenda-se não codificá-lo.

source: Direct link to an external file
pt_br: Link direto para um arquivo externo

source: Directly from the whiteboard or from the widget properties section, switch from your current widget to another one and keep the properties already configured.
pt_br: Diretamente do quadro branco ou da seção de propriedades do widget, mude do seu widget atual para outro e mantenha as propriedades já configuradas.

source: Disabled
pt_br: Desativado

source: Discard changes
pt_br: Descartar alterações

source: Display an image from assets or from a URL
pt_br: Exibir uma imagem a partir de um ativo ou de uma URL

source: Display name
pt_br: Nome de exibição

source: Display name and description are used when the page, form, or layout are imported in the portal's Resources page. To edit them, click on the new "Tag" button.
pt_br: Nome de exibição e a descrição são usados quando a página, um formulário ou um layout são importados na página de Recursos do portal. Para editá-los, clique no novo botão "Tag".

source: Display or hide the shortcut button to current day
pt_br: Exibir ou ocultar o botão de atalho para o dia atual

source: Display or hide the shortcut button to set date and time to now
pt_br: Exibir ou ocultar o botão de atalho para definir a data e hora para agora

source: Display the document in the page or a form
pt_br: Exibir o documento na página ou um formulário

source: Display type
pt_br: Mostrar Tipo

source: Displayed key
pt_br: Chave exibida

source: Do not show me this dialog again
pt_br: Não me mostre este aviso novamente

source: Do you still want to import this {{ ::importReport.type }} now ?
pt_br: Você ainda quer importar este {{ ::importReport.type }} agora?

source: Doughnut
pt_br: Anel

source: Download asset
pt_br: Baixar ativo

source: Drag and drop a Business Object in the whiteboard or create a new variable of type Business Data.
pt_br: Arraste e solte um objeto de negócio no quadro branco ou crie uma nova variável de tipo Dados de Negócio.

source: Drag and drop widgets or containers in rows
pt_br: Arraste e solte as widgets ou contêiners nas linhas

source: Dropdown list of available values. The user selects one value
pt_br: Lista de valores disponíveis. O usuário seleciona um valor

source: Dynamic
pt_br: Dinâmico

source: Dynamic value
pt_br: Valor dinâmico

source: E.g. Given a variable <em>employee</em> of type External API that fetch the task context <code>../{{context.employee_ref.link}}</code>. To retrive all the addresses of <em>employee</em> that are lazy in the BDM, you can create another variable <em>employee_addresses</em> of type External API with an url parameter like <code>employee | lazyRef : 'addresses'</code>
pt_br: Por exemplo, dada uma variável <em>empregado</em> de API externa do tipo de API que busque o contexto de tarefa <code>../{{context.employee_ref.link}}</code>. Para recuperar todos os endereços de <em>empregado</em> que são preguiçosos no BDM, você pode criar outra variável <em>de empregador_endereços</em> de tipo API externa com um parâmetro url como <code>empregado | lazyRef : 'endereços'</code>

source: Each artifact contains a <em>localization.json</em> asset, with keys and translations for all strings and all supported languages (by default french and spanish). Each language has its section and is identified by the ISO 639 language attribute (for example, fr-FR, es-ES). To add new languages, keys and/or translations, export the default <em>localization.json</em>, edit it, and upload it with the same file name. For more information on installing new languages, go to the documentation web site (keywords:
pt_br: Cada artefato contém uma <em>localization.json</em> ativo, com chaves e traduções para todas as strings e todos os idiomas suportados (por padrão francês e espanhol). Cada idioma tem sua seção e é identificado pelo atributo de linguagem ISO 639 (por exemplo, fr-FR, es-ES). Para adicionar novos idiomas, chaves e/ou traduções, exporte o padrão <em>localization.json</em>, edite-o e faça o upload pelo mesmo nome de arquivo. Para mais informações sobre como instalar novos idiomas, acesse o site da documentação (palavras-chave:

source: Each element of this property has to match an element of the Columns key property to figure out which table column can be sorted upon.
pt_br: Cada elemento dessa propriedade deve corresponder a um elemento da propriedade da chave Colunas para descobrir em que coluna da tabela pode ser classificada.

source: Each type or container has specific behaviors
pt_br: Cada tipo ou container tem comportamentos específicos

source: Easily create forms to edit business variables or documents, or display business variables in read-only
pt_br: Crie formulários de forma fácil para editar variáveis de negócios ou documentos, ou exiba variáveis de negócios em somente leitura

source: Edit
pt_br: Editar

source: Edit asset
pt_br: Editar ativo

source: Edit property
pt_br: Editar a propriedade

source: Edit the display name and display description of a page, form, or layout from the Editor
pt_br: Editar o nome de exibição e exibir a descrição de uma página, formulário ou um layout do Editor

source: Edit variable
pt_br: Editar variável

source: Edit...
pt_br: Editar...

source: Editor organization
pt_br: Organização do editor

source: Either select the widget to switch and click on <i class="fa fa-exchange"></i>.
pt_br: Selecione o widget para alternar e clique em <i class="fa fa-exchange"></i>.

source: Enhancements on table and data table
pt_br: Aprimoramentos na tabela e nos dados da tabela

source: Enter ' + vm.mode + ' name
pt_br: Digite ' + mode + ' nome

source: Enter a date (mm/dd/yyyy)
pt_br: Insira uma data (dd/mm/yyyy)

source: Enter a time (h:mm:ss a)
pt_br: Digite uma hora (h:mm:ss a)

source: Error at line <code>{{ infos.location.line }}</code>, column <code>{{ infos.location.column }}</code>
pt_br: Erro na linha <code>{{ infos.location.line }}</code>, coluna <code>{{ infos.location.column }}</code>

source: Error during migration of . Check migration details <i class="fa fa-wrench status"></i> for more details.
pt_br: Erro durante a migração de . Verifique os detalhes da migração <i class="fa fa-wrench status"></i> para mais detalhes.

source: Error on upload holder
pt_br: Erro no upload do titular

source: Example of a tab title displaying a badge:
pt_br: Exemplo de um título de aba exibindo uma medalha:

source: Example of border table:
pt_br: Exemplo de borda de tabela:

source: Example: relative time filter
pt_br: Exemplo: filtro de tempo relativo

source: Expand Preview in new window
pt_br: Expandir visualização em nova janela

source: Expendable text input field with HTML formatting, including style, image, links... This widget is based on textAngular.
pt_br: Campo de entrada de texto disponível com formatação HTML, incluindo estilo, imagem, links... Este widget é baseado em textAngular.

source: Explore Data Model in new window
pt_br: Explorar Modelo de Dados em uma nova janela

source: Export
pt_br: Exportar

source: Export {{ctrl.page.name}}
pt_br: Exportar {{ctrl.page.name}}

source: Exported formats
pt_br: Formato exportado

source: Expose fragment data to page?
pt_br: Expor dados do fragmento à página?

source: Exposed
pt_br: Expostos

source: Extend Bonita standard widgets to fulfill the specific needs of your project, using the menu option <b>View</b> in the Properties panel of every standard widget. From there, save as your custom widget and implement the extension you need.
pt_br: Estenda os widgets padrões Bonita para atender às necessidades específicas do seu projeto, usando a opção de menu <b>Visualizar</b> no painel de propriedades de cada widget padrão. A partir daí, salve como seu widget personalizado e implemente a extensão que você precisa.

source: External
pt_br: Externo

source: External API
pt_br: API externa

source: External API (variable) or URL
pt_br: API externa (variável) ou URL

source: Extra Small devices (width < 768px)
pt_br: Dispositivos pequenos (largura ≥ 768px)

source: Extra angular modules needed by this custom widget (comma separated)
pt_br: Módulos AngularJS extras, necessários por esta widget (separados por vírgula)

source: Failed response value
pt_br: Valor de resposta falhou

source: Favorites
pt_br: Favoritos

source: Field where the user can enter information
pt_br: Campo onde o usuário pode inserir informações

source: File
pt_br: Arquivo

source: File chooser for uploading a document to a form
pt_br: Seletor de arquivos para carregar um documento para um formulário

source: File source
pt_br: Arquivo origem

source: File unavailable
pt_br: Arquivo indisponível

source: FileName
pt_br: Nome do arquivo

source: Filter
pt_br: Filtro

source: Filters
pt_br: Filtro

source: First
pt_br: Primeiro

source: For 'Label' property only. If you choose 'no', HTML code will be escaped instead of being interpreted. If you choose ‘Yes’, this could potentially lead to HTML injections attacks. Please take into account these risks.
pt_br: Apenas para a propriedade 'Etiqueta'. Se você escolher 'não', o código HTML será escapado em vez de ser interpretado. Se você escolher “Sim”, isso pode potencialmente levar a ataques de injeções HTML. Por favor, leve em conta esses riscos.

source: For <em>Start process</em> and <em>Submit task</em> actions the format of the data must meet the process/task contract specifications.
pt_br: Para <em>Iniciar processo</em> e <em>Enviar tarefa</em> ações que o formato dos dados deve preencher as especificações do contrato de processo/tarefa.

source: For HTTP requests and Start process / Submit task actions, you can store the response of the request in a variable using the properties:
pt_br: Para solicitações HTTP e Iniciar processo / Enviar tarefas, você pode armazenar a resposta do pedido em uma variável usando as propriedades:

source: For HTTP requests, the following methods are supported:
pt_br: Para solicitações HTTP, os seguintes métodos são suportados:

source: For Instance to let users save the draft of the current form:
pt_br: Por exemplo, para permitir que os usuários salvem o rascunho do formulário atual:

source: For an error response, the message value is 'error' and the property <em>dataFromSuccess</em> is replaced by a property <em>dataFromError</em>
pt_br: Para uma resposta de erro, o valor da mensagem é 'erro' e a propriedade <em>dataFromSuccess</em> é substituída por uma propriedade <em>dataFromError</em>

source: For an example of JavaScript code to handle the message, you can have a look at the asset <em>layout.js</em> in the default application layout (you can retrieve it in the resources section of Bonita Portal Administrator profile).
pt_br: Por exemplo de código JavaScript para lidar com a mensagem, você pode olhar para o ativo <em>layout.js</em> no layout padrão da aplicação (você pode recuperá-lo na seção de recursos do perfil Administrador do Portal Bonita).

source: For business objects, the UI Designer comes with a <em>lazyRef</em> filter to easily retrieve target url to use in an external API data.
pt_br: Para objetos de negócios, o Designer de UI vem com um filtro <em>lazyRef</em> para recuperar facilmente a url de destino para usar em dados de API externa.

source: For date format specifically, the UI Designer comes with a <em>uiDate</em> filter to easily display dates retrieved from the BDM or any other REST API.
pt_br: Para o formato da data, especificamente, o Designer de UI vem com um filtro <em>uiDate</em> para exibir facilmente as datas recuperadas do BDM ou qualquer outra API REST.

source: For example #FF0000, #0066FF
pt_br: Por exemplo, #FF0000, #0066FF

source: For instance, with a custom link widget :
pt_br: Por exemplo, com um widget de link personalizado:

source: For more information, consult the <a href="https://documentation.bonitasoft.com/?page=live-update#cache_busting">documentation</a>.
pt_br: Para mais informações, consulte a <a href="https://documentation.bonitasoft.com/?page=live-update#cache_busting">documentação</a>.

source: For more information, consult the official UI Designer overview documentation.
pt_br: Para obter mais informações, consulte a documentação de visão geral do Designer de UI oficial.

source: For more information, refer to the <a href="javascript:void(0);" open-help="localization" editor-mode="page"><em>localization</em> help section</a>.
pt_br: Para mais informações, consulte a <a href="javascript:void(0);" open-help="localization" editor-mode="page"><em>localização</em> seção ajuda</a>.

source: For more information, see the AngularJS guide on <a href="https://docs.angularjs.org/guide/templates">templates</a> and <a href="https://docs.angularjs.org/guide/controller">controllers</a>.
pt_br: Para obter mais informações, consulte o guia AngularJS em <a href="https://docs.angularjs.org/guide/templates">templates</a> e <a href="https://docs.angularjs.org/guide/controller">controllers</a>.

source: For new artifacts, you need to add the asset yourself in the custom widgets or pages that require it.
pt_br: Para novos artefatos, você precisa adicionar o recurso você mesmo nos widgets personalizados ou nas páginas que o exigem.

source: For the moment, you cannot implement custom widget containers.
pt_br: Por enquanto, você não pode implementar contêineres de widget personalizados.

source: Format
pt_br: Formatar

source: Format used to display the date
pt_br: Formato usado para exibir a data

source: Format used to display the time
pt_br: Formato usado para exibir a hora

source: Formatting toolbar
pt_br: Formatando barra de ferramentas

source: Forms
pt_br: Formulários

source: Four device types are available:
pt_br: Há quatro tipos de dispositivos disponíveis:

source: Fragment
pt_br: Fragmentos

source: Fragment data '' + name + '' will be bound to page data '' + binding + '', and thus not have it default value '' + data.value + ''
pt_br: Dados de fragmentos '' + name + '' serão associados aos dados da página '' + binding + '', e, portanto, não tem o valor padrão '' + dados. alue + ''

source: Fragment data '' + name + '' will keep its default value '' + data.value + ''
pt_br: Dados de fragmentos '' + name + '' manterão seus valores padrões '' + data.value + ''

source: Fragment name
pt_br: Nome do fragmento

source: Fragments
pt_br: Fragmentos

source: Frame
pt_br: Quadro

source: From the page or form editors, right by the "Save" button, a click on the arrow displays a new option "Convert to...". It has also been added in the "Save as" option to, for example, save a form as a case overview page.
pt_br: Do editor de página ou formulário, bem pelo botão a direita "Save", um clique na seta exibe uma nova opção "Converter para...". Ele também foi adicionado na opção "Salvar como", por exemplo, salvar um formulário como uma página de resumo do caso.

source: Functions exposed in the controller can be used with ctrl.newFunction().
pt_br: Funções expostas no controlador podem ser usadas com ctrl.newFunction().

source: General
pt_br: Geral

source: Get a case by its identifier
pt_br: Obter um caso pelo seu identificador

source: Get a human task by its identifier
pt_br: Obter uma tarefa humana pelo seu identificador

source: Get all business variables defined in a case
pt_br: Obter todas as variáveis de negócios definidas em um caso

source: Get all the advanced features such as fragments and localization in the community edition.
pt_br: Obtenha todos os recursos avançados, como fragmentos e localização na edição da comunidade.

source: Get current logged user
pt_br: Obter o usuário atualmente conectado

source: Get custom information of a user
pt_br: Obter informações personalizadas de um usuário

source: Get professional details of a user
pt_br: Obter detalhes profissionais de um usuário

source: Go full screen
pt_br: Tela cheia

source: Graphical display of numerical data to ease understanding. This widget is based on angular-chart-0.8.1, which is based on Chart.js. For information see http://jtblin.github.io/angular-chart.js/ and http://www.chartjs.org/docs/. Available chart types to display a single set of data are pie, doughnut, and polar area. For multiple sets of data, available chart types are bar, line, and radar.
pt_br: Exibição gráfica de dados numéricos para facilitar a compreensão. Esta widget é baseada em angular-chart-0.8.1, que é baseada em Chart.js. Para obter informações, consulte http://jtblin.github.io/angular-chart. s/ e http://www.chartjs.org/docs/. Tipos de gráficos disponíveis para exibir um conjunto único de dados são torta, avelã e área polar. Para vários conjuntos de dados, tipos de gráficos disponíveis são barra, linha e radar.

source: Group of widgets used to define the arrangement of the page elements. Its content can be repeated over an array
pt_br: Grupo de widgets usado para definir a disposição dos elementos da página. Seu conteúdo pode ser repetido através de um array

source: Group of widgets used to define the arrangement of the page elements. Its content is display like in modal.
pt_br: Grupo de widgets usado para definir a disposição dos elementos da página. Seu conteúdo é exibido como no modal.

source: Group of widgets, inside a Tabs container
pt_br: Grupo de widgets, dentro de um contêiner Tabs

source: HTTP request
pt_br: Solicitação HTTP

source: HTTP status code
pt_br: Código de Estado HTTP

source: Handle time zone
pt_br: Fuso horário do momento

source: Headers
pt_br: Cabeçalhos

source: Help
pt_br: Ajuda

source: Help data model
pt_br: Ajuda a Modelo de dados

source: Here is the format of the message posted to the parent frame in JSON (in the parent frame you will need to call <code>JSON.parse</code> as it is stringified before being sent):
pt_br: Aqui está o formato da mensagem postada no quadro pai em JSON (no quadro pai você precisará chamar <code>JSON.parse</code> como está censurado antes de ser enviado):

source: Hidden
pt_br: Ocultos

source: Holds the HTTP status code of the response
pt_br: Mantêm o código de status HTTP da resposta

source: Holds the response content from the upload error endpoint. That value can be used to guidance purpose
pt_br: Mantém o conteúdo da resposta do ponto de extremidade de erro de upload. Esse valor pode ser usado para orientar a finalidade

source: Holds the response from the upload endpoint. That value can be used to fulfill a contract
pt_br: Captura a resposta do carregamento de endpoint. Esse valor pode ser usado para preencher um contrato

source: Holds the response when the request has failed
pt_br: Captura a resposta quando a requisição falhar

source: Holds the response when the request is successful
pt_br: Captura a resposta quando a requisição for bem sucedida

source: Home page
pt_br: Página principal

source: How to customize Zebra-striping
pt_br: Como personalizar Zebra-striping

source: How to customize border
pt_br: Como personalizar a borda

source: However, <b>the output of the widget is always a Javascript Date object</b>. So it will change the type of the variable bound to the widget <em>Value</em> to a Date object when the user selects a date. This is required in order to ensure backward compatibility for pages designed with older UI Designer versions.
pt_br: No entanto, <b>a saída do widget é sempre um obejto de Data Javascript</b>. Então vai mudar o tipo da variável vinculado ao widget <em>Valor</em> para um objeto de data, quando o usuário seleciona uma data. Isso é necessário para garantir a compatibilidade com versões anteriores para páginas desenhadas com versões mais antigas do UI Designer.

source: However, such a redirection of the current window (frame) won't be performed in Bonita portal nor in an application iframe with id <em>bonitaframe</em> (as in the default application layout). This is due to the fact that Bonita Portal and the default application layout handle the successful response by themselves.
pt_br: No entanto, um redirecionamento da janela atual (frame) não será realizado no portal Bonita nem em um iframe de aplicação com id <em>bonitaframe</em> (como no layout padrão da aplicação). Isso deve-se ao fato de que o Portal Bonita e o layout padrão da aplicação manipulam por si mesmo a resposta bem sucedida.

source: Human task form
pt_br: Formulário de tarefa humana

source: Id must be unique, so the {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> will be overwritten.
pt_br: Id deve ser único, então o {{ ::importReport.overwrittenType }} <strong>{{ ::importReport.overwrittenName }}</strong> será substituído.

source: Id must be unique, so those elements will be overwritten.
pt_br: Id deve ser único, para que esses elementos sejam substituídos.

source: Identifier
pt_br: Identificador

source: If a Business Object has been dropped, a user interface is generated for you. You can either keep it as is, modify it, or remove it if it does not fit your needs.
pt_br: Se um objeto de negócio foi eliminado, uma interface de usuário é gerada para você. Você pode manter como está, modificá-lo ou removê-lo se não atender às suas necessidades.

source: If checked, this popup will not be displayed again unless you clean up your browser cache
pt_br: Se marcado, este popup não será exibido novamente a menos que você limpe o cache do seu navegador

source: If the page is displayed inside an iframe, a JavaScript postMessage will be sent to the <b>parent</b> frame with the status of the response and the properties values of the button widget. Bonita portal, tasklist or the default application layout handle this message differently:
pt_br: Se a página for exibida dentro de um iframe, um postMessage JavaScript será enviado para o quadro <b>pai</b> com o status da resposta e os valores das propriedades do widget do botão. O portal Bonita, Lista de Tarefas ou o layout padrão da aplicação manipula esta mensagem de forma diferente:

source: If the standard widget does not meet your needs, you can create a custom widget to match exactly what you want to. To do this, clone the standard widget by saving it with a different name, and modify it. After creation, the custom widget is available in the palette for designing pages, forms, layouts or fragments.
pt_br: Se o widget padrão não responder às suas necessidades, você pode criar um widget personalizado para combinar exatamente o que você deseja. Para fazer isso, clone o widget padrão, salvando-o com um nome diferente e modificá-lo. Após a criação, o widget personalizado está disponível na paleta para desenhar páginas, formulários, layouts ou fragmentos.

source: If you choose 'no', HTML code will be escaped instead of being interpreted in row's cells. If you choose ‘Yes’, this could potentially lead to HTML injections attacks. Please take into account these risks.
pt_br: Se você escolher 'não', o código HTML será escapado em vez de ser interpretado nas células da linha. Se você escolher “Sim”, isso pode potencialmente levar a ataques de injeções HTML. Por favor, leve em conta esses riscos.
