Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: Use $collection to act on the collection of a repeated content
pt_br: Use $collection para agir na coleção de conteúdos repetidos

source: Use $item to remove the current item in a repeated collection
pt_br: Use $item para remover o item atual de uma coleção repetida

source: Use <a href="javascript:void(0);" open-help="filters" editor-mode="page">Filters</a> to format the data (e.g. <span ng-non-bindable>columnKey|uiDate</span>)
pt_br: Use <a href="javascript:void(0);" open-help="filters" editor-mode="page">Filtros</a> para formatar os dados (ex. <span ng-non-bindable>colunas/columnKey|Data</span>)

source: Use <b>widgets</b> from the palette on the left to <b>display information to</b> and <b>gather information from</b> the end users.
pt_br: Use <b>widgets</b> da paleta do lado esquerdo para <b>exibir informações para</b> e <b>coletar informações dos</b> usuários finais.

source: Use <span ng-non-bindable>{{dataVariable}}</span> to access data, and <a href="javascript:void(0);" open-help="filters" editor-mode="page">filters</a> to format it (e.g. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)
pt_br: Use <span ng-non-bindable>{{dataVariable}}</span> para acessar os dados e <a href="javascript:void(0);" open-help="filters" editor-mode="page">filtros</a> para formatá-lo (ex.: <span ng-non-bindable>{{dateVariable|uiDate}}</span>)

source: Use a Business Object
pt_br: Use um objeto de negócio

source: Use a bidirectional field to specify a read-write binding between the property value and a variable.
pt_br: Use um campo bidirecional para especificar uma ligação de leitura e escrita entre o valor da propriedade e uma variável.

source: Use a dynamic value field to specify a constant (the default) or an expression. Click the expression icon fx to switch from constant to expression. Click the constant icon X to switch from expression to constant. An expression can include a variable to make the property value dynamic, or can simply be the name of a variable. You can apply a filter to a variable value using a pipe. The binding to the variable is a read. If you want to write to the variable, use a bidirectional bond. Examples:
pt_br: Use um campo de valor dinâmico para especificar uma constante (o padrão) ou uma expressão. Clique no ícone de expressão fx para alternar de constante para expressão. Clique no ícone X da constante para alternar de expressão para constante. Uma expressão pode incluir uma variável para tornar o valor da propriedade dinâmico, ou pode ser simplesmente o nome de uma variável. Você pode aplicar um filtro a um valor de variável usando um tubo. A ligação à variável é uma leitura. Se você deseja escrever na variável, use uma ligação bidirecional. Exemplos:

source: Use an interpolation field to enter text to display in the widget. The text can include variables that are interpreted using AngularJS interpolation. When the page is displayed, the variables are replaced by the interpolated values. Specify a variable as a simple expression enclosed in double braces, using the same format as for a dynamic value field. Example: I'm sorry, <em ng-non-bindable>{{ user.name | uppercase }}</em>. I'm afraid I can't do that.
pt_br: Use um campo de interpolação para digitar o texto a ser exibido na widget. O texto pode incluir variáveis que são interpretadas usando interpolação AngularJS. Quando a página é exibida, as variáveis são substituídas pelos valores interpolados. Especifique uma variável como uma simples expressão entre chaves duplas, usando o mesmo formato de um campo de valor dinâmico. Exemplo: Desculpe, <em ng-non-bindable>{{ user.name | uppercase }}</em>. Acho que não posso fazer isso.

source: Use basic html tags (if allowed), <span ng-non-bindable>{{dataVariable}}</span> to access data, and <a href="javascript:void(0);" open-help="filters" editor-mode="page">filters</a> to format it (e.g. <span ng-non-bindable>{{dateVariable|uiDate}}</span>)
pt_br: Use tags html básicas (se permitidas), <span ng-non-bindable>{{dataVariable}}</span> para acessar os dados, e <a href="javascript:void(0);" open-help="filters" editor-mode="page">filtros</a> para formatar (ex.: <span ng-non-bindable>{{dateVariable|uiDate}}</span>)

source: Use provided UID widgets as a template for a custom widget
pt_br: Usar widgets UID fornecidos como um modelo para um widget personalizado

source: Use the <em>ui-translate</em> directive in custom widgets for static content to be translated
pt_br: Use a diretiva <em>ui-translate</em> em widgets personalizados para o conteúdo estático a ser traduzido

source: Use the <em>uiTranslate</em> filter in custom widgets for dynamic content to be translated
pt_br: Use o filtro <em>uiTranslate</em> em widgets personalizados para conteúdo dinâmico a ser traduzido

source: Use the UI Designer to create or edit web artifacts: <b>application pages</b> composing business applications, <b>process forms</b> linked to process instantiation or human tasks execution, as well as <b>application layouts</b>, applied to all pages of a business application.
pt_br: Use o UI Designer para criar ou editar artefatos web: <b>páginas de aplicação</b> compor aplicações de negócio, <b>formulários des processo</b> ligado a instanciação do processo ou execução de tarefas humanas, bem como <b>layouts de aplicação</b>, aplicado a todas as páginas de um aplicação de negócios.

source: Use the characters: H (hour), h (hour in AM/PM), m (minutes) and optionally s (seconds), a (AM/PM)
pt_br: Use os caracteres: H (hora), h (hora em AM/PM), m (minutos) e opcionalmente (segundos), um (AM/PM)

source: Use the characters: M (month), d (day), y (year)
pt_br: Use os caracteres: M (mês), d (dia), y (ano)

source: Use the generated user interface
pt_br: Usar a interface de usuário gerada

source: Use the palette on the left to drag and drop containers and widgets in the whiteboard.
pt_br: Utilize a paleta do lado esquerdo para arrastar e soltar contêineres e widgets no quadro.

source: Use this container to create a pop-in window which can be opened or closed with a button, and displayed over the page, form, or layout content.
pt_br: Use este contêiner para criar uma janela pop-in que pode ser aberta ou fechada com um botão, e exibida na página, formulário ou conteúdo de layout.

source: Use this widget to select a date (e.g., a date of birth).
pt_br: Utilize este widget para selecionar uma data (por exemplo, uma data de nascimento).

source: Use this widget to select a date and a time (e.g., to schedule a meeting).
pt_br: Use este widget para selecionar uma data e uma hora (por exemplo, para agendar uma reunião).

source: Use this widget to:
pt_br: Use este widget para:

source: Use your Business data
pt_br: Use seus dados de negócio

source: Used in the portal list of Resources. Part of the page.properties descriptor in the exported page archive.
pt_br: Usado na lista de recursos do portal. Parte do descritor de página.properties no arquivo de página exportado.

source: Used in the portal list of Resources. Part of the page.properties descriptor in the exported page archive. If empty, page technical name is used as fallback.
pt_br: Usado na lista de recursos do portal. Parte do descritor de página.properties no arquivo de página exportada. Se vazio, o nome técnico da página é usado como fallback.

source: User id could then be obtained by using {{myData.user_id}}
pt_br: O ID do usuário pode ser obtido usando {{myData.user_id}}

source: Using the Vertical Display property, it is possible to display tabs vertically or horizontally.
pt_br: Usando a propriedade Display Vertical, é possível exibir guias verticalmente ou horizontalmente.

source: Validation Errors
pt_br: Erro de Validação

source: Validation error on the page. Fix is recommended before export
pt_br: Erro de validação na página. Corrigir é recomendado antes da exportação

source: Validation error. Fix is recommended before export
pt_br: Erro de validação na página. Corrigir é recomendado antes da exportação

source: Value
pt_br: Valor

source: Value Format
pt_br: Formato de valor

source: Value max length
pt_br: Comprimento máximo do valor

source: Value min length
pt_br: Comprimento mínimo do valor

source: Value must be unique
pt_br: O valor deve ser único

source: Value to add
pt_br: Valor a ser adicionado

source: Variable
pt_br: Variável

source: Variable content formatted in HTML
pt_br: Conteúdo variável formatado em HTML

source: Variable for frontend paging and ordering or Bonita REST API URL for backend paging and ordering
pt_br: Variável para página de frontend e ordenação ou URL da API Bonita REST para página de backend e ordenar

source: Variable in read-write binding with the property value
pt_br: Variável com ligação do tipo leitura e escrita com o valor da propriedade

source: Variable name
pt_br: Nome da variável

source: Variable names must start with a letter and contain only alphanumeric characters
pt_br: Os nomes de variáveis devem começar com uma letra e conter apenas caracteres alfanuméricos

source: Variable of type array
pt_br: Variável do tipo matriz

source: Variables
pt_br: Variáveis

source: Vertical display
pt_br: Exibição vertical

source: View
pt_br: Visualização

source: View asset content
pt_br: Ver o conteúdo dos assets

source: View in application <i class="fa fa-info-circle ng-scope" uib-tooltip="{{'In case your application is not available, please log in using a different account' | translate}}" tooltip-placement="bottom" tooltip-append-to-body="true"></i>
pt_br: Visualizar na aplicação <i class="fa fa-info-circle ng-scope" uib-tooltip="{{'In case your application is not available, please log in using a different account' | translate}}" tooltip-placement="bottom" tooltip-append-to-body="true"></i>

source: View...
pt_br: Visualização...

source: Visualize and explore your Business Data Model (BDM) in your browser. In a few clicks, generate user interfaces from the BDM, using the master/details pattern.
pt_br: Visualize e explore seu Modelo de Dados de Negócio (BDM) em seu navegador. Em alguns cliques, gere interfaces de usuário a partir do BDM, usando o padrão master/details do padrão.

source: W3C website
pt_br: Site do W3C

source: When 'Content' is a list of objects, specifies the attributes to display in the table columns. These keys must not be a number, or start with a number
pt_br: Quando 'Conteúdo' é uma lista de objetos, especifica os atributos a exibir nas colunas da tabela. Essas chaves não devem ser um número, ou começar com números

source: When possible, properties of the target widget are mapped with similar properties of the source widget. You can edit that and map more.
pt_br: Quando possível, propriedades do widget alvo são mapeadas com propriedades semelhantes do widget de origem. Você pode editar isso e mapear mais.

source: When sent in the JSON body of a request, it is serialized into an ISO 8601 formatted String variable with the time set to midnight UTC (e.g., 2016-12-31T00:00:00.000Z).
pt_br: Quando enviada no corpo de uma solicitação JSON, ele é serializado em uma variável de sequência de caracteres ISO 8601 formatado com o tempo definido para meia-noite UTC (por exemplo, 2016-12-31T00:00:00.000Z).

source: When the switch is completed, chances are you will still have properties to fill out, in the properties panel.
pt_br: Quando a mudança for concluída, as chances ainda terão propriedades para preencher, no painel de propriedades.

source: When the table is displayed, each time the user updates the filter, the table display is updated accordingly. The filter is applied to the table rows that are currently displayed.
pt_br: Quando a tabela é exibida, cada vez que o usuário atualiza o filtro, a exibição da tabela é atualizada em conformidade. O filtro é aplicado às linhas da tabela que estão sendo exibidas atualmente.

source: When you delete a row, the following rows move up
pt_br: Quando uma linha é excluída, as linhas seguintes são movidas para cima

source: Whenever this form is reloaded, either by hitting F5 or browsing away and back again, the entry will be reloaded automatically from LocalStorage.
pt_br: Sempre que este formulário for recarregado, seja selecionando o F5 ou navegando para longe e retornando novamente, a entrada será recarregada automaticamente do LocalStorage.

source: Where businessDataType = com.company.model.MyData, queryName = name of the BDM query, filter = "myParam=myValue"
pt_br: Onde businessDataType = com.company.model.MyData, queryName = nome da consulta BDM, filter = "myParam=myValue"

source: Where businessVariableName is the name of the business variable defined at pool level.
pt_br: Onde businessVariableName é o nome da variável de negócio definida no nível de pool.

source: Widget description
pt_br: Descrição da widget

source: Widget implementation is based on the AngularJS framework.
pt_br: A implementação do widget é baseada no quadro AngularJS.

source: Widget properties defined on the right can be used as variables in a controller with $scope.properties.
pt_br: Propriedades do widget definidas corretas podem ser usadas como variáveis em um controlador com $scope.properties.

source: Widget properties defined on the right can be used as variables in a template with properties.newProperty.
pt_br: Propriedades do widget definidas corretas podem ser usadas como variáveis em um modelo com propriedades.novasPropriedades.

source: Widgets use the l10n mechanism that loads the translated string during page start up.
pt_br: Os widgets usam o mecanismo l10n que carrega a string traduzida durante a inicialização da página.

source: Width
pt_br: Largura

source: Will be retrieved from the URL if not set ('app' parameter). You can pass it in the query string of the preview URL for tests.
pt_br: Será recuperado da URL se não definido o (parâmetro 'app'). Você pode passá-lo na string de consulta da URL de pré-visualização para testes.

source: With the newer way to store variables and widgets, the diff and merge operations are clearer thanks to a multiline storage.
pt_br: Com a maneira mais recente de armazenar variáveis e widgets, as operações de diff e merge são mais claras graças a um armazenamento multilíngue.

source: With this widget, you can display data from an array in tabular presentation.
pt_br: Com este widget, você pode exibir dados de uma matriz na apresentação tabular.

source: Within a row, when you delete a widget or a container, the following elements move to the left
pt_br: Dentro de uma linha, quando você exclui uma widget ou um container, os elementos seguintes são movidos para a esquerda

source: Yes
pt_br: Sim

source: Yes. You must bind this variable to a variable in the page, form, layout or fragment using this fragment.
pt_br: Sim. Você deve vincular essa variável a uma variável na página, no formulário, no layout ou no fragmento.

source: You can also create custom widgets, from existing widgets by "saving as" or from scratch in the home page.
pt_br: Você também pode criar widgets personalizados dos widgets existentes por "salvando como" ou do zero na página inicial.

source: You can apply it to the following variable value types:
pt_br: Você pode aplicá-lo para os seguintes tipos de valores a variável:

source: You can change the type to be able to use this artifact as a process form or as an application page.
pt_br: Você pode alterar o tipo para poder usar este artefato como um formulário de processo ou como uma página do aplicativo.

source: You can delete page assets only, view local assets, and edit external assets of a page.
pt_br: Você pode excluir apenas arquivos de página, ver arquivos locais e editar arquivos externos de uma página.

source: You can explore the data model (with a graphical view) using the graph icon in the header of this panel. It shows the relationships between business objects, and their attributes.
pt_br: Você pode explorar o modelo de dados (com uma visualização gráfica) usando o ícone do gráfico no cabeçalho deste painel. Mostra as relações entre objetos comerciais e os seus atributos.

source: You can extend our REST API capabilities by creating REST API extensions in the Studio and use them here.
pt_br: Você pode estender nossos recursos da API REST criando extensões da API REST no Studio e usá-las aqui.

source: You can extend our REST API capacities by creating <em>REST API extensions</em> in the Studio <i>Development</i> menu and use them as External API variables in the UI Designer.
pt_br: Você pode estender nossas capacidades de API REST criando <em>Extensões de API REST</em> no menu <i>Desenvolvimento</i> do Studio e usá-las como variáveis da API Externa no UI Designer.

source: You can format data with filters when data is used in widget property fields that allow interpolation <i class="fa fa-paragraph"></i> or that are bound to a variable <i class="fa fa-link"></i> .
pt_br: Você pode formatar dados com filtros quando os dados são usados em campos de propriedade de widget que permitem interpolação <i class="fa fa-paragraph"></i> ou que estão vinculados a uma variável <i class="fa fa-link"></i> .

source: You can group widgets into a container to define the arrangement of widgets in a form or a page. A container can contain other containers.
pt_br: É possível agrupar widgets em um contêiner para definir a disposição dos widgets em um formulário ou página. Um contêiner pode conter outros contêineres.

source: You can only edit the query filters and pagination.
pt_br: Você só pode editar os filtros de consulta e paginação.

source: You can optimize the UI designer responsiveness behavior for various screen sizes by configuring a different value for the <em>width</em> property for each device type. This uses the Bootstrap CSS grid mechanism.
pt_br: É possível otimizar o comportamento de resposta do UI Designer para vários tamanhos de telas configurando um valor diferente para a propriedade <em>de largura</em> de cada tipo de dispositivo. Isto usa o mecanismo da grade de CSS Bootstrap.

source: You can provide a filter for users to update the displayed table to show only the rows that match the filter. To do this :
pt_br: Você pode fornecer um filtro para que os usuários atualizem a tabela exibida para mostrar apenas as linhas que correspondem ao filtro. Para fazer isso:

source: You can retrieve the Status Code or Response Headers with a usual variable binding and use it in the artifact.
pt_br: Você pode recuperar o Código de Status ou Cabeçalhos de Resposta com uma variável comum de ligação e usá-lo no artefato.

source: You can save the content of a plain container as a reusable fragment.
pt_br: É possível salvar o conteúdo de um contêiner simples como um fragmento reutilizável.

source: You can translate all the text displayed on a UI artifact: labels, placeholders, available values of a list. Even the Date format of the Date Picker widget can be localized.
pt_br: Você pode traduzir todo o texto exibido em um artefato de UI: etiquetas, espaços reservados, valores disponíveis de uma lista. Mesmo o formato de Data do widget Selecionador de Data pode ser localizado.

source: You can use Business data type to get a business data object.
pt_br: Você pode usar o tipo de dados de negócio para obter um objeto de dados de negócio.

source: You can use Pagination section to define the number of elements you want by page (by default 10 elements) and the page number (by default first page - index 0). For example, you can bind a variable to get dynamic pagination: {{paginationVariable.pageNumber}}.
pt_br: Você pode usar a seção Paginação para definir o número de elementos que você deseja por página (por padrão 10 elementos) e o número da página (por padrão primeira página - índice 0). Por exemplo, você pode vincular uma variável para obter uma página dinâmica: {{paginationVariable.pageNumber}}.

source: You can use data in the URL with the <i><em ng-non-bindable>{{dataName}}</em></i> syntax.
pt_br: Você pode usar dados no URL com a sintaxe <i><em ng-non-bindable>{{dataName}}</em></i>.

source: You can use standard HTML tags and AngularJS built-in directives, scope and interpolation system.
pt_br: Você pode usar tags HTML padrão e diretivas do AngularJS, sistema de escopo e interpolação.

source: You can use the <code>API request parameters</code> property to pass additional parameters to the request. Supported parameters are described in the REST API Overview documentation page and in the REST API documentation for the relevant resources.
pt_br: Você pode usar os <code>parâmetros de solicitação de API</code> propriedade para passar parâmetros adicionais para a solicitação . Os parâmetros suportados são descritos na página da documentação da documentação da API REST e na documentação da API REST para os recursos relevantes.

source: You can use the <i>environment</i> property injected in the scope when inside the whiteboard editor. It allows to create a mockup display for the whiteboard as the real use data will not be available.
pt_br: Você pode usar a propriedade <i>environment</i> injetada no escopo quando dentro do editor do quadro. Ele permite criar um display de mockup para o quadro branco, pois dados de uso real não estarão disponíveis.

source: You cannot have more than one localization asset. When you upload a new asset file, it overwrites the existing one.
pt_br: Não é possível ter mais de um asset de localização. Ao carregar um novo arquivo de asset, ele sobrescreve o existente.

source: You cannot import or use this artifact in older version anymore.
pt_br: Você não pode importar ou usar este artefato na versão mais antiga.

source: You cannot move, delete or disable <b>Base framework</b> assets. They are here only to show you which library is used to build your artifact
pt_br: Você não pode mover, excluir ou desativar <b>Base framework</b> ativos. Eles estão aqui apenas para mostrar qual biblioteca é usada para construir seu artefato

source: You do not need to specify paging parameters (such as ?p=0&c=10), because the data table handles paging automatically when you use a Bonita API data source.
pt_br: Você não precisa especificar parâmetros de paginação (como ? =0&c=10), porque a tabela de dados lida automaticamente com a paginação quando você usa uma fonte de dados da Bonita.

source: You have unsaved changes. Do you really want to leave ?
pt_br: Você tem alterações não salvas. Você realmente deseja sair ?

source: You need to use this following css selector in your theme.css file:
pt_br: Você precisa usar este seletor css no seu arquivo theme.css:

source: You should start process form design in the studio: from the appropriate pool or human task, create a contract and launch the UI Designer. It will auto-generate a dedicated form to edit.
pt_br: É necessário iniciar o projeto de formulário de processo no studio: a partir do pool apropriado ou tarefa humana, crie um contrato e inicie o Designer de UI. Irá gerar automaticamente um formulário dedicado para editar.

source: You will have to manage the minification and update the resources URL to trigger the cache busting.
pt_br: Você terá que gerenciar a minificação e atualizar a URL dos recursos para acionar a busca no cache.

source: Your artifact was migrated from <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> to model version <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.
pt_br: Seu artefato foi migrado de <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> para modelo versão <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.

source: Your artifact was migrated to <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.
pt_br: Seu artefato foi migrado para <b>{{ctrl.migrationReport.newArtifactVersion}}</b>.

source: _self
pt_br: _auto

source: added
pt_br: adicionado

source: artifact
pt_br: artefato
