Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: '{{ctrl.newData.$$name}}' already exists
pt_br: '{{ctrl.newData.$$name}}' já existe

source: '{{newData.$$name}}' already exists
pt_br: '{{newData.$$name}}' já existe

source: (displayed in editor's property panel)
pt_br: (exibido no painel de propriedades do editor)

source: (used in your template and controller)
pt_br: (usado no template e no controller)

source: <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> String variables (with or without time information)
pt_br: <a href="https://en.wikipedia.org/wiki/ISO_8601" target="_blank">ISO 8601</a> variáveis de sequência de caracteres (com ou sem informações de hora)

source: <b><em>Now</em> button</b> sets the selected date and time to the current date and time for the user. For the time, it is rounded up or down to the closest 5 min value.
pt_br: <b><em>Agora</em> botão</b> define a data e hora selecionada para a data e hora atual do usuário. Para o momento, ele é arredondado para cima ou baixo para o valor mais próximo de 5 min.

source: <b><em>Today</em> button</b> sets the selected date to the current date for the user. It doesn't change the selected time, except when the time is not set. In that case, it's rounded up or down to the closest 5 min value.
pt_br: <b><em>hoje</em> botão</b> define a data selecionada para a data atual para o usuário. Não muda o tempo selecionado, exceto quando o tempo não é definido. Neste caso, isto é arredondado para cima ou para baixo com o valor mais próximo de 5 min.

source: <b>Note</b>: Custom-widget assets are only editable in widget editor. You can't modify them at page level to avoid side effects on other pages. So if you want to reorder custom-widget assets, please go to widget editor.
pt_br: <b>Nota</b>: Os ativos de widget personalizado são editáveis apenas no editor de widget. Você não pode modificá-los ao nível da página para evitar efeitos secundários em outras páginas. Então, se você quiser reordenar os ativos de widget personalizado, por favor, vá para o editor de widget.

source: <b>To update a form during production</b>, export the form from the UI Designer, import it into the relevant process in the portal, and then map it to the relevant task or process start event.
pt_br: <b>Para atualizar um formulário durante a produção,</b>exporte o formulário do UI Designer, importe-o no processo relevante no portal e, em seguida, mapeie-o para a tarefa ou evento de início de processo relevante.

source: <b>To use a form in a process</b>, map it in the studio to the relevant process or human task. It will be automatically packaged in the .bar archive ready to deploy in the portal.
pt_br: <b>Para usar um formulário em um processo</b>, mapeie-o ao processo ou à tarefa humana relevante usando o Studio. Será empacotado automaticamente no arquivo .bar pronto para ser instalado no portal.

source: <b>To use a layout in a business application</b>, export it from the UI Designer, import it into the portal as a resource and map it as the layout of the relevant application.
pt_br: <b>Para usar um layout em uma aplicação de negócios</b>, exporte-o a partir do UI Designer, importe-o no portal como um recurso e mapeie-o como o layout da aplicação relevante.

source: <b>To use a page in a business application</b>, export it from the UI Designer, import it into Bonita Portal resources, and from the relevant application, add it to the list of pages and to a navigation menu.
pt_br: <b>Para usar uma página em uma aplicação de negócios</b>, exporte-o do Designer de UI, importe-o para recursos de Portal Bonita e da aplicação relevante, adicione-o à lista de páginas e a um menu de navegação.

source: <b>UI Designer version</b>: {{ctrl.getUidVersion()}} - <b>Model version</b>: {{ctrl.getModelVersion()}}
pt_br: <b>Versão do UI Designer</b>: {{ctrl.getUidVersion()}} - <b>Versão do modelo</b>: {{ctrl.getModelVersion()}}

source: <b>With <em>Handle time zone</em> set to "no"</b>: User time zone is ignored and the value of the widget does not contain any time zone information (e.g., yyyy-MM-ddTHH:mm:ss).
pt_br: <b>Com <em>fuso horário</em> , definido como "não"</b>: Fuso horário do usuário é ignorado e o widget não contem qualquer informação do fuso horário (por exemplo, aaaa-MM-DDTHH:mm:ssZ).

source: <b>With <em>Handle time zone</em> set to "yes"</b>: the <em>Value</em> of the widget is in UTC (e.g., yyyy-MM-ddTHH:mm:ssZ).
pt_br: <b>Com <em>fuso horário</em> , definido como "sim"</b>: o<em>valor</em> do widget é em UTC (por exemplo, aaaa-MM-DDTHH:mm:ssZ).

source: <b>{{ctrl.artifact.name}}</b> successfully migrated.
pt_br: <b>{{ctrl.artifact.name}}</b> migrado com sucesso.

source: <b>{{ctrl.artifact.name}}</b> was migrated from <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> to <b>{{ctrl.migrationReport.newArtifactVersion}}</b> with some warning.
pt_br: <b>{{ctrl.artifact.name}}</b> foi migrado de <b>{{ctrl.migrationReport.previousArtifactVersion}}</b> para <b>{{ctrl.migrationReport.newArtifactVersion}}</b> com algum aviso.

source: <b>{{ctrl.artifact}}</b> {{ctrl.type}} has been created in an older version of the UI Designer. It needs to be migrated to the current version to be used with the latest features. This migration is automatic. <br> Note that once migrated, the page cannot be brought back to its previous state, and cannot be used in a previous version of the UI Designer.
pt_br: <b>{{ctrl.artifact}}</b> {{ctrl.type}} foi criado em uma versão mais antiga do UI Designer. Precisa ser migrado para a versão atual para ser usado com os recursos mais recentes. Essa migração é automática. <br> Note que uma vez migrado, a página não pode ser retornada para seu estado anterior. e não pode ser usado em uma versão anterior do UI Designer.

source: <code>Bordered</code><em>(Default: no)</em>: Display cells with border.
pt_br: <code>Borda</code><em>(Padrão: não)</em>: Exibir células com borda.

source: <code>Bordered</code><em>(Defaults: no)</em>: Display cells with border.
pt_br: <code>Bordo</code><em>(Padrões: não)</em>: Exibir células com borda.

source: <code>Condensed</code><em>(Default: no)</em>: Display cells without spacing.
pt_br: <code>Condensado</code><em>(Padrões: não)</em>: Exibir células sem espaço.

source: <code>Condensed</code><em>(Defaults: no)</em>: Display cells without spacing.
pt_br: <code>Condensado</code><em>(Padrões: não)</em>: Exibir células sem espaço.

source: <code>Selected</code> <em>(Default: first tab is selected)</em>: Whether the tab is selected or not
pt_br: <code>Selecionado</code> <em>(Padrão: primeira aba está selecionada)</em>: Se a aba está selecionada ou não

source: <code>Title</code>: can be calculated dynamically to display and <b>render html</b>.
pt_br: <code>Título</code>: pode ser calculado dinamicamente para exibir e <b>renderizar html</b>.

source: <code>Zebra-striping</code><em>(Default: yes)</em>: Apply a Zebra style (this style set a different background color on even and odd lines).
pt_br: <code>Zebra-striping</code><em>(Padrões: sim)</em>: Aplicar um estilo Zebra (este estilo define uma cor de fundo diferente em linhas pares e ímpares).

source: <code>Zebra-striping</code><em>(Defaults: yes)</em>: Apply a Zebra style (this style set a different background color on even and odd lines).
pt_br: <code>Zebra-striping</code><em>(Padrões: sim)</em>: Aplique um estilo Zebra (este estilo define uma cor de fundo diferente em linhas pares e ímpares).

source: <code>context</code> is an External API.
pt_br: <code>contexto</code> é uma API externa.

source: <code>cssClasses</code> <em>(Default: none)</em>: Add css classes on tab. This css class will be attached to <strong>tab-heading</strong> html element.
pt_br: <code>cssClasses</code> <em>(Padrão: nenhum)</em>: Adicionar classes css na guia. Esta classe css será anexada a <strong>guia título</strong> html.

source: <code>disabled</code> <em>(Default: no)</em>: Whether tab is clickable and can be activated.
pt_br: <code>desabilitou</code> <em>(Padrão: não)</em>: Se a aba é clicável e pode ser ativada.

source: <code>formInput</code> is a JSON object. <br>Its structure is defined by the contract inputs and the attributes are initialized with default values. It could be used to set initial values for form fields. <br>You can set the values in <code>formInput</code> either by editing the default values with constants (useful for test and debug) or with values from an object in an external source that has the same model (such as with a BDM external API). <br>You can also set the initial values of a form from some other source without using <code>formInput</code>. However, you will then have to edit <code>formOutput</code> manually.
pt_br: <code>formInput</code> é um objeto JSON. <br>Sua estrutura é definida pelas entradas do contrato e os atributos são inicializados com valores padrão. Ele pode ser usado para definir valores iniciais para os campos de formulário. <br>Você pode definir os valores em <code>formulInput</code> editando os valores padrão com constantes (útil para teste e depuração) ou com valores de um objeto em uma fonte externa que tenha o mesmo modelo (como com uma API externa BDM). <br>Você também pode definir os valores iniciais de um formulário a partir de alguma outra fonte sem usar <code>formInput</code>. No entanto, você terá que editar <code>formOutput</code> manualmente.

source: <code>formOutput</code> is a JavaScript expression returning an object. <br>Its structure matches the contract requirements and is filled with <code>formInput</code> by default. Its goal is to aggregate the fields from the form and to submit them to the task or process to fulfil the contract. On Submit, values entered or modified by the end-user and aggregated in the <code>formOutput</code> object (as defined by the <i>Data sent on click</i> property of the Submit button) are submitted to the process or task
pt_br: <code>formOutput</code> é uma expressão JavaScript retornando um objeto. <br>Sua estrutura corresponde aos requisitos do contrato e é preenchida com <code>formInput</code> por padrão. O seu objectivo é agregar os campos do formulário e submetê-los à tarefa ou processo para cumprir o contrato. Ao Enviar, valores inseridos ou modificados pelo usuário final e agregados no <code>formOutput</code> objeto (conforme definido pela <i>Dados enviados ao clicar</i> na propriedade do botão Submeter) são enviados para o processo ou tarefa

source: <code>hidden</code> <em>(Default: no)</em>: Whether tab is hidden or not.
pt_br: <code>oculto</code> <em>(Padrão: não)</em>: Se a aba está escondida ou não.

source: <code>submit_errors_list</code> is a JavaScript expression formatting the response payload to html when a submit fails.
pt_br: <code>submit_errors_list</code> é uma expressão JavaScript formatando a carga de resposta para html quando um envio falhar.

source: <code>taskId</code> is a URL Parameter. <br>It is the id of the current BPM task. You can use it as a BPM API parameter.
pt_br: <code>taskId</code> é um Parâmetro de URL. <br>É o identificador da tarefa BPM atual. É possível usá-lo como um parâmetro da API BPM.

source: <em><b>Example</b></em>: use the key <em>button.submit.name</em> on the <b>Label</b> property of a submit button. Use the key <em>date.format</em> on the <b>Date format</b> property and <em>date.placeholder</em> on the <b>Placeholder</b> property on a Date Picker widget. Then, change the <em>localization.json</em> asset to add the <em>button.submit.name</em>, <em>date.format</em> in English, <em>date.placeholder</em> translations.
pt_br: <em><b>Exemplo</b></em>: use a chave <em>button.submit.name</em> na propriedade do botão de enviar <b>Label</b>. Use a chave <em>date.format</em> na propriedade <b>Date format</b> e <em>date.placeholder</em> na propriedade <b>Placeholder</b> no Date Picker widget. Então, mude no ativo <em>localization.json</em> para adicionar o <em>button.submit.name</em>, <em>date.format</em> em Inglês, <em>date.placeholder</em> traduções..

source: <em>Add to collection</em> or <em>Remove from collection</em> actions can be used to prepare the data before sending it to the server (e.g. if you have a process/task contract with an input that is multiple). No request will be sent to the server. The button will just update the <em>Collection</em> data which must be a variable of type array (<code>[]</code> in JSON).
pt_br: <em>Adicionar à coleção</em> ou <em>Remover da coleção</em> ações podem ser usadas para preparar os dados antes de enviá-los para o servidor (por exemplo, se você tiver um processo/tarefa de contrato com uma entrada que é múltipla). Nenhum pedido será enviado para o servidor. O botão só irá atualizar <em>Coleção</em> dados que devem ser uma variável de tipo de matriz (<code>[]</code> em JSON).

source: <em>DATE (NOT RECOMMENDED)</em> (based on <code>java.util.Date</code>)
pt_br: <em>data (não recomendado)</em> (baseado em <code>java.util.Date</code>)

source: <em>DATE ONLY</em> (based on <code>java.time.LocalDate</code>)
pt_br: <em>somente data</em> (baseado em <code>java.time.LocalDate</code>)

source: <em>DATE-TIME (NO TIME ZONE)</em> (based on <code>java.time.LocalDateTime</code>): set the property <em>Handle time zone</em> to "No"
pt_br: <em>data e hora (sem fuso horário)</em> (baseado em <code>java.time.LocalDateTime</code>): defina a propriedade <em>fuso horário</em> para "Não"

source: <em>DATE-TIME (TIME ZONE)</em> (based on <code>java.time.OffsetDateTime</code>): set the property <em>Handle time zone</em> to "Yes"
pt_br: <em>data e hora (fuso horário)</em> (baseado em <code>java.time.OffsetDateTime</code>): defina a propriedade <em>fuso horário</em> para "Sim"

source: <em>Failed response value</em>: the variable will be set if the request is unsuccessful (code 4XX)
pt_br: <em>Valor de resposta falhou</em>: a variável será definida se o pedido não for bem sucedido (código 4XX)

source: <em>Note about the</em> Date Picker <em>and</em> Date Time Picker <em>widgets:</em> the <em>Placeholder</em> property translations must match the <em>Technical format</em> property values (order and number of letters). However, the <em>Placeholder</em> key should be different from the <em>Technical format</em> key to avoid translations mismatches.
pt_br: <em>Nota sobre o</em>Seletor de datas<em>e</em>Seletor de Data Hora<em>widgets:</em>o<em>Espaçoç reservado</em> as traduções de propriedade devem corresponder ao <em>formato técnico</em> valores de propriedade (ordem e número de letras). No entanto, a chave <em>Espaço reservado</em> deve ser diferente da <em>Formato técnico</em> para evitar traduções incorretas.

source: <em>Successful response value</em>: the variable will be set if the request is successful (code 2XX)
pt_br: <em>Valor de resposta bem sucedido</em>: a variável será definida se a solicitação for bem sucedida (código 2XX)

source: <i class="fa fa-warning"></i>&nbsp;By convention, the file has to be named <em>localization.json</em>
pt_br: <i class="fa fa-warning"></i>&nbsp;Por convenção, o arquivo deve ser nomeado <em>localization.json</em>

source: <i>context.myDocument_ref</i> or <i>myVar.myDocument_ref</i>
pt_br: <i>context.myDocument_ref</i> ou <i>myVar.myDocument_ref</i>

source: <p><span class="tip">Tips:</span></p> <ul> <li translate>To get data from the <i>Business Data Model</i>, please use the Business data variable type. </li> <li translate>You can use data in the URL with the <i><em ng-non-bindable>{{dataName}}</em></i> syntax. </li> <li translate>You can extend our REST API capabilities by creating REST API extensions in the Studio and use them here. </li> <li translate>You can retrieve the Status Code or Response Headers with a usual variable binding and use it in the artifact. </li> </ul>
pt_br: <p><span class="tip">Dicas:</span></p> <ul> <li translate>Para obter dados do <i>Modelo de Dados de Negócio</i>, por favor, use o tipo da variável de dados de negócio. </li> <li translate>Você pode usar dados no URL com a sintaxe <i><em ng-non-bindable>{{dataName}}</em></i> . </li> <li translate>Você pode estender os recursos da API REST criando extensões de API REST no Studio e usá-las aqui. </li> <li translate>Você pode recuperar o Código de Status ou Cabeçalhos de Resposta com uma variável comum de ligação e usá-lo no artefato. </li> </ul>

source: <span class="tip">Tip:</span> Array syntax: ["val1", "val2"], Object syntax: {"key": "value"}
pt_br: <span class="tip">Dica:</span> Sintaxe array: ["val1", "val2"], Sintaxe objeto: {"chave": "valor"}

source: <span class="tip">Tip:</span> Hit <span class="key">$</span> key to access data, use ctrl-space to trigger autocomplete.
pt_br: <span class="tip">Dica:</span> Utilize a tecla <span class="key">$</span> para acessar os dados, use ctrl + espaço para acionar o preenchimento automático.

source: <span class="tip">Tip:</span> URL parameters are located after a <em>?</em> in the page URL.
pt_br: <span class="tip">Dica:</span> os parâmetros de URL estão localizados após um <em>?</em> na URL da página.

source: <span>Create a new variable</span>
pt_br: <span>Criar uma nova variável</span>

source: <strong>$collection</strong>: the current collection
pt_br: <strong>$collection</strong>: a coleção atual

source: <strong>$index</strong>: the index of the current iteration of the collection (counting from zero)
pt_br: <strong>$index</strong>: o índice da iteração atual da coleção (contagem de zero)

source: <strong>$item</strong>: the element of the current iteration
pt_br: <strong>$item</strong>: o elemento da iteração atual

source: <strong>{{newData.businessObject.name}}</strong> doesn't exist in the Business Data Model currently deployed.
pt_br: <strong>{{newData.businessObject.name}}</strong> não existe no Modelo de Dados de Negócio atualmente implantado.

source: A <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatted String variable yyyy-MM-ddTHH:mm:ss(Z)
pt_br: A <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> variável de String formatada aaaa-MM-ddTHH:mm:ss(Z)

source: A Bonita REST API URL
pt_br: Uma URL Bonita REST API

source: A Business data variable is reloaded every time the filter value changes.
pt_br: Uma variável de dados de negócio é recarregada toda vez que o valor do filtro muda.

source: A JSON object
pt_br: Um objeto JSON

source: A TabsContainer is a container that has multiple panes, but shows only one pane at a time.
pt_br: Um TabsContainer é um container que possui vários painéis, mas mostra apenas um painel de cada vez.

source: A configuration wizard appears: create a Business Data variable by providing information on how to retrieve elements of this Business Object.
pt_br: Um assistente de configuração aparece: crie uma variável de dados de negócio fornecendo informações sobre como recuperar elementos deste objeto de negócio.

source: A filter area is displayed, depending on your selection, you may have to enter one or several attribute values. You can use a variable to fill its value using interpolation syntax.
pt_br: Uma área de filtro é exibida, dependendo da sua seleção, você pode ter que inserir um ou vários valores de atributo. Você pode usar uma variável para preencher seu valor usando a sintaxe de interpolação.

source: A local asset name must not contain special characters or spaces. An external asset name must be a standard URL.
pt_br: O nome de um asset local não deve conter caracteres especiais ou espaços. O nome de um asset externo deve ser uma URL padrão.

source: A modal container cannot be located in another container. Recommendation: drop all modal containers at the bottom of the whiteboard.
pt_br: Um container modal não pode ser localizado em outro container. Recomendação: apague todos os containers modais na parte inferior do quadro.

source: A modal container doesn't work when it is embedded in another container.
pt_br: Um container modal não funciona quando é encaixado em um outro container.

source: A multiple set chart shows one or more set of data
pt_br: Um gráfico múltiplo mostra um ou mais conjuntos de dados

source: A property that requires a constant value is presented in the Properties panel as a radio button set, drop-down list, or number selector (for the Width property). Select the required value.
pt_br: Uma propriedade que requer um valor constante é apresentada no painel de propriedades como um conjunto de botões de rádio, lista suspensa ou seletor de número (para a propriedade de largura). Selecione o valor requerido.

source: A property value is constant, dynamic, a bidirectional bond, or an interpolation.
pt_br: Um valor de propriedade é constante, dinâmico, uma ligação bidirecional, ou uma interpolação.

source: A server error occurred.
pt_br: Ocorreu um erro de servidor.

source: A single entry will be created in the LocalStorage identified by the form URL.
pt_br: Uma entrada única será criada no LocalStorage identificado pela URL do formulário.

source: A variable that contains a JSON array (single set) or JSON array of arrays (multiple sets) where each array is a set. The data can be obtained by a BDM query, API call (default or extension), or JavaScript that retrieves and formats external data
pt_br: Uma variável que contém um array JSON (conjunto único) ou matriz JSON de matrizes (vários conjuntos) onde cada array é um conjunto. Os dados podem ser obtidos por uma consulta BDM, chamada de API (padrão ou extensão), ou JavaScript que recupera e formata dados externos

source: A {{ ::importReport.overwrittenType }} with the same Id as <strong>{{ ::importReport.name }}</strong> already exists.
pt_br: Um {{ ::importReport.overwrittenType }} com o mesmo Id que <strong>{{ ::importReport.name }}</strong> já existe.

source: A {{ ::importReport.overwrittenType }} with the same identifier as <strong>{{ ::importReport.name }}</strong> already exists.
pt_br: Um {{ ::importReport.overwrittenType }} com o mesmo identificador que <strong>{{ ::importReport.name }}</strong> já existe.

source: A {{type}} asset named <em>{{ name }}</em> is already added to assets.
pt_br: Uma ativo {{type}} chamado <em>{{ name }}</em> já está adicionada aos ativos.

source: API URL
pt_br: URL da API

source: API Variables response Metadata usage
pt_br: Resposta de uso de metadados da variável API

source: API request parameters
pt_br: Parâmetros de requisição API

source: Access to $form capabilities for form container
pt_br: Acesso a capacidades $form para o contêiner de formulário

source: Action
pt_br: Ação

source: Active
pt_br: Ativo

source: Add
pt_br: Adicionar

source: Add CSS assets at page level and use them to edit the CSS classes property of any widget. (UI Designer integrates default Bootstrap style)
pt_br: Adicione assets CSS no nível da página e use-os para editar a propriedade de classes CSS de qualquer widget. (O UI Designer integra o estilo Bootstrap padrão)

source: Add JavaScript assets for custom scripts. They will be loaded and made available at page level. You can use them in variables of type JavaScript expression. In the value field of the variable, simply call the function and pass the required parameters.
pt_br: Adicione assets JavaScript para scripts personalizados. Eles serão carregados e disponibilizados no nível da página. Você pode usá-los em variáveis do tipo expressão JavaScript. No campo de valor da variável, basta chamar a função e passar os parâmetros necessários.

source: Add a modal ID, as the button will need to open the right modal container. This ID must be unique within a given page, form, or layout.
pt_br: Adicione um ID modal, pois o botão precisará abrir o recipiente modal correto. Este ID deve ser único dentro de uma página, formulário ou layout.

source: Add a new asset
pt_br: Adicionar um novo ativo

source: Add a new tab
pt_br: Adicionar uma nova aba
