Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: center
pt_br: centro

source: column
pt_br: coluna

source: custom widgets
pt_br: widgets personalizados

source: danger
pt_br: perigo

source: data model
pt_br: modelo de dados

source: default
pt_br: padrão

source: desktop screens (1200px ≤ screenSize)
pt_br: telas da área de trabalho (1200px <= screenSize)

source: error
pt_br: erro

source: expression or variable
pt_br: expressão ou variável

source: form
pt_br: formulário

source: formInput
pt_br: formulárioEntrada

source: formatted String variables
pt_br: variáveis de caracteres formatadas

source: fragment
pt_br: fragmentos

source: fragments
pt_br: fragmentos

source: has been migrated successfully. Check migration details <i class="fa fa-wrench status"></i> for more details.
pt_br: foi migrado com sucesso. Verifique os detalhes da migração <i class="fa fa-wrench status"></i> para mais detalhes.

source: hidden
pt_br: oculto

source: if you edit the page, form or layout outside the UI Designer, you will not be able to reimport it.
pt_br: se você editar a página, formulário ou layout fora do Designer da UI, você não será capaz de reimportá-la.

source: info
pt_br: informação

source: is not compatible with this UI Designer version. A newer version is required.
pt_br: não é compatível com esta versão do Designer de UI. Uma versão mais recente é necessária.

source: laptop screens (992px ≤ screenSize < 1200px)
pt_br: telas de laptop (992px <= screenSize < 1200px)

source: large
pt_br: grande

source: left
pt_br: esquerda

source: medium
pt_br: médio

source: mobile screens (screenSize < 768px)
pt_br: telas móveis (screenSize < 768px)

source: name
pt_br: nome

source: no
pt_br: não

source: number
pt_br: número

source: overwritten
pt_br: sobrescrito

source: page
pt_br: página

source: password
pt_br: senha

source: primary
pt_br: primário

source: right
pt_br: direita

source: small
pt_br: pequeno

source: success
pt_br: sucesso

source: successfully imported.
pt_br: importado com sucesso.

source: supportTicket is an object composed of a <em>subject</em>, <em>severity</em> level, user <em>environment</em>, reporter’s <em>contact</em> (<em>name</em> and <em>job title</em>), and an <em>URL</em> providing more details on the contact.
pt_br: supportTicket é um objeto composto por um <em>assunto</em>, <em>severidade</em> nível, usuário <em>ambiente</em>, relatório <em>contato</em> (<em>nome</em> e <em>título do cargo</em>), e uma <em>URL</em> que fornece mais detalhes sobre o contato.

source: tablet screens (768px ≤ screenSize < 992px)
pt_br: telas de laptop (768px <= screenSize < 992px)

source: tabs
pt_br: abas

source: text
pt_br: texto

source: top
pt_br: superior

source: view W3C's Json specification
pt_br: ver a especificação Json do W3C

source: warning
pt_br: advertência

source: widget
pt_br: widgets

source: widget editor
pt_br: editor de widget

source: yes
pt_br: sim

source: {{asset.name}} content<expand-modal></expand-modal>
pt_br: {{asset.name}} conteúdo<expand-modal></expand-modal>

source: {{ctrl.artifact}} requires a migration
pt_br: {{ctrl.artifact}} requer migração

source: {{ctrl.page.name}} information
pt_br: {{ctrl.page.name}} informações

source: {{currentLength}} of {{totalNumber}}
pt_br: {{currentLength}} de {{totalNumber}}
