Repository: bonitasoft/bonita-ui-designer
Catalog: backend/artifact-builder/src/main/resources/i18n/lang-template-*.po
Languages: pt_br

source: If you choose 'no', HTML code will be escaped instead of being interpreted. If you choose ‘Yes’, this could potentially lead to HTML injections attacks. Please take into account these risks.
pt_br: Se você escolher 'não', o código HTML será escapado em vez de ser interpretado. Se você escolher “Sim”, isso pode potencialmente levar a ataques de injeções HTML. Por favor, leve em conta esses riscos.

source: If you create your own user interface, bind your Business data variable on widget properties or use your variable in javascript expressions. Be careful, by default each business data variable is an array (even if only one result from query is returned).
pt_br: Se você criar sua própria interface de usuário, vincule sua variável de dados de negócio em propriedades do widget ou use sua variável em expressões javascript. Cuidado, por padrão, cada variável de dados de negócio é uma matriz (mesmo que apenas um resultado da consulta seja retornado).

source: If you need to add links, icons, actions or customize styles, now you are able as you can enable html computing into table cells. New stylings properties are available to differentiate lines (zebra-striping), condensate table contents or even border your cells and table.
pt_br: Se você precisa adicionar links, ícones, ações ou estilos personalizados, agora você é capaz como você pode habilitar a computação html em células de tabela. Novas propriedades de estilos estão disponíveis para diferenciar linhas (zebra-striping), conteúdo da tabela de condensadas ou até mesmo colocar bordas em suas células e tabela.

source: If you specify an expression, the result must be an array of strings
pt_br: Se você especificar uma expressão, o resultado deve ser um array de strings

source: Image or Localization assets are not imported in index.html. So we don't need to reorder them.
pt_br: Os ativos de imagem ou localização não são importados no index.html. Então não precisamos reordená-los.

source: Import
pt_br: Importar

source: Import a UI Designer artifact
pt_br: Importar um artefato do UI Designer

source: Import error
pt_br: Erro de importação

source: Import error: incompatible artifact
pt_br: Erro de importação: artefato incompatível

source: Import the moment.js library as an external asset.
pt_br: Importar a biblioteca moment.js como um recurso externo.

source: Import this JavaScript file as a local page asset.
pt_br: Importar este arquivo JavaScript como um asset local de página.

source: Import {{ ::importReport.name }}
pt_br: Importar {{ ::importReport.name }}

source: Import, define or deploy a Business Data Model in Bonita Studio.
pt_br: Importar, definir ou implantar um Modelo de Dados de Negócio no Bonita Studio.

source: Improve collaboration on UID artifacts
pt_br: Melhorar colaboração em artefatos UID

source: Improvements on the widget switch
pt_br: Melhorias na mudança de widget

source: In 'CSS Classes' property add the <code>zebra-custom</code> class
pt_br: Na propriedade 'Classes CSS' adicione a classe <code>zebra-custom</code>

source: In 'CSS Classes' property add the following class <code>zebra-custom</code>
pt_br: Na propriedade 'Classes CSS' adicione a classe <code>zebra-custom</code>

source: In 'Classes CSS' property add the following value
pt_br: Na propriedade 'Classes CSS' adiciona o seguinte valor

source: In a JavaScript asset, you can specify a dependency on an Angular module. First add the JavaScript asset, and then add the module name in the dedicated section. You can find the the available modules on <a href="http://ngmodules.org/">http://ngmodules.org/</a>.
pt_br: Em um asset JavaScript, você pode especificar uma dependência de um módulo AngularJS. Primeiro adicione o asset JavaScript e, em seguida, adicione o nome do módulo na seção dedicada. Você pode encontrar os módulos disponíveis em <a href="http://ngmodules.org/">http://ngmodules.org/</a>.

source: In a form, a page, or a layout, we recommend to drop modal containers at the bottom of the editor content.
pt_br: Em um formulário, uma página ou um layout, recomendamos que soltem containers modais na parte inferior do conteúdo do editor.

source: In a process form, if you have defined business variables in your process, use the link to the variable to retrieve using the context variable:
pt_br: Em um formulário de processo, se tiver definido variáveis de negócios em seu processo, use o link para a variável para recuperar usando a variável de contexto:

source: In addition to the <em>Successful response value</em> variable, for the <em>POST</em>,<em>PUT</em>,<em>DELETE</em>, <em>Start process</em> and <em>Submit task</em> requests you also have the possibility to define a <em>Target URL on success</em> that will be used to set the current window (frame) location when the request is successful.
pt_br: Adicionalmente ao <em>valor de resposta bem sucedido</em> para a variável <em>POST</em>,<em>PUT</em>,<em>DELETE</em>, <em>Iniciar processo</em> e <em>Enviar tarefa</em> solicita que você também tenha a possibilidade de definir uma <em>URL de destino no sucesso</em> que será usado para definir a localização atual (frame) quando a solicitação for bem sucedida.

source: In case your application is not available, please log in using a different account
pt_br: Caso sua aplicação não esteja disponível, faça login usando uma conta diferente

source: In folder:
pt_br: Na pasta:

source: In production, if the user is logged into Bonita Portal, UI artifacts are displayed in the Portal language selected by the user or in the browser locale.
pt_br: Em produção, se o usuário estiver logado no Portal Bonita, artefatos da UI são exibidos no idioma do Portal selecionado pelo usuário ou na localidade do navegador.

source: In some case, you want override your theme to display <b>one specific table</b>, to do this:
pt_br: Em algum caso, você quer substituir seu tema para exibir <b>uma tabela específica</b>, para fazer isto:

source: In some case, you want to override your theme to display <b>one</b> data-table with specific line color, to do this:
pt_br: Em algum caso, você quer substituir seu tema para exibir <b>uma</b> tabela com cor de linha específica, para fazer isto:

source: In some cases, other types of variables are created: <ul> <li> When the business variable is edited in the form (as specified in the contract creation wizard), a UI Designer variable is created for each variable (External API). <br>For example, if the contract input has been created from a business variable 'invoice' in the process, a variable <code>invoice</code> is created in the form and its URL is set to <span ng-non-bindable>../{{context.invoice_ref.link}}</span>. <br>If <code>invoice</code> contains lazy relations, additional variables are generated for each lazy relation to resolve (using <em>lazyRef</em> filter). <br>For example, if 'invoice' has a 'customer' relation in lazy, an External API variable <code>invoice_customer</code> is added. Its URL is set to <span ng-non-bindable>{{invoice|lazyRef:'customer'}}</span>.</li> <li>To display an aggregated object, a Select widget is generated to display the <em>available values</em> of the object. The variable (External API) bound to the widget is created. It queries the BDM. <br>For example, when the object Invoice has an aggregated object Customer, a variable <code>customer_query</code> is created with URL: <span ng-non-bindable>../API/bdm/businessData/com.company.model.Customer?q=find&p=0&c=99</span>. By default it uses the <code>find</code> query with a default pagination (only first 100 objects are returned).</li> </ul>
pt_br: Em alguns casos, outros tipos de variáveis ​​são criados: <ul> <li> Quando a variável de negócios é editada no formulário (conforme especificado no assistente de criação de contrato), uma variável do UI Designer é criada para cada variável (API Externa).<br>Por exemplo, se a entrada do contrato foi criada a partir de uma variável de negócios 'fatura' no processo, uma variável <code>fatura</code> é criada no formulário e sua URL é definida como <span ng-non-bindable>../{{context.fatura_ref.link}}</span>. <br>Se <code>fatura</code> contiver relações ociosas, variáveis ​​adicionais serão geradas para cada relação ociosa a ser resolvida (usando o filtro <em>lazyRef</em>). <br>Por exemplo, se 'fatura' tiver uma relação 'cliente' ociosa, uma variável de API externa <code>fatura-cliente</code> será adicionada. Sua URL é definida como <span ng-non-bindable>{{fatura|lazyRef: 'cliente'}}</span>. </Li> <li> Para exibir um objeto agregado, um widget Selecionar é gerado para exibir o <em>valores disponíveis</em> do objeto. A variável (External API) ligada ao widget é criada. Consulta o BDM. <br>Por exemplo, quando o objeto Fatura possui um objeto agregado Cliente, uma variável <code>cliente_query </code> é criada com URL: <span ng-non-bindable>../API/bdm/businessData/com.company.model.Cliente? q=procurar&p=0&c=99</span>. Por padrão, ele usa a consulta <code>procurar</code> com uma paginação padrão (somente os primeiros 100 objetos são retornados). </Li> </ul>

source: In tab title properties add the following value
pt_br: As propriedades do título da guia adicionam o seguinte valor

source: In the Asset list, you can manually change the order of CSS and Javascript page assets. Reorder this files can be useful to override some css classes or javascript functions.
pt_br: Na lista de conteúdos, você pode alterar manualmente a ordem dos arquivos de páginas CSS e Javascript. Reordenar estes arquivos pode ser útil para substituir algumas classes css ou funções javascript.

source: In the Studio, a form must be linked to a process or a task, using the contract; a page is linked to an application descriptor.
pt_br: No Studio, um formulário deve ser ligado a um processo ou tarefa, usando o contrato; uma página está ligada a um descritor de aplicativo.

source: In the Switch wizard, select or type the widget to switch to, then click <b>Show properties</b>.<br> Whenever possible, properties in the source widgets are mapped with similar properties in the target widget. You can edit that or map more, then click on <b>Switch</b>.
pt_br: No assistente de Switch, selecione ou digite o widget para alternar, então clique em <b>Mostrar propriedades</b>.<br> Sempre que possível, propriedades nos widgets de origem são mapeadas com propriedades semelhantes no widget de destino. Você pode editar isso ou mapear mais, e clique em <b>mudar</b>.

source: In the context of a form container, use $form.$invalid as a Boolean to check form validity in a widget property
pt_br: No contexto de um contêiner de formulário, use $form.$inválido como um booleano para verificar a validade do formulário em uma propriedade de widget

source: In the fragment editor, you can set the scope of a variable to <i>specific to this fragment</i> or to <i>exposed to the page</i>.
pt_br: No editor de fragmento, você pode definir o escopo de uma variável para <i>específico para esse fragmento</i> ou para <i>exposto à página</i>.

source: In the preview and at runtime, the displayed text will adapt automatically to the selected language.
pt_br: Na visualização e em tempo de execução, o texto exibido se adaptará automaticamente ao idioma selecionado.

source: In the scope of a page, form, or layout, a variable can be used to handle business data, or can contain structural information that determines how page elements behave.
pt_br: No escopo de uma página, de um formulário ou de um layout, uma variável pode ser usada para manipular dados de negócios, ou pode conter informações estruturais que determina como os elementos da página se comportam.

source: In this list, you can use the arrows to reorder assets, view local assets, edit external assets, and delete any.
pt_br: Nesta lista, é possível usar as setas para reordenar os assets, ver os assets locais, editar os assets externos e excluir qualquer asset.

source: Includes the localized version of the Technical date format property, to guide the user
pt_br: Inclui a versão localizada da propriedade de formato de data técnica, para orientar o usuário

source: Includes the localized version of the Technical time format property, to guide the user
pt_br: Inclui a versão localizada da propriedade de formato hora técnico, para orientar o usuário

source: Incorrect zip structure.
pt_br: Estrutura zip incorreta.

source: Inline
pt_br: Em linha

source: Input field with content completion from a given list
pt_br: Campo de entrada com conclusão de conteúdo a partir de uma determinada lista

source: Input: <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatted String (yyyy-MM-dd), Date object or Long number <br>Output: Date object (see widget help)
pt_br: Entrada: <a href='https://en.wikipedia.org/wiki/ISO_8601' target='_blank'>ISO 8601</a> formatado String (yyyy-MM-dd), Data objeto ou número Longo <br>Saída: Data objeto (consulte a ajuda do widget)

source: Integration with Bonita platform
pt_br: Integração com a plataforma Bonita BPM

source: Interpolation
pt_br: Interpolação

source: Interpret HTML
pt_br: Interpretar HTML

source: Interpret HTML in tab heading
pt_br: Interpretar HTML no cabeçalho da aba

source: Invalid URL: it must only contain alphanumeric character or #!:.?+=&%@-/
pt_br: URL inválida: deve conter apenas caracteres alfanuméricos ou #!:.?+=&%@-/

source: Invalid {{ infos.modelfile }} json file structure
pt_br: Estrutura de arquivo json inválida {{ infos.modelfile }}

source: It is now possible to define the tab that will be selected by default in the tab group with the new "Selected" field on the tabs.
pt_br: Agora é possível definir a aba que será selecionada por padrão no grupo tab com o novo campo "Selecionado" nas abas.

source: It is now possible to easily bind the metadata of an API variable response (header, status code, and response value) to other variables
pt_br: Agora é possível vincular facilmente os metadados de uma resposta de variável de API (cabeçalho, código de status e valor de resposta) a outras variáveis

source: It is possible to deactivate the animation when the modal appears. The main usage of this option would be to create a wizard, where several modal containers are displayed in a sequence.
pt_br: É possível desativar a animação quando o modal aparece. O uso principal desta opção seria criar um assistente, onde vários containers modais são exibidos em uma sequência.

source: Item to remove
pt_br: Item a ser removido

source: JSON descriptor to exchange between UI Designers
pt_br: Descritor JSON para trocar entre Designers de UI

source: JSON specifications can be found on the
pt_br: As especificações JSON podem ser encontradas em

source: Javascript expression
pt_br: Expressão JavaScript

source: Know your Business Data Model and retrieve Business Data information is simpler than never
pt_br: Conheça seu Modelo de Dados de Negócio e recupere informações de dados de negócio mais simples do que nunca

source: Label
pt_br: Etiqueta

source: Label hidden
pt_br: Etiqueta oculta

source: Label position
pt_br: Posição da etiqueta

source: Label width
pt_br: Largura da etiqueta

source: Labels
pt_br: Etiquetas

source: Large devices (width ≥ 1200px)
pt_br: Dispositivos grandes (largura ≥ 1200px)

source: Last
pt_br: Último

source: Last Update:
pt_br: Última atualização:

source: Lazy reference filter
pt_br: Filtro de referência lento

source: Legend hidden
pt_br: Legenda oculta

source: Level 1
pt_br: Nível 1

source: Level 2
pt_br: Nível 2

source: Level 3
pt_br: Nível 3

source: Level 4
pt_br: Nível 4

source: Level 5
pt_br: Nível 5

source: Level 6
pt_br: Nível 6

source: Line
pt_br: Linha

source: Link to display or download a document
pt_br: Link para exibir ou baixar um documento

source: Linked to a process instantiation or a task, using the contract
pt_br: Ligado a uma instanciação de processo ou tarefa, usando o contrato

source: Linked to an application descriptor.
pt_br: Vinculado a um descritor de aplicação.

source: List from column keys
pt_br: Listar das chaves das colunas

source: List of cases open for a process definition id
pt_br: Lista de casos abertos para uma identificação de definição de processo

source: List of human task in ready state for current user (pending + assigned)
pt_br: Lista de tarefas humanas em estado pronto para o usuário atual (pendente + atribuído)

source: Loading {{mode}}...
pt_br: Carregando {{mode}}...

source: Localization
pt_br: Localização

source: Long number values (Milliseconds since epoch)
pt_br: Valores de número longo (milissegundos desde período)

source: Look what you're missing
pt_br: Veja o que você está faltando

source: Make sure the technical format value and its translations is a valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">date format</a>.
pt_br: Certifique-se de que o valor do formato técnico e suas traduções são válidos <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formato data</a>.

source: Make sure the technical format values and their translations are valid <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">date/time formats</a>.
pt_br: Certifique-se de que os valores do formato técnico e suas traduções são válidos <a href="https://code.angularjs.org/1.3.18/docs/api/ng/filter/date" target="_blank">formatos de data/hora</a>.

source: Malformed json file
pt_br: Arquivo json malformado

source: Mark as favorite
pt_br: Marcar como favorito

source: Max value
pt_br: Valor máximo

source: Medium devices (width ≥ 992px)
pt_br: Dispositivos médios (largura ≥ 992px)

source: Message
pt_br: Mensagem

source: Metadata
pt_br: Metadados

source: Migrate
pt_br: Migrar

source: Migration
pt_br: Migrações

source: Migration enhancements
pt_br: Aprimoramentos de migração

source: Migration notes
pt_br: Notas de migração

source: Migration report
pt_br: Relatório de migração

source: Milliseconds since Epoch (number or string variable)
pt_br: Milissegundos desde período (número ou sequência de caracteres variável)

source: Min value
pt_br: Valor mínimo

source: Minified widgets JavaScript for optimized performance
pt_br: JavaScript Minificado para otimizar desempenho

source: Miscellaneous toolbar
pt_br: Barra de ferramentas diversas

source: Modal Id
pt_br: Id Modal

source: Modal container
pt_br: Container modal

source: Modals
pt_br: Modal

source: Move asset down
pt_br: Mover ativo para baixo

source: Move asset up
pt_br: Mover o ativo para cima

source: Move the row down
pt_br: Mover a linha para baixo

source: Move the row up
pt_br: Mover a linha para cima

source: Multi-line, expandable, text input field
pt_br: Multi-linha, expansível, campo de entrada de texto

source: Multiple content for tabs container
pt_br: Conteúdos múltiplos para o contêiner de abas

source: Multiple groups of widgets, each group in a tab
pt_br: Vários grupos de widgets, cada grupo em uma aba

source: Multiple screen size
pt_br: Múltiplos tamanhos de tela

source: Multiple set charts
pt_br: Gráficos múltiplos

source: Name
pt_br: Nome

source: Name must be less than {{maxlength}} characters long
pt_br: O nome deve ter menos de {{maxlength}} caracteres

source: Name must contains only alphanumeric characters with no space
pt_br: O nome deve conter apenas caracteres alfanuméricos sem espaços

source: Navigation link to another page or form
pt_br: Link de navegação para outra página ou formulário

source: New embedded AngularJS filter to resolve the lazy references of a business object
pt_br: Novo filtro AngularJS embutido para resolver as referências lentas de um objeto de negócio

source: New modal container to create pop-ins
pt_br: Novo contêiner modal para criar pop-ins

source: New window (_blank)
pt_br: Nova janela (_blank)

source: Next page to display, for applications. In the Portal, it is ignored as navigation is managed automatically
pt_br: Próxima página a ser exibida, para aplicações. No portal é ignorado como a navegação é gerenciada automaticamente

source: No
pt_br: Não

source: No Bonita REST API calls.
pt_br: Nenhuma chamada Bonita REST API.

source: No Business Data Model currently deployed.
pt_br: Nenhum Modelo de Dados de Negócio atualmente implantado.

source: No application selected
pt_br: Nenhuma aplicação selecionada

source: No artifact found.
pt_br: Nenhum artefato encontrado.

source: No variable
pt_br: Sem variáveis

source: No {{label}} asset (no scope selected).
pt_br: Nenhum item {{label}} (nenhum escopo selecionado).

source: No {{label}} asset at page level.
pt_br: Nenhum ativo {{label}} no nível da página.

source: No {{label}} asset at widget level.
pt_br: Nenhum ativo {{label}} no nível do widget.

source: No {{label}} asset.
pt_br: Nenhum ativo {{label}}.

source: No. This data will be specific to this fragment.
pt_br: Não. Estes dados serão específicos deste fragmento.

source: No: user time zone is ignored. <br>Yes: display/input reflects the user time zone and may be different from value
pt_br: Não: fuso horário do usuário é ignorado. <br>Sim: exibir/entrada reflete a zona de tempo do usuário e pode ser diferente do valor

source: None
pt_br: Nenhum

source: Not compatible with current UI Designer version. To open it, use a newer version of UI Designer.
pt_br: Não é compatível com a versão atual do Designer. Para abri-lo, use uma versão mais recente do UI Designer.

source: Note that reordering assets is disabled when the list is a search results list. Indeed, reordering is only relevant if the complete list of page assets is displayed.
pt_br: Note que reordenar os arquivos está desativado quando a lista é uma lista de resultados de pesquisa. Na verdade, reordenar é relevante apenas se a lista completa de arquivos de página for exibida.

source: Noteworthy changes
pt_br: Alterações dignas de nota

source: Now
pt_br: Agora

source: Now button label
pt_br: Rótulo do botão agora

source: Number of array elements defines the number of times the container structure is repeated. Array data is available to widgets in the container
pt_br: O número de elementos do array define o número de vezes que a estrutura do contêiner é repetida. Os dados da matriz estão disponíveis para widgets no contêiner

source: Object key to display
pt_br: Chave do objeto a ser exibido

source: Object key to display. Leave it empty for whole object
pt_br: Chave do objeto a ser exibida. Deixe em branco para todo o objeto

source: Once you select an element, edit its properties in the properties panel on the right.
pt_br: Uma vez um elemento selecionado, edite suas propriedades no painel de propriedades, à direita.

source: Only works with formats supported by the browser (by default PDF and image)
pt_br: Somente funciona com formatos suportados pelo navegador (por padrão PDF e imagem)

source: Open Modal
pt_br: Abrir Modal

source: Open documentation
pt_br: Abrir documentação

source: Open help
pt_br: Abrir ajuda

source: Open modal
pt_br: Abrir Modal

source: Open your preview in a browser tab to set new URL parameters, play with dynamic browser sizing, and to reuse the same URL in another browser for testing purposes.
pt_br: Abra a pré-visualização em uma aba do navegador para definir novos parâmetros de URL, reproduzir com tamanho do navegador dinâmico, e reutilizar a mesma URL em outro navegador para fins de teste.

source: Or use the <b>Switch</b> menu option close to the widget name in the properties panel.
pt_br: Ou use a opção de menu <b>Alternar</b> próxima ao nome do widget no painel de propriedades.

source: Ordered by artifact name.<br/>Click to sort by last update
pt_br: Ordenado por nome de artefato.<br/>Clique para ordenar por última atualização
